[NoCoverage] Block removal mutation
NinePSharp/NinePSharp.Server/backends/MockBackend.cs:14:5
     private readonly ILuxVaultService _vault;
 
     public MockBackend(ILuxVaultService vault)
-    {
-        _vault = vault;
-    }
+    {}
 
     public string Name => "Mock";

[NoCoverage] Null coalescing mutation (remove left)
NinePSharp/NinePSharp.Server/backends/MockBackend.cs:23:21
 
     public Task InitializeAsync(IConfiguration configuration)
     {
-        MountPath = configuration["MountPath"] ?? MountPath;
+        MountPath = MountPath;
         Console.WriteLine($"[Mock Backend] Initialized with MountPath: {MountPath}");
         return Task.CompletedTask;

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockBackend.cs:24:9
     public Task InitializeAsync(IConfiguration configuration)
     {
         MountPath = configuration["MountPath"] ?? MountPath;
-        Console.WriteLine($"[Mock Backend] Initialized with MountPath: {MountPath}");
+        ;
         return Task.CompletedTask;
     }
