[Killed] Block removal mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:55:5
         IClusterManager clusterManager,
         IConfiguration configuration,
         IEmercoinAuthService authService)
-    {
-        _logger = logger;
-        _config = config.Value;
-        _backends = backends;
-        _dispatcher = dispatcher;
-        _clusterManager = clusterManager;
-        _configuration = configuration;
-        _authService = authService;
-    }
+    {}
 
     protected override async Task ExecuteAsync(CancellationToken stoppingToken)
killedBy: NinePSharp.Tests.ServerOrchestrationStressTests.Server_Handles_100k_Pipelined_Requests; NinePSharp.Tests.ServerStartupTests.NinePServer_Handles_Malformed_Connection_Gracefully

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:67:9
 
     protected override async Task ExecuteAsync(CancellationToken stoppingToken)
     {
-        _logger.LogInformation("NinePServer.ExecuteAsync started.");
+        ;
         try 
         {

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:71:13
         try 
         {
             // Start Cluster
-            _logger.LogInformation("Starting ClusterManager...");
+            ;
             _clusterManager.Start();
             _logger.LogInformation("ClusterManager started.");

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:72:13
         {
             // Start Cluster
             _logger.LogInformation("Starting ClusterManager...");
-            _clusterManager.Start();
+            ;
             _logger.LogInformation("ClusterManager started.");
 

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:73:13
             // Start Cluster
             _logger.LogInformation("Starting ClusterManager...");
             _clusterManager.Start();
-            _logger.LogInformation("ClusterManager started.");
+            ;
 
             _logger.LogInformation("Starting backend initialization loop. Total backends: {Count}", _backends.Count());

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:75:13
             _clusterManager.Start();
             _logger.LogInformation("ClusterManager started.");
 
-            _logger.LogInformation("Starting backend initialization loop. Total backends: {Count}", _backends.Count());
+            ;
             foreach (var backend in _backends)
             {

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:78:17
             _logger.LogInformation("Starting backend initialization loop. Total backends: {Count}", _backends.Count());
             foreach (var backend in _backends)
             {
-                _logger.LogInformation("Initializing backend: {Name}", backend.Name);
+                ;
                 try
                 {

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:82:21
                 try
                 {
                     var section = _configuration.GetSection($"Server:{backend.Name}");
-                    await backend.InitializeAsync(section);
+                    ;
                     _logger.LogInformation("Backend '{BackendName}' initialized at {MountPath}", backend.Name, backend.MountPath);
                     

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:83:21
                 {
                     var section = _configuration.GetSection($"Server:{backend.Name}");
                     await backend.InitializeAsync(section);
-                    _logger.LogInformation("Backend '{BackendName}' initialized at {MountPath}", backend.Name, backend.MountPath);
+                    ;
                     
                     if (_clusterManager.Registry != null)

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:87:25
                     
                     if (_clusterManager.Registry != null)
                     {
-                        _logger.LogInformation("Registering backend actor for {Name}...", backend.Name);
+                        ;
                         var backendActor = _clusterManager.System!.ActorOf(Props.Create(() => new Cluster.Actors.BackendSupervisorActor(backend)), $"backend-{backend.Name}");
                         _clusterManager.Registry.Tell(new BackendRegistration(backend.MountPath, backendActor));

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:89:25
                     {
                         _logger.LogInformation("Registering backend actor for {Name}...", backend.Name);
                         var backendActor = _clusterManager.System!.ActorOf(Props.Create(() => new Cluster.Actors.BackendSupervisorActor(backend)), $"backend-{backend.Name}");
-                        _clusterManager.Registry.Tell(new BackendRegistration(backend.MountPath, backendActor));
+                        ;
                     }
                 }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:94:21
                 }
                 catch (Exception ex)
                 {
-                    _logger.LogError(ex, "Failed to initialize backend '{BackendName}'", backend.Name);
+                    ;
                 }
             }

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:97:13
                     _logger.LogError(ex, "Failed to initialize backend '{BackendName}'", backend.Name);
                 }
             }
-            _logger.LogInformation("Backend initialization loop finished.");
+            ;
 
             _logger.LogInformation("Checking configuration for endpoints...");

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:99:13
             }
             _logger.LogInformation("Backend initialization loop finished.");
 
-            _logger.LogInformation("Checking configuration for endpoints...");
+            ;
             if (_config.Endpoints == null)
             {

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:100:17
             _logger.LogInformation("Backend initialization loop finished.");
 
             _logger.LogInformation("Checking configuration for endpoints...");
-            if (_config.Endpoints == null)
+            if (_config.Endpoints != null)
             {
                 _logger.LogCritical("Server:Endpoints section is missing from configuration!");
killedBy: NinePSharp.Tests.ServerOrchestrationStressTests.Server_Handles_100k_Pipelined_Requests

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:102:17
             _logger.LogInformation("Checking configuration for endpoints...");
             if (_config.Endpoints == null)
             {
-                _logger.LogCritical("Server:Endpoints section is missing from configuration!");
+                ;
                 return;
             }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:103:17
             if (_config.Endpoints == null)
             {
                 _logger.LogCritical("Server:Endpoints section is missing from configuration!");
-                return;
+                ;
             }
             _logger.LogInformation("Endpoints count: {Count}", _config.Endpoints.Count);

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:105:13
                 _logger.LogCritical("Server:Endpoints section is missing from configuration!");
                 return;
             }
-            _logger.LogInformation("Endpoints count: {Count}", _config.Endpoints.Count);
+            ;
 
             var endpoint = _config.Endpoints.Count > 0 

[Killed] Conditional (false) mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:107:28
             }
             _logger.LogInformation("Endpoints count: {Count}", _config.Endpoints.Count);
 
-            var endpoint = _config.Endpoints.Count > 0 
-                ? _config.Endpoints[0] 
-                : null;
+            var endpoint = (false?_config.Endpoints[0] 
+:null);
 
             if (endpoint == null)
killedBy: NinePSharp.Tests.ServerOrchestrationStressTests.Server_Handles_100k_Pipelined_Requests

[Survived] Conditional (true) mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:107:28
             }
             _logger.LogInformation("Endpoints count: {Count}", _config.Endpoints.Count);
 
-            var endpoint = _config.Endpoints.Count > 0 
-                ? _config.Endpoints[0] 
-                : null;
+            var endpoint = (true?_config.Endpoints[0] 
+:null);
 
             if (endpoint == null)

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:111:17
                 ? _config.Endpoints[0] 
                 : null;
 
-            if (endpoint == null)
+            if (endpoint != null)
             {
                 _logger.LogWarning("No endpoints configured for 9P server.");
killedBy: NinePSharp.Tests.ServerOrchestrationStressTests.Server_Handles_100k_Pipelined_Requests

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:113:17
 
             if (endpoint == null)
             {
-                _logger.LogWarning("No endpoints configured for 9P server.");
+                ;
                 return;
             }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:114:17
             if (endpoint == null)
             {
                 _logger.LogWarning("No endpoints configured for 9P server.");
-                return;
+                ;
             }
 

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:117:13
                 return;
             }
 
-            _logger.LogInformation("Creating TcpListener on {Address}:{Port}", endpoint.Address, endpoint.Port);
+            ;
             _listener = new TcpListener(IPAddress.Parse(endpoint.Address), endpoint.Port);
             _logger.LogInformation("Starting TcpListener...");

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:119:13
 
             _logger.LogInformation("Creating TcpListener on {Address}:{Port}", endpoint.Address, endpoint.Port);
             _listener = new TcpListener(IPAddress.Parse(endpoint.Address), endpoint.Port);
-            _logger.LogInformation("Starting TcpListener...");
+            ;
             _listener.Start();
             _logger.LogInformation("9P Server listening on {Address}:{Port} ({Protocol})...", endpoint.Address, endpoint.Port, endpoint.Protocol);

[Timeout] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:120:13
             _logger.LogInformation("Creating TcpListener on {Address}:{Port}", endpoint.Address, endpoint.Port);
             _listener = new TcpListener(IPAddress.Parse(endpoint.Address), endpoint.Port);
             _logger.LogInformation("Starting TcpListener...");
-            _listener.Start();
+            ;
             _logger.LogInformation("9P Server listening on {Address}:{Port} ({Protocol})...", endpoint.Address, endpoint.Port, endpoint.Protocol);
 

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:121:13
             _listener = new TcpListener(IPAddress.Parse(endpoint.Address), endpoint.Port);
             _logger.LogInformation("Starting TcpListener...");
             _listener.Start();
-            _logger.LogInformation("9P Server listening on {Address}:{Port} ({Protocol})...", endpoint.Address, endpoint.Port, endpoint.Protocol);
+            ;
 
             while (!stoppingToken.IsCancellationRequested)

[Timeout] Block removal mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:126:17
             while (!stoppingToken.IsCancellationRequested)
             {
                 try
-                {
-                    var client = await _listener.AcceptTcpClientAsync(stoppingToken);
-                    _ = HandleClientAsync(client, endpoint, stoppingToken);
-                }
+                {}
                 catch (OperationCanceledException)
                 {

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:136:21
                 }
                 catch (Exception ex)
                 {
-                    _logger.LogError(ex, "Error accepting client connection.");
+                    ;
                 }
             }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:142:13
         }
         catch (Exception ex)
         {
-            _logger.LogCritical(ex, "9P Server crashed during startup or execution loop");
+            ;
             throw;
         }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:143:13
         catch (Exception ex)
         {
             _logger.LogCritical(ex, "9P Server crashed during startup or execution loop");
-            throw;
+            ;
         }
         finally

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:147:13
         }
         finally
         {
-            _listener?.Stop();
+            ;
         }
     }

[Survived] Boolean mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:154:42
     private class ClientSession
     {
         public uint MSize { get; set; } = DefaultMSize;
-        public bool DotU { get; set; } = false;
+        public bool DotU { get; set; } = true;
         public X509Certificate2? ClientCertificate { get; set; }
         public SemaphoreSlim WriteLock { get; } = new(1, 1);

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:162:9
     private async Task HandleClientAsync(TcpClient client, EndpointConfig endpoint, CancellationToken ct)
     {
         var endPoint = client.Client.RemoteEndPoint;
-        _logger.LogInformation("Client connected from {EndPoint}", endPoint);
+        ;
         
         var session = new ClientSession();

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:169:17
         try
         {
             Stream finalStream = client.GetStream();
-            if (endpoint.Protocol.Equals("tls", StringComparison.OrdinalIgnoreCase))
+            if (!(endpoint.Protocol.Equals("tls", StringComparison.OrdinalIgnoreCase)))
             {
                 var sslStream = new SslStream(finalStream, false);
killedBy: NinePSharp.Tests.ServerOrchestrationStressTests.Server_Handles_100k_Pipelined_Requests

[NoCoverage] Boolean mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:171:60
             Stream finalStream = client.GetStream();
             if (endpoint.Protocol.Equals("tls", StringComparison.OrdinalIgnoreCase))
             {
-                var sslStream = new SslStream(finalStream, false);
+                var sslStream = new SslStream(finalStream, true);
                 // In a real scenario, you'd load a proper server certificate here.
                 // For now, we'll use a placeholder or assume it's handled by the OS/container.

[NoCoverage] Object initializer mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:174:59
                 var sslStream = new SslStream(finalStream, false);
                 // In a real scenario, you'd load a proper server certificate here.
                 // For now, we'll use a placeholder or assume it's handled by the OS/container.
-                await sslStream.AuthenticateAsServerAsync(new SslServerAuthenticationOptions
-                {
-                    ClientCertificateRequired = true,
-                    // RemoteCertificateValidationCallback = (sender, cert, chain, sslPolicyErrors) => true // For testing
-                }, ct);
+                await sslStream.AuthenticateAsServerAsync(new SslServerAuthenticationOptions
+{}, ct);
                 
                 finalStream = sslStream;

[NoCoverage] Boolean mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:176:49
                 // For now, we'll use a placeholder or assume it's handled by the OS/container.
                 await sslStream.AuthenticateAsServerAsync(new SslServerAuthenticationOptions
                 {
-                    ClientCertificateRequired = true,
+                    ClientCertificateRequired = false,
                     // RemoteCertificateValidationCallback = (sender, cert, chain, sslPolicyErrors) => true // For testing
                 }, ct);

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:185:25
                 {
                     session.ClientCertificate = cert;
                     bool authorized = await _authService.IsCertificateAuthorizedAsync(cert);
-                    if (!authorized)
+                    if (authorized)
                     {
                         _logger.LogWarning("Client {EndPoint} failed Emercoin authorization.", endPoint);

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:187:25
                     bool authorized = await _authService.IsCertificateAuthorizedAsync(cert);
                     if (!authorized)
                     {
-                        _logger.LogWarning("Client {EndPoint} failed Emercoin authorization.", endPoint);
+                        ;
                         // We could close the connection here, or let the backends decide based on the session state.
                     }

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:196:20
             await using var stream = finalStream;
             var headerBuffer = new byte[NinePConstants.HeaderSize];
 
-            while (!ct.IsCancellationRequested)
+            while (ct.IsCancellationRequested)
             {
                 int headerRead = await stream.ReadAtLeastAsync(headerBuffer, headerBuffer.Length, throwOnEndOfStream: false, ct);
killedBy: NinePSharp.Tests.ServerOrchestrationStressTests.Server_Handles_100k_Pipelined_Requests

[Survived] Boolean mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:198:119
 
             while (!ct.IsCancellationRequested)
             {
-                int headerRead = await stream.ReadAtLeastAsync(headerBuffer, headerBuffer.Length, throwOnEndOfStream: false, ct);
+                int headerRead = await stream.ReadAtLeastAsync(headerBuffer, headerBuffer.Length, throwOnEndOfStream: true, ct);
                 if (headerRead == 0)
                 {

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:199:21
             while (!ct.IsCancellationRequested)
             {
                 int headerRead = await stream.ReadAtLeastAsync(headerBuffer, headerBuffer.Length, throwOnEndOfStream: false, ct);
-                if (headerRead == 0)
+                if (headerRead != 0)
                 {
                     _logger.LogInformation("Client {EndPoint} disconnected cleanly.", endPoint);
killedBy: NinePSharp.Tests.ServerOrchestrationStressTests.Server_Handles_100k_Pipelined_Requests

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:201:21
                 int headerRead = await stream.ReadAtLeastAsync(headerBuffer, headerBuffer.Length, throwOnEndOfStream: false, ct);
                 if (headerRead == 0)
                 {
-                    _logger.LogInformation("Client {EndPoint} disconnected cleanly.", endPoint);
+                    ;
                     break;
                 }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:202:21
                 if (headerRead == 0)
                 {
                     _logger.LogInformation("Client {EndPoint} disconnected cleanly.", endPoint);
-                    break;
+                    ;
                 }
 

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:209:21
                 MessageTypes type = (MessageTypes)headerBuffer[4];
                 ushort tag = BinaryPrimitives.ReadUInt16LittleEndian(headerBuffer.AsSpan(5, 2));
 
-                if (size < NinePConstants.HeaderSize) 
+                if (size > NinePConstants.HeaderSize) 
                 {
                     _logger.LogError("Invalid message size {Size} from {EndPoint}", size, endPoint);
killedBy: NinePSharp.Tests.ServerOrchestrationStressTests.Server_Handles_100k_Pipelined_Requests

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:209:21
                 MessageTypes type = (MessageTypes)headerBuffer[4];
                 ushort tag = BinaryPrimitives.ReadUInt16LittleEndian(headerBuffer.AsSpan(5, 2));
 
-                if (size < NinePConstants.HeaderSize) 
+                if (!(size < NinePConstants.HeaderSize)) 
                 {
                     _logger.LogError("Invalid message size {Size} from {EndPoint}", size, endPoint);
killedBy: NinePSharp.Tests.ServerOrchestrationStressTests.Server_Handles_100k_Pipelined_Requests

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:211:21
 
                 if (size < NinePConstants.HeaderSize) 
                 {
-                    _logger.LogError("Invalid message size {Size} from {EndPoint}", size, endPoint);
+                    ;
                     break;
                 }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:212:21
                 if (size < NinePConstants.HeaderSize) 
                 {
                     _logger.LogError("Invalid message size {Size} from {EndPoint}", size, endPoint);
-                    break;
+                    ;
                 }
 

[Killed] Arithmetic mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:215:36
                     break;
                 }
 
-                uint payloadSize = size - (uint)NinePConstants.HeaderSize;
+                uint payloadSize = size + (uint)NinePConstants.HeaderSize;
                 byte[] fullMessageBuffer = ArrayPool<byte>.Shared.Rent((int)size);
                 headerBuffer.CopyTo(fullMessageBuffer, 0);
killedBy: NinePSharp.Tests.ServerOrchestrationStressTests.Server_Handles_100k_Pipelined_Requests

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:217:17
 
                 uint payloadSize = size - (uint)NinePConstants.HeaderSize;
                 byte[] fullMessageBuffer = ArrayPool<byte>.Shared.Rent((int)size);
-                headerBuffer.CopyTo(fullMessageBuffer, 0);
+                ;
 
                 if (payloadSize > 0)

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:219:21
                 byte[] fullMessageBuffer = ArrayPool<byte>.Shared.Rent((int)size);
                 headerBuffer.CopyTo(fullMessageBuffer, 0);
 
-                if (payloadSize > 0)
+                if (!(payloadSize > 0))
                 {
                     int payloadRead = await stream.ReadAtLeastAsync(fullMessageBuffer.AsMemory(NinePConstants.HeaderSize, (int)payloadSize), (int)payloadSize, throwOnEndOfStream: false, ct);
killedBy: NinePSharp.Tests.ServerOrchestrationStressTests.Server_Handles_100k_Pipelined_Requests

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:219:21
                 byte[] fullMessageBuffer = ArrayPool<byte>.Shared.Rent((int)size);
                 headerBuffer.CopyTo(fullMessageBuffer, 0);
 
-                if (payloadSize > 0)
+                if (payloadSize < 0)
                 {
                     int payloadRead = await stream.ReadAtLeastAsync(fullMessageBuffer.AsMemory(NinePConstants.HeaderSize, (int)payloadSize), (int)payloadSize, throwOnEndOfStream: false, ct);
killedBy: NinePSharp.Tests.ServerOrchestrationStressTests.Server_Handles_100k_Pipelined_Requests

[Survived] Boolean mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:221:180
 
                 if (payloadSize > 0)
                 {
-                    int payloadRead = await stream.ReadAtLeastAsync(fullMessageBuffer.AsMemory(NinePConstants.HeaderSize, (int)payloadSize), (int)payloadSize, throwOnEndOfStream: false, ct);
+                    int payloadRead = await stream.ReadAtLeastAsync(fullMessageBuffer.AsMemory(NinePConstants.HeaderSize, (int)payloadSize), (int)payloadSize, throwOnEndOfStream: true, ct);
                     if (payloadRead < payloadSize) 
                     {

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:222:25
                 if (payloadSize > 0)
                 {
                     int payloadRead = await stream.ReadAtLeastAsync(fullMessageBuffer.AsMemory(NinePConstants.HeaderSize, (int)payloadSize), (int)payloadSize, throwOnEndOfStream: false, ct);
-                    if (payloadRead < payloadSize) 
+                    if (payloadRead <= payloadSize) 
                     {
                         ArrayPool<byte>.Shared.Return(fullMessageBuffer);
killedBy: NinePSharp.Tests.ServerOrchestrationStressTests.Server_Handles_100k_Pipelined_Requests

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:222:25
                 if (payloadSize > 0)
                 {
                     int payloadRead = await stream.ReadAtLeastAsync(fullMessageBuffer.AsMemory(NinePConstants.HeaderSize, (int)payloadSize), (int)payloadSize, throwOnEndOfStream: false, ct);
-                    if (payloadRead < payloadSize) 
+                    if (!(payloadRead < payloadSize)) 
                     {
                         ArrayPool<byte>.Shared.Return(fullMessageBuffer);
killedBy: NinePSharp.Tests.ServerOrchestrationStressTests.Server_Handles_100k_Pipelined_Requests

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:224:25
                     int payloadRead = await stream.ReadAtLeastAsync(fullMessageBuffer.AsMemory(NinePConstants.HeaderSize, (int)payloadSize), (int)payloadSize, throwOnEndOfStream: false, ct);
                     if (payloadRead < payloadSize) 
                     {
-                        ArrayPool<byte>.Shared.Return(fullMessageBuffer);
+                        ;
                         break;
                     }

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:225:25
                     if (payloadRead < payloadSize) 
                     {
                         ArrayPool<byte>.Shared.Return(fullMessageBuffer);
-                        break;
+                        ;
                     }
                 }

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:229:17
                     }
                 }
 
-                _logger.LogInformation("Incoming: size={Size}, type={Type}, tag={Tag}", size, type, tag);
+                ;
                 _logger.LogInformation("Raw Hex: {Hex}", BitConverter.ToString(fullMessageBuffer, 0, (int)size));
 

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:230:17
                 }
 
                 _logger.LogInformation("Incoming: size={Size}, type={Type}, tag={Tag}", size, type, tag);
-                _logger.LogInformation("Raw Hex: {Hex}", BitConverter.ToString(fullMessageBuffer, 0, (int)size));
+                ;
 
                 // Fire and forget handling of the message to allow pipelining

[Survived] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:240:44
                         if (response is Rversion rv)
                         {
                             session.MSize = rv.MSize;
-                            session.DotU = rv.Version == "9P2000.u";
+                            session.DotU = rv.Version != "9P2000.u";
                             _logger.LogInformation("Negotiated MSize: {MSize}, DotU: {DotU}, Version: {Version}", session.MSize, session.DotU, rv.Version);
                         }

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:241:29
                         {
                             session.MSize = rv.MSize;
                             session.DotU = rv.Version == "9P2000.u";
-                            _logger.LogInformation("Negotiated MSize: {MSize}, DotU: {DotU}, Version: {Version}", session.MSize, session.DotU, rv.Version);
+                            ;
                         }
 

[Timeout] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:244:25
                             _logger.LogInformation("Negotiated MSize: {MSize}, DotU: {DotU}, Version: {Version}", session.MSize, session.DotU, rv.Version);
                         }
 
-                        await SendResponseAsync(stream, response, session.WriteLock);
+                        ;
                     }
                     catch (Exception ex) {
