[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:247:25
                         await SendResponseAsync(stream, response, session.WriteLock);
                     }
                     catch (Exception ex) {
-                        _logger.LogError(ex, "Unexpected error during dispatch");
+                        ;
                         // Should probably send Rlerror if .L is negotiated, but standard Rerror for now
                         await SendResponseAsync(stream, new Rerror(tag, ex.Message), session.WriteLock);

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:249:25
                     catch (Exception ex) {
                         _logger.LogError(ex, "Unexpected error during dispatch");
                         // Should probably send Rlerror if .L is negotiated, but standard Rerror for now
-                        await SendResponseAsync(stream, new Rerror(tag, ex.Message), session.WriteLock);
+                        ;
                     }
                     finally {

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:252:25
                         await SendResponseAsync(stream, new Rerror(tag, ex.Message), session.WriteLock);
                     }
                     finally {
-                        ArrayPool<byte>.Shared.Return(fullMessageBuffer);
+                        ;
                     }
                 }, ct);

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:259:13
         }
         catch (Exception ex)
         {
-            _logger.LogError(ex, "Error handling client session for {EndPoint}", endPoint);
+            ;
         }
         finally

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:263:13
         }
         finally
         {
-            client.Close();
+            ;
         }
     }

[Survived] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:270:13
     private async Task<object> DispatchMessageAsync(ReadOnlyMemory<byte> fullMessageBuffer, MessageTypes type, ushort tag, ClientSession session)
     {
         var result = NinePSharp.Parser.NinePParser.parse(session.DotU, fullMessageBuffer);
-        if (result.IsError)
+        if (!(result.IsError))
         {
             _logger.LogError("Failed to parse message: {Error}", result.ErrorValue);

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:272:13
         var result = NinePSharp.Parser.NinePParser.parse(session.DotU, fullMessageBuffer);
         if (result.IsError)
         {
-            _logger.LogError("Failed to parse message: {Error}", result.ErrorValue);
+            ;
             return new Rerror(tag, result.ErrorValue);
         }

[Killed] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:284:9
         if (response is not ISerializable serializable) return;
 
         byte[] outBuffer = new byte[serializable.Size];
-        serializable.WriteTo(outBuffer);
+        ;
 
         await writeLock.WaitAsync();
killedBy: NinePSharp.Tests.ServerOrchestrationStressTests.Server_Handles_100k_Pipelined_Requests

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:286:9
         byte[] outBuffer = new byte[serializable.Size];
         serializable.WriteTo(outBuffer);
 
-        await writeLock.WaitAsync();
+        ;
         try {
             _logger.LogInformation("Outgoing: {Hex}", BitConverter.ToString(outBuffer));

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:288:13
 
         await writeLock.WaitAsync();
         try {
-            _logger.LogInformation("Outgoing: {Hex}", BitConverter.ToString(outBuffer));
+            ;
             await stream.WriteAsync(outBuffer);
         }

[Timeout] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:289:13
         await writeLock.WaitAsync();
         try {
             _logger.LogInformation("Outgoing: {Hex}", BitConverter.ToString(outBuffer));
-            await stream.WriteAsync(outBuffer);
+            ;
         }
         finally {

[Timeout] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePServer.cs:292:13
             await stream.WriteAsync(outBuffer);
         }
         finally {
-            writeLock.Release();
+            ;
         }
     }
