[Killed] Block removal mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:54:5
     }
 
     private string GetFullPath()
-    {
-        if (_currentPath.Count == 0) return "/";
-        return "/" + string.Join("/", _currentPath);
-    }
+    {}
 
     public Task<Rwalk> WalkAsync(Twalk twalk)
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_MkdirAsync_Fails_If_Already_Exists; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReaddirAsync_Fails_If_Not_Directory; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_StatfsAsync_Reflects_Actual_File_Count

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:66:17
 
         foreach (var name in twalk.Wname)
         {
-            if (name == "..")
+            if (name != "..")
             {
                 if (tempPath.Count > 0) tempPath.RemoveAt(tempPath.Count - 1);
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReaddirAsync_Fails_If_Not_Directory; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_StatfsAsync_Reflects_Actual_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count

[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:68:21
         {
             if (name == "..")
             {
-                if (tempPath.Count > 0) tempPath.RemoveAt(tempPath.Count - 1);
+                if (!(tempPath.Count > 0)) tempPath.RemoveAt(tempPath.Count - 1);
             }
             else
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_StatfsAsync_Reflects_Actual_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:68:21
         {
             if (name == "..")
             {
-                if (tempPath.Count > 0) tempPath.RemoveAt(tempPath.Count - 1);
+                if (tempPath.Count >= 0) tempPath.RemoveAt(tempPath.Count - 1);
             }
             else
killedBy: NinePSharp.Tests.MockFileSystemPropertyTests.MockFileSystem_StatfsAsync_BSize_Is_Constant; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_StatfsAsync_Reflects_Actual_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:72:17
             }
             else
             {
-                tempPath.Add(name);
+                ;
             }
 
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReaddirAsync_Fails_If_Not_Directory; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReadAsync_And_WriteAsync_Work; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_MkdirAsync_Fails_If_Parent_Not_Directory

[Survived] Conditional (false) mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:76:29
             }
 
             // Check if path exists
-            var checkPath = tempPath.Count == 0 ? "/" : "/" + string.Join("/", tempPath);
+            var checkPath = (false?"/" :"/" + string.Join("/", tempPath));
             if (_entries.TryGetValue(checkPath, out var entry))
             {

[Survived] Conditional (true) mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:76:29
             }
 
             // Check if path exists
-            var checkPath = tempPath.Count == 0 ? "/" : "/" + string.Join("/", tempPath);
+            var checkPath = (true?"/" :"/" + string.Join("/", tempPath));
             if (_entries.TryGetValue(checkPath, out var entry))
             {

[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:77:17
 
             // Check if path exists
             var checkPath = tempPath.Count == 0 ? "/" : "/" + string.Join("/", tempPath);
-            if (_entries.TryGetValue(checkPath, out var entry))
+            if (!(_entries.TryGetValue(checkPath, out var entry)))
             {
                 var qidType = entry.Type == MockEntryType.Directory ? QidType.QTDIR : QidType.QTFILE;
killedBy: NinePSharp.Tests.StateViolationTests.FID_Lifecycle_Sequence_Validation

[Survived] Conditional (true) mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:79:31
             var checkPath = tempPath.Count == 0 ? "/" : "/" + string.Join("/", tempPath);
             if (_entries.TryGetValue(checkPath, out var entry))
             {
-                var qidType = entry.Type == MockEntryType.Directory ? QidType.QTDIR : QidType.QTFILE;
+                var qidType = (true?QidType.QTDIR :QidType.QTFILE);
                 qids.Add(new Qid(qidType, 0, entry.Qid));
             }

[Survived] Conditional (false) mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:79:31
             var checkPath = tempPath.Count == 0 ? "/" : "/" + string.Join("/", tempPath);
             if (_entries.TryGetValue(checkPath, out var entry))
             {
-                var qidType = entry.Type == MockEntryType.Directory ? QidType.QTDIR : QidType.QTFILE;
+                var qidType = (false?QidType.QTDIR :QidType.QTFILE);
                 qids.Add(new Qid(qidType, 0, entry.Qid));
             }

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:80:17
             if (_entries.TryGetValue(checkPath, out var entry))
             {
                 var qidType = entry.Type == MockEntryType.Directory ? QidType.QTDIR : QidType.QTFILE;
-                qids.Add(new Qid(qidType, 0, entry.Qid));
+                ;
             }
             else
killedBy: NinePSharp.Tests.MockFileSystemPropertyTests.MockFileSystem_Multiple_Writes_Append_Correctly; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReaddirAsync_Fails_If_Not_Directory; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReadAsync_And_WriteAsync_Work

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:85:17
             else
             {
                 // Path doesn't exist, but we'll still add a QID (for compatibility)
-                qids.Add(new Qid(QidType.QTDIR, 0, (ulong)name.GetHashCode()));
+                ;
             }
         }
killedBy: NinePSharp.Tests.StateViolationTests.Walk_NewFid_Already_Exists_Returns_Error; NinePSharp.Tests.StateViolationTests.FID_Lifecycle_Sequence_Validation

[Killed] Block removal mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:91:9
 
         // Only update current path if all walks succeeded
         if (qids.Count == twalk.Wname.Length)
-        {
-            _currentPath = tempPath;
-        }
+        {}
 
         return Task.FromResult(new Rwalk(twalk.Tag, qids.ToArray()));
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReaddirAsync_Fails_If_Not_Directory; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReadAsync_And_WriteAsync_Work; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_MkdirAsync_Fails_If_Parent_Not_Directory

[Killed] Block removal mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:99:5
     }
 
     public Task<Ropen> OpenAsync(Topen topen)
-    {
-        return Task.FromResult(new Ropen(topen.Tag, new Qid(QidType.QTFILE, 0, 0), 8192));
-    }
+    {}
 
     public Task<Rread> ReadAsync(Tread tread)
killedBy: NinePSharp.Tests.StateViolationTests.FID_Lifecycle_Sequence_Validation

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:107:65
     {
         var currentPath = GetFullPath();
 
-        if (_entries.TryGetValue(currentPath, out var entry) && entry.Type == MockEntryType.File)
+        if (_entries.TryGetValue(currentPath, out var entry) && entry.Type != MockEntryType.File)
         {
             // Read from file content
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReadAsync_And_WriteAsync_Work

[Killed] Logical mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:107:13
     {
         var currentPath = GetFullPath();
 
-        if (_entries.TryGetValue(currentPath, out var entry) && entry.Type == MockEntryType.File)
+        if (_entries.TryGetValue(currentPath, out var entry) || entry.Type == MockEntryType.File)
         {
             // Read from file content
killedBy: NinePSharp.Tests.StateViolationTests.FID_Lifecycle_Sequence_Validation

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:110:17
         if (_entries.TryGetValue(currentPath, out var entry) && entry.Type == MockEntryType.File)
         {
             // Read from file content
-            if (tread.Offset >= (ulong)entry.Content.Length)
+            if (tread.Offset < (ulong)entry.Content.Length)
             {
                 return Task.FromResult(new Rread(tread.Tag, Array.Empty<byte>()));
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReadAsync_And_WriteAsync_Work

[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:110:17
         if (_entries.TryGetValue(currentPath, out var entry) && entry.Type == MockEntryType.File)
         {
             // Read from file content
-            if (tread.Offset >= (ulong)entry.Content.Length)
+            if (!(tread.Offset >= (ulong)entry.Content.Length))
             {
                 return Task.FromResult(new Rread(tread.Tag, Array.Empty<byte>()));
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReadAsync_And_WriteAsync_Work

[NoCoverage] Block removal mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:111:13
         {
             // Read from file content
             if (tread.Offset >= (ulong)entry.Content.Length)
-            {
-                return Task.FromResult(new Rread(tread.Tag, Array.Empty<byte>()));
-            }
+            {}
 
             var offset = (int)tread.Offset;

[Killed] Linq method mutation (Min() to Max())
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:116:30
             }
 
             var offset = (int)tread.Offset;
-            var count = (int)Math.Min(tread.Count, (uint)(entry.Content.Length - offset));
+            var count = (int)Math.Max(tread.Count, (uint)(entry.Content.Length - offset));
             var data = new byte[count];
             Array.Copy(entry.Content, offset, data, 0, count);
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReadAsync_And_WriteAsync_Work

[Survived] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:116:59
             }
 
             var offset = (int)tread.Offset;
-            var count = (int)Math.Min(tread.Count, (uint)(entry.Content.Length - offset));
+            var count = (int)Math.Min(tread.Count, (uint)(entry.Content.Length + offset));
             var data = new byte[count];
             Array.Copy(entry.Content, offset, data, 0, count);

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:118:13
             var offset = (int)tread.Offset;
             var count = (int)Math.Min(tread.Count, (uint)(entry.Content.Length - offset));
             var data = new byte[count];
-            Array.Copy(entry.Content, offset, data, 0, count);
+            ;
 
             return Task.FromResult(new Rread(tread.Tag, data));
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReadAsync_And_WriteAsync_Work

[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:130:13
     {
         var currentPath = GetFullPath();
 
-        if (_entries.TryGetValue(currentPath, out var entry) && entry.Type == MockEntryType.File)
+        if (!(_entries.TryGetValue(currentPath, out var entry) && entry.Type == MockEntryType.File))
         {
             // Append to or overwrite file content
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReadAsync_And_WriteAsync_Work

[Survived] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:136:17
             var offset = (int)twrite.Offset;
             var data = twrite.Data.ToArray();
 
-            if (offset >= entry.Content.Length)
+            if (offset > entry.Content.Length)
             {
                 // Append

[Survived] Negate expression
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:136:17
             var offset = (int)twrite.Offset;
             var data = twrite.Data.ToArray();
 
-            if (offset >= entry.Content.Length)
+            if (!(offset >= entry.Content.Length))
             {
                 // Append

[Killed] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:139:43
             if (offset >= entry.Content.Length)
             {
                 // Append
-                var newContent = new byte[offset + data.Length];
+                var newContent = new byte[offset - data.Length];
                 Array.Copy(entry.Content, newContent, entry.Content.Length);
                 Array.Copy(data, 0, newContent, offset, data.Length);
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReadAsync_And_WriteAsync_Work

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:140:17
             {
                 // Append
                 var newContent = new byte[offset + data.Length];
-                Array.Copy(entry.Content, newContent, entry.Content.Length);
+                ;
                 Array.Copy(data, 0, newContent, offset, data.Length);
                 entry.Content = newContent;

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:141:17
                 // Append
                 var newContent = new byte[offset + data.Length];
                 Array.Copy(entry.Content, newContent, entry.Content.Length);
-                Array.Copy(data, 0, newContent, offset, data.Length);
+                ;
                 entry.Content = newContent;
             }
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReadAsync_And_WriteAsync_Work

[NoCoverage] Linq method mutation (Max() to Min())
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:147:33
             else
             {
                 // Overwrite
-                var newLength = Math.Max(entry.Content.Length, offset + data.Length);
+                var newLength = Math.Min(entry.Content.Length, offset + data.Length);
                 var newContent = new byte[newLength];
                 Array.Copy(entry.Content, newContent, entry.Content.Length);

[NoCoverage] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:147:64
             else
             {
                 // Overwrite
-                var newLength = Math.Max(entry.Content.Length, offset + data.Length);
+                var newLength = Math.Max(entry.Content.Length, offset - data.Length);
                 var newContent = new byte[newLength];
                 Array.Copy(entry.Content, newContent, entry.Content.Length);

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:149:17
                 // Overwrite
                 var newLength = Math.Max(entry.Content.Length, offset + data.Length);
                 var newContent = new byte[newLength];
-                Array.Copy(entry.Content, newContent, entry.Content.Length);
+                ;
                 Array.Copy(data, 0, newContent, offset, data.Length);
                 entry.Content = newContent;

[Killed] Block removal mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:161:5
     }
 
     public Task<Rclunk> ClunkAsync(Tclunk tclunk)
-    {
-        return Task.FromResult(new Rclunk(tclunk.Tag));
-    }
+    {}
 
     public Task<Rstat> StatAsync(Tstat tstat)
killedBy: NinePSharp.Tests.StateViolationTests.FID_Lifecycle_Sequence_Validation; NinePSharp.Tests.StateViolationTests.Double_Clunk_Returns_Error; NinePSharp.Tests.StateViolationTests.Multiple_Concurrent_FIDs_Tracked_Independently

[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:169:13
     {
         var currentPath = GetFullPath();
 
-        if (_entries.TryGetValue(currentPath, out var entry))
+        if (!(_entries.TryGetValue(currentPath, out var entry)))
         {
             var qidType = entry.Type == MockEntryType.Directory ? QidType.QTDIR : QidType.QTFILE;
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_StatAsync_Returns_Correct_Entry_Info

[Survived] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:171:27
 
         if (_entries.TryGetValue(currentPath, out var entry))
         {
-            var qidType = entry.Type == MockEntryType.Directory ? QidType.QTDIR : QidType.QTFILE;
+            var qidType = entry.Type != MockEntryType.Directory ? QidType.QTDIR : QidType.QTFILE;
             var mode = entry.Mode;
             if (entry.Type == MockEntryType.Directory)

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:173:17
         {
             var qidType = entry.Type == MockEntryType.Directory ? QidType.QTDIR : QidType.QTFILE;
             var mode = entry.Mode;
-            if (entry.Type == MockEntryType.Directory)
+            if (entry.Type != MockEntryType.Directory)
             {
                 mode |= (uint)NinePConstants.FileMode9P.DMDIR;
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_StatAsync_Returns_Correct_Entry_Info

[Killed] OrAssignmentExpression to AndAssignmentExpression mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:175:17
             var mode = entry.Mode;
             if (entry.Type == MockEntryType.Directory)
             {
-                mode |= (uint)NinePConstants.FileMode9P.DMDIR;
+                mode &= (uint)NinePConstants.FileMode9P.DMDIR;
             }
 
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_StatAsync_Returns_Correct_Entry_Info

[Survived] OrAssignmentExpression to ExclusiveOrAssignmentExpression mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:175:17
             var mode = entry.Mode;
             if (entry.Type == MockEntryType.Directory)
             {
-                mode |= (uint)NinePConstants.FileMode9P.DMDIR;
+                mode ^= (uint)NinePConstants.FileMode9P.DMDIR;
             }
 

[NoCoverage] Conditional (true) mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:185:24
         else
         {
             // Fallback for non-existent paths
-            var name = _currentPath.Count > 0 ? _currentPath.Last() : "mock";
+            var name = (true?_currentPath.Last() :"mock");
             var stat = new Stat(0, 0, 0, new Qid(QidType.QTFILE, 0, 1), 0644, 0, 0, 0, name, "scott", "scott", "scott", dotu: DotU);
             return Task.FromResult(new Rstat(tstat.Tag, stat));

[NoCoverage] Conditional (false) mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:185:24
         else
         {
             // Fallback for non-existent paths
-            var name = _currentPath.Count > 0 ? _currentPath.Last() : "mock";
+            var name = (false?_currentPath.Last() :"mock");
             var stat = new Stat(0, 0, 0, new Qid(QidType.QTFILE, 0, 1), 0644, 0, 0, 0, name, "scott", "scott", "scott", dotu: DotU);
             return Task.FromResult(new Rstat(tstat.Tag, stat));

[NoCoverage] Negate expression
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:194:13
     public Task<Rwstat> WstatAsync(Twstat twstat)
     {
         var currentPath = GetFullPath();
-        if (_entries.TryGetValue(currentPath, out var entry))
+        if (!(_entries.TryGetValue(currentPath, out var entry)))
         {
             // Only update mode for now as a stub for actual implementation

[NoCoverage] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:197:17
         if (_entries.TryGetValue(currentPath, out var entry))
         {
             // Only update mode for now as a stub for actual implementation
-            if (twstat.Stat.Mode != 0xFFFFFFFF)
+            if (twstat.Stat.Mode == 0xFFFFFFFF)
             {
                 entry.Mode = twstat.Stat.Mode;

[NoCoverage] Block removal mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:198:13
         {
             // Only update mode for now as a stub for actual implementation
             if (twstat.Stat.Mode != 0xFFFFFFFF)
-            {
-                entry.Mode = twstat.Stat.Mode;
-            }
+            {}
             return Task.FromResult(new Rwstat(twstat.Tag));
         }

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:203:9
             }
             return Task.FromResult(new Rwstat(twstat.Tag));
         }
-        throw new NinePProtocolException("File not found");
+        ;
     }
 

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:209:33
     public Task<Rremove> RemoveAsync(Tremove tremove)
     {
         var currentPath = GetFullPath();
-        if (currentPath == "/") throw new NinePProtocolException("Cannot remove root");
+        if (currentPath == "/") ;
 
         if (_entries.TryRemove(currentPath, out _))

[Survived] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:209:13
     public Task<Rremove> RemoveAsync(Tremove tremove)
     {
         var currentPath = GetFullPath();
-        if (currentPath == "/") throw new NinePProtocolException("Cannot remove root");
+        if (currentPath != "/") throw new NinePProtocolException("Cannot remove root");
 
         if (_entries.TryRemove(currentPath, out _))

[Survived] Negate expression
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:211:13
         var currentPath = GetFullPath();
         if (currentPath == "/") throw new NinePProtocolException("Cannot remove root");
 
-        if (_entries.TryRemove(currentPath, out _))
+        if (!(_entries.TryRemove(currentPath, out _)))
         {
             return Task.FromResult(new Rremove(tremove.Tag));

[NoCoverage] Block removal mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:212:9
         if (currentPath == "/") throw new NinePProtocolException("Cannot remove root");
 
         if (_entries.TryRemove(currentPath, out _))
-        {
-            return Task.FromResult(new Rremove(tremove.Tag));
-        }
+        {}
         throw new NinePProtocolException("File not found");
     }

[NoCoverage] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:226:17
             var qidType = entry.Type == MockEntryType.Directory ? QidType.QTDIR : QidType.QTFILE;
             var qid = new Qid(qidType, 0, entry.Qid);
             var mode = entry.Mode;
-            if (entry.Type == MockEntryType.Directory) mode |= (uint)NinePConstants.FileMode9P.DMDIR;
+            if (entry.Type != MockEntryType.Directory) mode |= (uint)NinePConstants.FileMode9P.DMDIR;
             
             return Task.FromResult(new NinePSharp.Messages.Rgetattr(tgetattr.Tag, (ulong)NinePConstants.GetAttrMask.P9_GETATTR_BASIC, qid, mode));

[NoCoverage] OrAssignmentExpression to AndAssignmentExpression mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:226:56
             var qidType = entry.Type == MockEntryType.Directory ? QidType.QTDIR : QidType.QTFILE;
             var qid = new Qid(qidType, 0, entry.Qid);
             var mode = entry.Mode;
-            if (entry.Type == MockEntryType.Directory) mode |= (uint)NinePConstants.FileMode9P.DMDIR;
+            if (entry.Type == MockEntryType.Directory) mode &= (uint)NinePConstants.FileMode9P.DMDIR;
             
             return Task.FromResult(new NinePSharp.Messages.Rgetattr(tgetattr.Tag, (ulong)NinePConstants.GetAttrMask.P9_GETATTR_BASIC, qid, mode));

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:240:45
     public Task<Rstatfs> StatfsAsync(Tstatfs tstatfs)
     {
         // Calculate dynamic statistics based on actual entries
-        var fileCount = _entries.Count(e => e.Value.Type == MockEntryType.File);
+        var fileCount = _entries.Count(e => e.Value.Type != MockEntryType.File);
         var dirCount = _entries.Count(e => e.Value.Type == MockEntryType.Directory);
         var totalBlocks = 100000UL;
killedBy: NinePSharp.Tests.MockFileSystemPropertyTests.MockFileSystem_Mkdir_Increases_FileCount; NinePSharp.Tests.MockFileSystemPropertyTests.MockFileSystem_FileCount_Matches_Statfs; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_StatfsAsync_Reflects_Actual_File_Count

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:241:44
     {
         // Calculate dynamic statistics based on actual entries
         var fileCount = _entries.Count(e => e.Value.Type == MockEntryType.File);
-        var dirCount = _entries.Count(e => e.Value.Type == MockEntryType.Directory);
+        var dirCount = _entries.Count(e => e.Value.Type != MockEntryType.Directory);
         var totalBlocks = 100000UL;
         var usedBlocks = (ulong)(_entries.Sum(e => e.Value.Content.Length) / 4096);
killedBy: NinePSharp.Tests.MockFileSystemPropertyTests.MockFileSystem_Mkdir_Increases_FileCount; NinePSharp.Tests.MockFileSystemPropertyTests.MockFileSystem_FileCount_Matches_Statfs; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_StatfsAsync_Reflects_Actual_File_Count

[Survived] Linq method mutation (Sum() to Max())
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:243:34
         var fileCount = _entries.Count(e => e.Value.Type == MockEntryType.File);
         var dirCount = _entries.Count(e => e.Value.Type == MockEntryType.Directory);
         var totalBlocks = 100000UL;
-        var usedBlocks = (ulong)(_entries.Sum(e => e.Value.Content.Length) / 4096);
+        var usedBlocks = (ulong)(_entries.Max(e => e.Value.Content.Length) / 4096);
 
         return Task.FromResult(new Rstatfs(tstatfs.Tag,

[Survived] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:243:34
         var fileCount = _entries.Count(e => e.Value.Type == MockEntryType.File);
         var dirCount = _entries.Count(e => e.Value.Type == MockEntryType.Directory);
         var totalBlocks = 100000UL;
-        var usedBlocks = (ulong)(_entries.Sum(e => e.Value.Content.Length) / 4096);
+        var usedBlocks = (ulong)(_entries.Sum(e => e.Value.Content.Length) * 4096);
 
         return Task.FromResult(new Rstatfs(tstatfs.Tag,

[Survived] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:249:13
             0x01021997,  // fstype (arbitrary)
             4096,        // block size
             totalBlocks, // total blocks
-            totalBlocks - usedBlocks, // free blocks
+            totalBlocks + usedBlocks, // free blocks
             totalBlocks - usedBlocks, // available blocks
             (ulong)(fileCount + dirCount), // total files

[Survived] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:250:13
             4096,        // block size
             totalBlocks, // total blocks
             totalBlocks - usedBlocks, // free blocks
-            totalBlocks - usedBlocks, // available blocks
+            totalBlocks + usedBlocks, // available blocks
             (ulong)(fileCount + dirCount), // total files
             totalBlocks - (ulong)_entries.Count, // free files (capacity - used)

[Killed] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:251:21
             totalBlocks, // total blocks
             totalBlocks - usedBlocks, // free blocks
             totalBlocks - usedBlocks, // available blocks
-            (ulong)(fileCount + dirCount), // total files
+            (ulong)(fileCount - dirCount), // total files
             totalBlocks - (ulong)_entries.Count, // free files (capacity - used)
             0,           // fsid
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_StatfsAsync_Reflects_Actual_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_StatfsAsync_Accurate_With_Many_Files; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Handles_1000_Files

[Survived] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:252:13
             totalBlocks - usedBlocks, // free blocks
             totalBlocks - usedBlocks, // available blocks
             (ulong)(fileCount + dirCount), // total files
-            totalBlocks - (ulong)_entries.Count, // free files (capacity - used)
+            totalBlocks + (ulong)_entries.Count, // free files (capacity - used)
             0,           // fsid
             256));       // max name length

[Killed] Conditional (false) mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:260:23
     public Task<Rmkdir> MkdirAsync(Tmkdir tmkdir)
     {
         var parentPath = GetFullPath();
-        var newPath = parentPath == "/" ? "/" + tmkdir.Name : parentPath + "/" + tmkdir.Name;
+        var newPath = (false?"/" + tmkdir.Name :parentPath + "/" + tmkdir.Name);
 
         // Check if parent exists and is a directory
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_StatAsync_Returns_Correct_Entry_Info

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:260:23
     public Task<Rmkdir> MkdirAsync(Tmkdir tmkdir)
     {
         var parentPath = GetFullPath();
-        var newPath = parentPath == "/" ? "/" + tmkdir.Name : parentPath + "/" + tmkdir.Name;
+        var newPath = parentPath != "/" ? "/" + tmkdir.Name : parentPath + "/" + tmkdir.Name;
 
         // Check if parent exists and is a directory
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_StatAsync_Returns_Correct_Entry_Info
