[Survived] Block removal mutation
NinePSharp/NinePSharp.Server/utils/EmercoinAuthService.cs:15:5
     private readonly ILogger<EmercoinAuthService> _logger;
 
     public EmercoinAuthService(IEmercoinNvsClient nvsClient, ILogger<EmercoinAuthService> logger)
-    {
-        _nvsClient = nvsClient;
-        _logger = logger;
-    }
+    {}
 
     public async Task<bool> IsCertificateAuthorizedAsync(X509Certificate2 certificate)

[NoCoverage] Equality mutation
NinePSharp/NinePSharp.Server/utils/EmercoinAuthService.cs:22:13
 
     public async Task<bool> IsCertificateAuthorizedAsync(X509Certificate2 certificate)
     {
-        if (certificate == null) return false;
+        if (certificate != null) return false;
 
         // Extract the thumbprint or serial number - Emercoin NVS records for SSL 

[NoCoverage] Boolean mutation
NinePSharp/NinePSharp.Server/utils/EmercoinAuthService.cs:22:41
 
     public async Task<bool> IsCertificateAuthorizedAsync(X509Certificate2 certificate)
     {
-        if (certificate == null) return false;
+        if (certificate == null) return true;
 
         // Extract the thumbprint or serial number - Emercoin NVS records for SSL 

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/utils/EmercoinAuthService.cs:29:9
         string thumbprint = certificate.Thumbprint.ToLowerInvariant();
         string serialNumber = certificate.SerialNumber.ToLowerInvariant();
 
-        _logger.LogInformation("Verifying certificate in Emercoin NVS. Thumbprint: {Thumbprint}, Serial: {Serial}", thumbprint, serialNumber);
+        ;
 
         // Check thumbprint record

[NoCoverage] Equality mutation
NinePSharp/NinePSharp.Server/utils/EmercoinAuthService.cs:33:13
 
         // Check thumbprint record
         var record = await _nvsClient.GetNameValueAsync($"ssl:{thumbprint}");
-        if (record != null)
+        if (record == null)
         {
             _logger.LogInformation("Authorized via Emercoin NVS (thumbprint match).");

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/utils/EmercoinAuthService.cs:35:13
         var record = await _nvsClient.GetNameValueAsync($"ssl:{thumbprint}");
         if (record != null)
         {
-            _logger.LogInformation("Authorized via Emercoin NVS (thumbprint match).");
+            ;
             return true;
         }

[NoCoverage] Boolean mutation
NinePSharp/NinePSharp.Server/utils/EmercoinAuthService.cs:36:20
         if (record != null)
         {
             _logger.LogInformation("Authorized via Emercoin NVS (thumbprint match).");
-            return true;
+            return false;
         }
 

[NoCoverage] Equality mutation
NinePSharp/NinePSharp.Server/utils/EmercoinAuthService.cs:41:13
 
         // Check serial number record
         record = await _nvsClient.GetNameValueAsync($"ssl:{serialNumber}");
-        if (record != null)
+        if (record == null)
         {
             _logger.LogInformation("Authorized via Emercoin NVS (serial match).");

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/utils/EmercoinAuthService.cs:43:13
         record = await _nvsClient.GetNameValueAsync($"ssl:{serialNumber}");
         if (record != null)
         {
-            _logger.LogInformation("Authorized via Emercoin NVS (serial match).");
+            ;
             return true;
         }

[NoCoverage] Boolean mutation
NinePSharp/NinePSharp.Server/utils/EmercoinAuthService.cs:44:20
         if (record != null)
         {
             _logger.LogInformation("Authorized via Emercoin NVS (serial match).");
-            return true;
+            return false;
         }
 

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/utils/EmercoinAuthService.cs:47:9
             return true;
         }
 
-        _logger.LogWarning("Certificate NOT found in Emercoin NVS.");
+        ;
         return false;
     }

[NoCoverage] Boolean mutation
NinePSharp/NinePSharp.Server/utils/EmercoinAuthService.cs:48:16
         }
 
         _logger.LogWarning("Certificate NOT found in Emercoin NVS.");
-        return false;
+        return true;
     }
 }
