[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:263:13
         var newPath = parentPath == "/" ? "/" + tmkdir.Name : parentPath + "/" + tmkdir.Name;
 
         // Check if parent exists and is a directory
-        if (!_entries.TryGetValue(parentPath, out var parent) || parent.Type != MockEntryType.Directory)
+        if (!(!_entries.TryGetValue(parentPath, out var parent) || parent.Type != MockEntryType.Directory))
         {
             throw new NinePProtocolException("Parent directory does not exist");
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_MkdirAsync_Fails_If_Already_Exists; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_MkdirAsync_Creates_Directory; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_MkdirAsync_Fails_If_Parent_Not_Directory

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:263:66
         var newPath = parentPath == "/" ? "/" + tmkdir.Name : parentPath + "/" + tmkdir.Name;
 
         // Check if parent exists and is a directory
-        if (!_entries.TryGetValue(parentPath, out var parent) || parent.Type != MockEntryType.Directory)
+        if (!_entries.TryGetValue(parentPath, out var parent) || parent.Type == MockEntryType.Directory)
         {
             throw new NinePProtocolException("Parent directory does not exist");
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_MkdirAsync_Fails_If_Already_Exists; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_MkdirAsync_Creates_Directory; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_MkdirAsync_Fails_If_Parent_Not_Directory

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:265:13
         // Check if parent exists and is a directory
         if (!_entries.TryGetValue(parentPath, out var parent) || parent.Type != MockEntryType.Directory)
         {
-            throw new NinePProtocolException("Parent directory does not exist");
+            ;
         }
 
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_MkdirAsync_Fails_If_Parent_Not_Directory

[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:269:13
         }
 
         // Check if already exists
-        if (_entries.ContainsKey(newPath))
+        if (!(_entries.ContainsKey(newPath)))
         {
             throw new NinePProtocolException("Directory already exists");
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_MkdirAsync_Fails_If_Already_Exists; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_MkdirAsync_Creates_Directory; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_StatAsync_Returns_Correct_Entry_Info

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:271:13
         // Check if already exists
         if (_entries.ContainsKey(newPath))
         {
-            throw new NinePProtocolException("Directory already exists");
+            ;
         }
 
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_MkdirAsync_Fails_If_Already_Exists

[Survived] Bitwise mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:275:27
         }
 
         // Create new directory
-        var qid = (ulong)(newPath.GetHashCode() & 0x7FFFFFFF);
+        var qid = (ulong)(newPath.GetHashCode() | 0x7FFFFFFF);
         var entry = new MockEntry
         {

[Killed] Object initializer mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:276:21
 
         // Create new directory
         var qid = (ulong)(newPath.GetHashCode() & 0x7FFFFFFF);
-        var entry = new MockEntry
-        {
-            Name = tmkdir.Name,
-            Type = MockEntryType.Directory,
-            Mode = tmkdir.Mode,
-            Gid = tmkdir.Gid,
-            Qid = qid
-        };
+        var entry = new MockEntry
+{};
 
         _entries[newPath] = entry;
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_StatAsync_Returns_Correct_Entry_Info

[NoCoverage] Conditional (false) mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:297:23
     {
         // 9P2000 create - creates a file in the current directory
         var parentPath = GetFullPath();
-        var newPath = parentPath == "/" ? "/" + tcreate.Name : parentPath + "/" + tcreate.Name;
+        var newPath = (false?"/" + tcreate.Name :parentPath + "/" + tcreate.Name);
 
         // Check if parent exists and is a directory

[NoCoverage] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:297:23
     {
         // 9P2000 create - creates a file in the current directory
         var parentPath = GetFullPath();
-        var newPath = parentPath == "/" ? "/" + tcreate.Name : parentPath + "/" + tcreate.Name;
+        var newPath = parentPath != "/" ? "/" + tcreate.Name : parentPath + "/" + tcreate.Name;
 
         // Check if parent exists and is a directory

[NoCoverage] Logical mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:300:13
         var newPath = parentPath == "/" ? "/" + tcreate.Name : parentPath + "/" + tcreate.Name;
 
         // Check if parent exists and is a directory
-        if (!_entries.TryGetValue(parentPath, out var parent) || parent.Type != MockEntryType.Directory)
+        if (!_entries.TryGetValue(parentPath, out var parent) && parent.Type != MockEntryType.Directory)
         {
             throw new NinePProtocolException("Parent directory does not exist");

[NoCoverage] Bitwise mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:306:14
         }
 
         // Check permissions (if DMDIR is set, must fail - Tcreate can only create files)
-        if ((tcreate.Perm & (uint)NinePConstants.FileMode9P.DMDIR) != 0)
+        if ((tcreate.Perm | (uint)NinePConstants.FileMode9P.DMDIR) != 0)
         {
             throw new NinePProtocolException("Cannot create directory with Tcreate, use Tmkdir");

[NoCoverage] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:306:13
         }
 
         // Check permissions (if DMDIR is set, must fail - Tcreate can only create files)
-        if ((tcreate.Perm & (uint)NinePConstants.FileMode9P.DMDIR) != 0)
+        if ((tcreate.Perm & (uint)NinePConstants.FileMode9P.DMDIR) == 0)
         {
             throw new NinePProtocolException("Cannot create directory with Tcreate, use Tmkdir");

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:308:13
         // Check permissions (if DMDIR is set, must fail - Tcreate can only create files)
         if ((tcreate.Perm & (uint)NinePConstants.FileMode9P.DMDIR) != 0)
         {
-            throw new NinePProtocolException("Cannot create directory with Tcreate, use Tmkdir");
+            ;
         }
 

[NoCoverage] Bitwise mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:312:27
         }
 
         // Create new file
-        var qid = (ulong)(newPath.GetHashCode() & 0x7FFFFFFF);
+        var qid = (ulong)(newPath.GetHashCode() | 0x7FFFFFFF);
         var entry = new MockEntry
         {

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:322:9
         };
 
         _entries[newPath] = entry;
-        _currentPath.Add(tcreate.Name); // Tcreate implicitly opens the file
+        ; // Tcreate implicitly opens the file
 
         return Task.FromResult(new Rcreate(tcreate.Tag, new Qid(QidType.QTFILE, 0, qid), 8192));

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:369:13
         // For mock: assume dfid refers to a directory path we need to compute
         var newPath = "/" + trename.Name; // Simplified for mock
 
-        if (!_entries.TryGetValue(oldPath, out var entry))
+        if (_entries.TryGetValue(oldPath, out var entry))
         {
             throw new NinePProtocolException("Source file does not exist");
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_RenameAsync_Renames_File

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:371:13
 
         if (!_entries.TryGetValue(oldPath, out var entry))
         {
-            throw new NinePProtocolException("Source file does not exist");
+            ;
         }
 

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:406:64
         var currentPath = GetFullPath();
 
         // Check if current path is a directory
-        if (!_entries.TryGetValue(currentPath, out var dir) || dir.Type != MockEntryType.Directory)
+        if (!_entries.TryGetValue(currentPath, out var dir) || dir.Type == MockEntryType.Directory)
         {
             throw new NinePProtocolException("Not a directory");
killedBy: NinePSharp.Tests.CrossBackendIntegrationTests.MockFileSystem_And_SecretFileSystem_Have_Independent_Readdir; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReaddirAsync_Fails_If_Not_Directory; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:406:13
         var currentPath = GetFullPath();
 
         // Check if current path is a directory
-        if (!_entries.TryGetValue(currentPath, out var dir) || dir.Type != MockEntryType.Directory)
+        if (_entries.TryGetValue(currentPath, out var dir) || dir.Type != MockEntryType.Directory)
         {
             throw new NinePProtocolException("Not a directory");
killedBy: NinePSharp.Tests.CrossBackendIntegrationTests.MockFileSystem_And_SecretFileSystem_Have_Independent_Readdir; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:408:13
         // Check if current path is a directory
         if (!_entries.TryGetValue(currentPath, out var dir) || dir.Type != MockEntryType.Directory)
         {
-            throw new NinePProtocolException("Not a directory");
+            ;
         }
 
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReaddirAsync_Fails_If_Not_Directory

[Survived] Linq method mutation (OrderBy() to OrderByDescending())
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:412:24
         }
 
         // Find all children of current directory
-        var children = _entries
-            .Where(e => {
-                var parentPath = Path.GetDirectoryName(e.Key)?.Replace('\\', '/') ?? "/";
-                return parentPath == currentPath && e.Key != currentPath;
-            })
-            .OrderBy(e => e.Key)
+        var children = _entries
+            .Where(e => {
+                var parentPath = Path.GetDirectoryName(e.Key)?.Replace('\\', '/') ?? "/";
+                return parentPath == currentPath && e.Key != currentPath;
+            })
+            .OrderByDescending(e => e.Key)
             .ToList();
 

[Survived] Null coalescing mutation (remove left)
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:414:34
         // Find all children of current directory
         var children = _entries
             .Where(e => {
-                var parentPath = Path.GetDirectoryName(e.Key)?.Replace('\\', '/') ?? "/";
+                var parentPath = "/";
                 return parentPath == currentPath && e.Key != currentPath;
             })

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:415:24
         var children = _entries
             .Where(e => {
                 var parentPath = Path.GetDirectoryName(e.Key)?.Replace('\\', '/') ?? "/";
-                return parentPath == currentPath && e.Key != currentPath;
+                return parentPath != currentPath && e.Key != currentPath;
             })
             .OrderBy(e => e.Key)
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count

[Killed] Logical mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:415:24
         var children = _entries
             .Where(e => {
                 var parentPath = Path.GetDirectoryName(e.Key)?.Replace('\\', '/') ?? "/";
-                return parentPath == currentPath && e.Key != currentPath;
+                return parentPath == currentPath || e.Key != currentPath;
             })
             .OrderBy(e => e.Key)
killedBy: NinePSharp.Tests.CrossBackendIntegrationTests.MockFileSystem_And_SecretFileSystem_Have_Independent_Readdir

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:425:13
 
         foreach (var child in children)
         {
-            offset++;
+            ;
             if (offset <= treaddir.Offset) continue; // Skip already-read entries
 
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count

[Survived] PostIncrementExpression to PostDecrementExpression mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:425:13
 
         foreach (var child in children)
         {
-            offset++;
+            offset--;
             if (offset <= treaddir.Offset) continue; // Skip already-read entries
 

[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:426:17
         foreach (var child in children)
         {
             offset++;
-            if (offset <= treaddir.Offset) continue; // Skip already-read entries
+            if (!(offset <= treaddir.Offset)) continue; // Skip already-read entries
 
             var childEntry = child.Value;
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:426:17
         foreach (var child in children)
         {
             offset++;
-            if (offset <= treaddir.Offset) continue; // Skip already-read entries
+            if (offset > treaddir.Offset) continue; // Skip already-read entries
 
             var childEntry = child.Value;
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count

[Survived] Conditional (false) mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:429:27
             if (offset <= treaddir.Offset) continue; // Skip already-read entries
 
             var childEntry = child.Value;
-            var qidType = childEntry.Type == MockEntryType.Directory ? QidType.QTDIR : QidType.QTFILE;
+            var qidType = (false?QidType.QTDIR :QidType.QTFILE);
             var qid = new Qid(qidType, 0, childEntry.Qid);
 

[Survived] Equality mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:429:27
             if (offset <= treaddir.Offset) continue; // Skip already-read entries
 
             var childEntry = child.Value;
-            var qidType = childEntry.Type == MockEntryType.Directory ? QidType.QTDIR : QidType.QTFILE;
+            var qidType = childEntry.Type != MockEntryType.Directory ? QidType.QTDIR : QidType.QTFILE;
             var qid = new Qid(qidType, 0, childEntry.Qid);
 

[Killed] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:434:29
 
             // Format: [qid[13] offset[8] type[1] name[s]]
             int nameLen = Encoding.UTF8.GetByteCount(childEntry.Name);
-            int entrySize = 13 + 8 + 1 + 2 + nameLen;
+            int entrySize = 13 + 8 - 1 + 2 + nameLen;
             var entryBuffer = new byte[entrySize];
 
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count

[Killed] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:434:29
 
             // Format: [qid[13] offset[8] type[1] name[s]]
             int nameLen = Encoding.UTF8.GetByteCount(childEntry.Name);
-            int entrySize = 13 + 8 + 1 + 2 + nameLen;
+            int entrySize = 13 + 8 + 1 + 2 - nameLen;
             var entryBuffer = new byte[entrySize];
 
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count

[Killed] PostIncrementExpression to PostDecrementExpression mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:439:25
 
             int writeOffset = 0;
             // Write Qid (13 bytes)
-            entryBuffer[writeOffset++] = (byte)qid.Type;
+            entryBuffer[writeOffset--] = (byte)qid.Type;
             BinaryPrimitives.WriteUInt32LittleEndian(entryBuffer.AsSpan(writeOffset, 4), qid.Version);
             writeOffset += 4;
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:440:13
             int writeOffset = 0;
             // Write Qid (13 bytes)
             entryBuffer[writeOffset++] = (byte)qid.Type;
-            BinaryPrimitives.WriteUInt32LittleEndian(entryBuffer.AsSpan(writeOffset, 4), qid.Version);
+            ;
             writeOffset += 4;
             BinaryPrimitives.WriteUInt64LittleEndian(entryBuffer.AsSpan(writeOffset, 8), qid.Path);

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:441:13
             // Write Qid (13 bytes)
             entryBuffer[writeOffset++] = (byte)qid.Type;
             BinaryPrimitives.WriteUInt32LittleEndian(entryBuffer.AsSpan(writeOffset, 4), qid.Version);
-            writeOffset += 4;
+            writeOffset -= 4;
             BinaryPrimitives.WriteUInt64LittleEndian(entryBuffer.AsSpan(writeOffset, 8), qid.Path);
             writeOffset += 8;
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:442:13
             entryBuffer[writeOffset++] = (byte)qid.Type;
             BinaryPrimitives.WriteUInt32LittleEndian(entryBuffer.AsSpan(writeOffset, 4), qid.Version);
             writeOffset += 4;
-            BinaryPrimitives.WriteUInt64LittleEndian(entryBuffer.AsSpan(writeOffset, 8), qid.Path);
+            ;
             writeOffset += 8;
 

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:443:13
             BinaryPrimitives.WriteUInt32LittleEndian(entryBuffer.AsSpan(writeOffset, 4), qid.Version);
             writeOffset += 4;
             BinaryPrimitives.WriteUInt64LittleEndian(entryBuffer.AsSpan(writeOffset, 8), qid.Path);
-            writeOffset += 8;
+            writeOffset -= 8;
 
             // Write Offset (8 bytes) - next offset to read from
killedBy: NinePSharp.Tests.MockFileSystemPropertyTests.MockFileSystem_Readdir_Offset_Pagination_Is_Consistent; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:446:13
             writeOffset += 8;
 
             // Write Offset (8 bytes) - next offset to read from
-            BinaryPrimitives.WriteUInt64LittleEndian(entryBuffer.AsSpan(writeOffset, 8), offset);
+            ;
             writeOffset += 8;
 

[Survived] AddAssignmentExpression to SubtractAssignmentExpression mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:447:13
 
             // Write Offset (8 bytes) - next offset to read from
             BinaryPrimitives.WriteUInt64LittleEndian(entryBuffer.AsSpan(writeOffset, 8), offset);
-            writeOffset += 8;
+            writeOffset -= 8;
 
             // Write Type (1 byte)

[Survived] PostIncrementExpression to PostDecrementExpression mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:450:25
             writeOffset += 8;
 
             // Write Type (1 byte)
-            entryBuffer[writeOffset++] = (byte)qid.Type;
+            entryBuffer[writeOffset--] = (byte)qid.Type;
 
             // Write Name (2 + nameLen bytes)

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:453:13
             entryBuffer[writeOffset++] = (byte)qid.Type;
 
             // Write Name (2 + nameLen bytes)
-            BinaryPrimitives.WriteUInt16LittleEndian(entryBuffer.AsSpan(writeOffset, 2), (ushort)nameLen);
+            ;
             writeOffset += 2;
             Encoding.UTF8.GetBytes(childEntry.Name).CopyTo(entryBuffer.AsSpan(writeOffset, nameLen));

[Survived] AddAssignmentExpression to SubtractAssignmentExpression mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:454:13
 
             // Write Name (2 + nameLen bytes)
             BinaryPrimitives.WriteUInt16LittleEndian(entryBuffer.AsSpan(writeOffset, 2), (ushort)nameLen);
-            writeOffset += 2;
+            writeOffset -= 2;
             Encoding.UTF8.GetBytes(childEntry.Name).CopyTo(entryBuffer.AsSpan(writeOffset, nameLen));
 

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:455:13
             // Write Name (2 + nameLen bytes)
             BinaryPrimitives.WriteUInt16LittleEndian(entryBuffer.AsSpan(writeOffset, 2), (ushort)nameLen);
             writeOffset += 2;
-            Encoding.UTF8.GetBytes(childEntry.Name).CopyTo(entryBuffer.AsSpan(writeOffset, nameLen));
+            ;
 
             entries.AddRange(entryBuffer);
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Clone_Creates_Independent_Copy; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReaddirAsync_Lists_Children

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:457:13
             writeOffset += 2;
             Encoding.UTF8.GetBytes(childEntry.Name).CopyTo(entryBuffer.AsSpan(writeOffset, nameLen));
 
-            entries.AddRange(entryBuffer);
+            ;
 
             // Stop if we've exceeded the count
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count

[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:460:17
             entries.AddRange(entryBuffer);
 
             // Stop if we've exceeded the count
-            if (entries.Count >= treaddir.Count) break;
+            if (!(entries.Count >= treaddir.Count)) break;
         }
 
killedBy: NinePSharp.Tests.MockFileSystemTests.MockFileSystem_ReaddirAsync_Lists_Children

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:460:50
             entries.AddRange(entryBuffer);
 
             // Stop if we've exceeded the count
-            if (entries.Count >= treaddir.Count) break;
+            if (entries.Count >= treaddir.Count) ;
         }
 

[Killed] Linq method mutation (Min() to Max())
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:464:44
         }
 
         var allData = entries.ToArray();
-        var chunk = allData.AsSpan(0, (int)Math.Min((long)treaddir.Count, (long)allData.Length)).ToArray();
+        var chunk = allData.AsSpan(0, (int)Math.Max((long)treaddir.Count, (long)allData.Length)).ToArray();
 
         return Task.FromResult(new Rreaddir(
killedBy: NinePSharp.Tests.MockFileSystemPropertyTests.MockFileSystem_Readdir_Offset_Pagination_Is_Consistent; NinePSharp.Tests.CrossBackendIntegrationTests.MockFileSystem_And_SecretFileSystem_Have_Independent_Readdir; NinePSharp.Tests.MockFileSystemTests.MockFileSystem_Scales_With_File_Count

[Survived] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:467:20
         var chunk = allData.AsSpan(0, (int)Math.Min((long)treaddir.Count, (long)allData.Length)).ToArray();
 
         return Task.FromResult(new Rreaddir(
-            (uint)(chunk.Length + NinePConstants.HeaderSize + 4),
+            (uint)(chunk.Length + NinePConstants.HeaderSize - 4),
             treaddir.Tag,
             (uint)chunk.Length,

[Survived] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/MockFileSystem.cs:467:20
         var chunk = allData.AsSpan(0, (int)Math.Min((long)treaddir.Count, (long)allData.Length)).ToArray();
 
         return Task.FromResult(new Rreaddir(
-            (uint)(chunk.Length + NinePConstants.HeaderSize + 4),
+            (uint)(chunk.Length - NinePConstants.HeaderSize + 4),
             treaddir.Tag,
             (uint)chunk.Length,
