[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
NinePSharp/NinePSharp.Server/utils/EmercoinClient.cs:36:13
         _config = config.Value;
         _logger = logger;
 
-        if (!string.IsNullOrEmpty(_config.Username))
+        if (string.IsNullOrEmpty(_config.Username))
         {
             var authString = Convert.ToBase64String(Encoding.ASCII.GetBytes($"{_config.Username}:{_config.Password}"));

[NoCoverage] Block removal mutation
NinePSharp/NinePSharp.Server/utils/EmercoinClient.cs:37:9
         _logger = logger;
 
         if (!string.IsNullOrEmpty(_config.Username))
-        {
-            var authString = Convert.ToBase64String(Encoding.ASCII.GetBytes($"{_config.Username}:{_config.Password}"));
-            _httpClient.DefaultRequestHeaders.Authorization = new AuthenticationHeaderValue("Basic", authString);
-        }
+        {}
     }
 

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
NinePSharp/NinePSharp.Server/utils/EmercoinClient.cs:58:17
             var content = new StringContent(JsonSerializer.Serialize(request), Encoding.UTF8, "application/json");
             var response = await _httpClient.PostAsync(_config.EndpointUrl, content);
             
-            if (!response.IsSuccessStatusCode) return null;
+            if (response.IsSuccessStatusCode) return null;
 
             using var doc = await JsonDocument.ParseAsync(await response.Content.ReadAsStreamAsync());

[NoCoverage] Negate expression
NinePSharp/NinePSharp.Server/utils/EmercoinClient.cs:61:17
             if (!response.IsSuccessStatusCode) return null;
 
             using var doc = await JsonDocument.ParseAsync(await response.Content.ReadAsStreamAsync());
-            if (doc.RootElement.TryGetProperty("result", out var result) && result.ValueKind != JsonValueKind.Null)
+            if (!(doc.RootElement.TryGetProperty("result", out var result) && result.ValueKind != JsonValueKind.Null))
             {
                 return result.GetProperty("value").GetString();

[NoCoverage] Equality mutation
NinePSharp/NinePSharp.Server/utils/EmercoinClient.cs:61:77
             if (!response.IsSuccessStatusCode) return null;
 
             using var doc = await JsonDocument.ParseAsync(await response.Content.ReadAsStreamAsync());
-            if (doc.RootElement.TryGetProperty("result", out var result) && result.ValueKind != JsonValueKind.Null)
+            if (doc.RootElement.TryGetProperty("result", out var result) && result.ValueKind == JsonValueKind.Null)
             {
                 return result.GetProperty("value").GetString();

[NoCoverage] Block removal mutation
NinePSharp/NinePSharp.Server/utils/EmercoinClient.cs:62:13
 
             using var doc = await JsonDocument.ParseAsync(await response.Content.ReadAsStreamAsync());
             if (doc.RootElement.TryGetProperty("result", out var result) && result.ValueKind != JsonValueKind.Null)
-            {
-                return result.GetProperty("value").GetString();
-            }
+            {}
         }
         catch (Exception ex)

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/utils/EmercoinClient.cs:68:13
         }
         catch (Exception ex)
         {
-            _logger.LogError(ex, "Failed to fetch name {Name} from Emercoin", name);
+            ;
         }
         
