[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:38:58
     /// </summary>
     public static void ClearSessionPasswords()
     {
-        foreach (var secret in _sessionPasswords.Values) secret.Dispose();
+        foreach (var secret in _sessionPasswords.Values) ;
         _sessionPasswords.Clear();
     }

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:39:9
     public static void ClearSessionPasswords()
     {
         foreach (var secret in _sessionPasswords.Values) secret.Dispose();
-        _sessionPasswords.Clear();
+        ;
     }
 

[Killed] Block removal mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:45:5
     public bool DotU { get; set; }
 
     public SecretFileSystem(ILogger logger, SecretBackendConfig config, ILuxVaultService vault)
-    {
-        _logger = logger;
-        _config = config;
-        _vault = vault;
-    }
+    {}
 
     public async Task<Rwalk> WalkAsync(Twalk twalk)
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.GetFileSystem_Returns_PathIsolated_Clone_Per_Connection; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:59:41
         {
             if (name == "..")
             {
-                if (tempPath.Count > 0) tempPath.RemoveAt(tempPath.Count - 1);
+                if (tempPath.Count > 0) ;
             }
             else
killedBy: NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_Walk_To_Vault_And_Back_Is_Consistent

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:65:13
             {
                 tempPath.Add(name);
             }
-            qids.Add(GetQid(tempPath));
+            ;
         }
         if (qids.Count == twalk.Wname.Length) _currentPath = tempPath;
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.GetFileSystem_Returns_PathIsolated_Clone_Per_Connection; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Boolean mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:73:37
 
     private bool IsDirectory(List<string> path)
     {
-        if (path.Count == 0) return true;
+        if (path.Count == 0) return false;
         if (path[0] == "vault" && path.Count == 1) return true;
         return false;
killedBy: NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_ReaddirAsync_Offset_Returns_LessOrEqual_Data; NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_ReaddirAsync_Returns_Valid_Count; NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_ReaddirAsync_Count_Limit_Is_Respected

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:74:13
     private bool IsDirectory(List<string> path)
     {
         if (path.Count == 0) return true;
-        if (path[0] == "vault" && path.Count == 1) return true;
+        if (path[0] != "vault" && path.Count == 1) return true;
         return false;
     }
killedBy: NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_ReaddirAsync_Returns_Valid_Count; NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_Walk_ToFile_ReturnsFileQid; NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_ReaddirAsync_VaultDirectory_HasDirectoryQid

[Killed] Logical mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:74:13
     private bool IsDirectory(List<string> path)
     {
         if (path.Count == 0) return true;
-        if (path[0] == "vault" && path.Count == 1) return true;
+        if (path[0] == "vault" || path.Count == 1) return true;
         return false;
     }
killedBy: NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_Walk_ToFile_ReturnsFileQid; NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Boolean mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:75:16
     {
         if (path.Count == 0) return true;
         if (path[0] == "vault" && path.Count == 1) return true;
-        return false;
+        return true;
     }
 
killedBy: NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_Walk_ToFile_ReturnsFileQid; NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_Stat_File_HasFileMode; NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_ReaddirAsync_Fails_If_Not_Directory

[Killed] Conditional (false) mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:80:20
 
     private Qid GetQid(List<string> path)
     {
-        var type = IsDirectory(path) ? QidType.QTDIR : QidType.QTFILE;
+        var type = (false?QidType.QTDIR :QidType.QTFILE);
         var pathStr = string.Join("/", path);
         // Use stackalloc for string bytes to avoid heap allocation for small paths
killedBy: NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_Walk_ToVault_ReturnsDirQid

[Killed] Conditional (true) mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:80:20
 
     private Qid GetQid(List<string> path)
     {
-        var type = IsDirectory(path) ? QidType.QTDIR : QidType.QTFILE;
+        var type = (true?QidType.QTDIR :QidType.QTFILE);
         var pathStr = string.Join("/", path);
         // Use stackalloc for string bytes to avoid heap allocation for small paths
killedBy: NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_Walk_ToFile_ReturnsFileQid

[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:95:13
 
     public async Task<Rread> ReadAsync(Tread tread)
     {
-        if (IsDirectory(_currentPath))
+        if (!(IsDirectory(_currentPath)))
         {
             var entries = new List<byte>();
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.GetFileSystem_Returns_PathIsolated_Clone_Per_Connection; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:102:17
 
             if (_currentPath.Count == 0)
             {
-                files.Add(("provision", QidType.QTFILE));
+                ;
                 files.Add(("unlock", QidType.QTFILE));
                 files.Add(("vault", QidType.QTDIR));
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.GetFileSystem_Returns_PathIsolated_Clone_Per_Connection

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:103:17
             if (_currentPath.Count == 0)
             {
                 files.Add(("provision", QidType.QTFILE));
-                files.Add(("unlock", QidType.QTFILE));
+                ;
                 files.Add(("vault", QidType.QTDIR));
             }
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.GetFileSystem_Returns_PathIsolated_Clone_Per_Connection

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:104:17
             {
                 files.Add(("provision", QidType.QTFILE));
                 files.Add(("unlock", QidType.QTFILE));
-                files.Add(("vault", QidType.QTDIR));
+                ;
             }
             else if (_currentPath[0] == "vault")
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.GetFileSystem_Returns_PathIsolated_Clone_Per_Connection

[Survived] Equality mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:106:22
                 files.Add(("unlock", QidType.QTFILE));
                 files.Add(("vault", QidType.QTDIR));
             }
-            else if (_currentPath[0] == "vault")
+            else if (_currentPath[0] != "vault")
             {
                 foreach (var s in _sessionPasswords.Keys) files.Add((s, QidType.QTFILE));

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:108:59
             }
             else if (_currentPath[0] == "vault")
             {
-                foreach (var s in _sessionPasswords.Keys) files.Add((s, QidType.QTFILE));
+                foreach (var s in _sessionPasswords.Keys) ;
             }
 

[Survived] Conditional (false) mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:114:28
             foreach (var f in files)
             {
                 var qid = new Qid(f.Type, 0, (ulong)f.Name.GetHashCode());
-                var mode = f.Type == QidType.QTDIR ? (uint)NinePConstants.FileMode9P.DMDIR | 0755 : 0600;
+                var mode = (false?(uint)NinePConstants.FileMode9P.DMDIR | 0755 :0600);
                 var stat = new Stat(0, 0, 0, qid, mode, 0, 0, 0, f.Name, "scott", "scott", "scott", dotu: DotU);
                 

[Survived] Equality mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:114:28
             foreach (var f in files)
             {
                 var qid = new Qid(f.Type, 0, (ulong)f.Name.GetHashCode());
-                var mode = f.Type == QidType.QTDIR ? (uint)NinePConstants.FileMode9P.DMDIR | 0755 : 0600;
+                var mode = f.Type != QidType.QTDIR ? (uint)NinePConstants.FileMode9P.DMDIR | 0755 : 0600;
                 var stat = new Stat(0, 0, 0, qid, mode, 0, 0, 0, f.Name, "scott", "scott", "scott", dotu: DotU);
                 

[Killed] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:117:44
                 var mode = f.Type == QidType.QTDIR ? (uint)NinePConstants.FileMode9P.DMDIR | 0755 : 0600;
                 var stat = new Stat(0, 0, 0, qid, mode, 0, 0, 0, f.Name, "scott", "scott", "scott", dotu: DotU);
                 
-                var entryBuffer = new byte[stat.Size + 2];
+                var entryBuffer = new byte[stat.Size - 2];
                 int offset = 0;
                 stat.WriteTo(entryBuffer, ref offset);
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.GetFileSystem_Returns_PathIsolated_Clone_Per_Connection

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:119:17
                 
                 var entryBuffer = new byte[stat.Size + 2];
                 int offset = 0;
-                stat.WriteTo(entryBuffer, ref offset);
+                ;
                 entries.AddRange(entryBuffer.Take(offset));
             }
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.GetFileSystem_Returns_PathIsolated_Clone_Per_Connection

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:120:17
                 var entryBuffer = new byte[stat.Size + 2];
                 int offset = 0;
                 stat.WriteTo(entryBuffer, ref offset);
-                entries.AddRange(entryBuffer.Take(offset));
+                ;
             }
 
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.GetFileSystem_Returns_PathIsolated_Clone_Per_Connection

[Killed] Linq method mutation (Take() to Skip())
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:120:34
                 var entryBuffer = new byte[stat.Size + 2];
                 int offset = 0;
                 stat.WriteTo(entryBuffer, ref offset);
-                entries.AddRange(entryBuffer.Take(offset));
+                entries.AddRange(entryBuffer.Skip(offset));
             }
 
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.GetFileSystem_Returns_PathIsolated_Clone_Per_Connection

[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:124:17
             }
 
             var allData = entries.ToArray();
-            if (tread.Offset >= (ulong)allData.Length) return new Rread(tread.Tag, Array.Empty<byte>());
+            if (!(tread.Offset >= (ulong)allData.Length)) return new Rread(tread.Tag, Array.Empty<byte>());
             var chunk = allData.AsSpan((int)tread.Offset, (int)Math.Min((long)tread.Count, (long)allData.Length - (long)tread.Offset)).ToArray();
             return new Rread(tread.Tag, chunk);
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.GetFileSystem_Returns_PathIsolated_Clone_Per_Connection

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:124:17
             }
 
             var allData = entries.ToArray();
-            if (tread.Offset >= (ulong)allData.Length) return new Rread(tread.Tag, Array.Empty<byte>());
+            if (tread.Offset < (ulong)allData.Length) return new Rread(tread.Tag, Array.Empty<byte>());
             var chunk = allData.AsSpan((int)tread.Offset, (int)Math.Min((long)tread.Count, (long)allData.Length - (long)tread.Offset)).ToArray();
             return new Rread(tread.Tag, chunk);
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.GetFileSystem_Returns_PathIsolated_Clone_Per_Connection

[Killed] Linq method mutation (Min() to Max())
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:125:64
 
             var allData = entries.ToArray();
             if (tread.Offset >= (ulong)allData.Length) return new Rread(tread.Tag, Array.Empty<byte>());
-            var chunk = allData.AsSpan((int)tread.Offset, (int)Math.Min((long)tread.Count, (long)allData.Length - (long)tread.Offset)).ToArray();
+            var chunk = allData.AsSpan((int)tread.Offset, (int)Math.Max((long)tread.Count, (long)allData.Length - (long)tread.Offset)).ToArray();
             return new Rread(tread.Tag, chunk);
         }
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.GetFileSystem_Returns_PathIsolated_Clone_Per_Connection

[Survived] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:125:92
 
             var allData = entries.ToArray();
             if (tread.Offset >= (ulong)allData.Length) return new Rread(tread.Tag, Array.Empty<byte>());
-            var chunk = allData.AsSpan((int)tread.Offset, (int)Math.Min((long)tread.Count, (long)allData.Length - (long)tread.Offset)).ToArray();
+            var chunk = allData.AsSpan((int)tread.Offset, (int)Math.Min((long)tread.Count, (long)allData.Length + (long)tread.Offset)).ToArray();
             return new Rread(tread.Tag, chunk);
         }

[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:129:13
             return new Rread(tread.Tag, chunk);
         }
 
-        if (_currentPath.Count == 2 && _currentPath[0] == "vault")
+        if (!(_currentPath.Count == 2 && _currentPath[0] == "vault"))
         {
             var secretName = _currentPath[1];
killedBy: NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_Read_ZeroOffset_ReturnsData; NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_Read_OffsetBeyondData_ReturnsEmpty; NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_Read_NonSecretFile_ReturnsData

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:129:40
             return new Rread(tread.Tag, chunk);
         }
 
-        if (_currentPath.Count == 2 && _currentPath[0] == "vault")
+        if (_currentPath.Count == 2 && _currentPath[0] != "vault")
         {
             var secretName = _currentPath[1];
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:134:17
             var secretName = _currentPath[1];
             byte[]? secretBytes = null;
 
-            if (_sessionPasswords.TryGetValue(secretName, out var protectedPassword))
+            if (!(_sessionPasswords.TryGetValue(secretName, out var protectedPassword)))
             {
                 protectedPassword.Use(passwordBytes => {
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:136:17
 
             if (_sessionPasswords.TryGetValue(secretName, out var protectedPassword))
             {
-                protectedPassword.Use(passwordBytes => {
-                    using var secret = LuxVault.LoadSecret(secretName, passwordBytes);
-                    if (secret != null)
-                    {
-                        secretBytes = secret.Span.ToArray();
-                    }
-                });
+                ;
             }
 
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:138:25
             {
                 protectedPassword.Use(passwordBytes => {
                     using var secret = LuxVault.LoadSecret(secretName, passwordBytes);
-                    if (secret != null)
+                    if (secret == null)
                     {
                         secretBytes = secret.Span.ToArray();
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Block removal mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:139:21
                 protectedPassword.Use(passwordBytes => {
                     using var secret = LuxVault.LoadSecret(secretName, passwordBytes);
                     if (secret != null)
-                    {
-                        secretBytes = secret.Span.ToArray();
-                    }
+                    {}
                 });
             }
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:145:17
                 });
             }
 
-            if (secretBytes == null) return new Rread(tread.Tag, Array.Empty<byte>());
+            if (secretBytes != null) return new Rread(tread.Tag, Array.Empty<byte>());
 
             try
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:149:21
 
             try
             {
-                if (tread.Offset >= (ulong)secretBytes.Length) return new Rread(tread.Tag, Array.Empty<byte>());
+                if (!(tread.Offset >= (ulong)secretBytes.Length)) return new Rread(tread.Tag, Array.Empty<byte>());
                 var chunk = secretBytes.AsSpan((int)tread.Offset, (int)Math.Min((long)tread.Count, (long)secretBytes.Length - (long)tread.Offset)).ToArray();
                 return new Rread(tread.Tag, chunk);
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:149:21
 
             try
             {
-                if (tread.Offset >= (ulong)secretBytes.Length) return new Rread(tread.Tag, Array.Empty<byte>());
+                if (tread.Offset < (ulong)secretBytes.Length) return new Rread(tread.Tag, Array.Empty<byte>());
                 var chunk = secretBytes.AsSpan((int)tread.Offset, (int)Math.Min((long)tread.Count, (long)secretBytes.Length - (long)tread.Offset)).ToArray();
                 return new Rread(tread.Tag, chunk);
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Linq method mutation (Min() to Max())
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:150:72
             try
             {
                 if (tread.Offset >= (ulong)secretBytes.Length) return new Rread(tread.Tag, Array.Empty<byte>());
-                var chunk = secretBytes.AsSpan((int)tread.Offset, (int)Math.Min((long)tread.Count, (long)secretBytes.Length - (long)tread.Offset)).ToArray();
+                var chunk = secretBytes.AsSpan((int)tread.Offset, (int)Math.Max((long)tread.Count, (long)secretBytes.Length - (long)tread.Offset)).ToArray();
                 return new Rread(tread.Tag, chunk);
             }
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Survived] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:150:100
             try
             {
                 if (tread.Offset >= (ulong)secretBytes.Length) return new Rread(tread.Tag, Array.Empty<byte>());
-                var chunk = secretBytes.AsSpan((int)tread.Offset, (int)Math.Min((long)tread.Count, (long)secretBytes.Length - (long)tread.Offset)).ToArray();
+                var chunk = secretBytes.AsSpan((int)tread.Offset, (int)Math.Min((long)tread.Count, (long)secretBytes.Length + (long)tread.Offset)).ToArray();
                 return new Rread(tread.Tag, chunk);
             }

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:155:17
             }
             finally
             {
-                Array.Clear(secretBytes);
+                ;
             }
         }

[Survived] Boolean mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:165:90
     public async Task<Rwrite> WriteAsync(Twrite twrite)
     {
         var bytes = twrite.Data.Span;
-        char[] chars = GC.AllocateArray<char>(Encoding.UTF8.GetCharCount(bytes), pinned: true);
+        char[] chars = GC.AllocateArray<char>(Encoding.UTF8.GetCharCount(bytes), pinned: false);
         try {
             Encoding.UTF8.GetChars(bytes, chars);

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:167:13
         var bytes = twrite.Data.Span;
         char[] chars = GC.AllocateArray<char>(Encoding.UTF8.GetCharCount(bytes), pinned: true);
         try {
-            Encoding.UTF8.GetChars(bytes, chars);
+            ;
             string input = new string(chars).Trim();
 
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] String Method Mutation (Replace Trim() with Empty String)
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:174:62
             {
                 case (1, "provision"):
                 {
-                    var parts = input.Split(':').Select(p => p.Trim()).ToArray();
+                    var parts = input.Split(':').Select(p => "").ToArray();
                     if (parts.Length == 3)
                     {
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.GetFileSystem_Returns_PathIsolated_Clone_Per_Connection; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:175:25
                 case (1, "provision"):
                 {
                     var parts = input.Split(':').Select(p => p.Trim()).ToArray();
-                    if (parts.Length == 3)
+                    if (parts.Length != 3)
                     {
                         using var password = new SecureString();
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:178:54
                     if (parts.Length == 3)
                     {
                         using var password = new SecureString();
-                        foreach (char c in parts[0]) password.AppendChar(c);
+                        foreach (char c in parts[0]) ;
                         password.MakeReadOnly();
                         
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:179:25
                     {
                         using var password = new SecureString();
                         foreach (char c in parts[0]) password.AppendChar(c);
-                        password.MakeReadOnly();
+                        ;
                         
                         var name = parts[1];

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:186:29
 
                         try
                         {
-                            _vault.StoreSecret(name, payload, password);
+                            ;
                             _logger.LogInformation("[Secret FS] Provisioned '{Name}' to physical vault.", name);
                         }
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:187:29
                         try
                         {
                             _vault.StoreSecret(name, payload, password);
-                            _logger.LogInformation("[Secret FS] Provisioned '{Name}' to physical vault.", name);
+                            ;
                         }
                         finally

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:191:29
                         }
                         finally
                         {
-                            Array.Clear(payload);
+                            ;
                         }
                     }

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:200:25
                 case (1, "unlock"):
                 {
                     var parts = input.Split(':').Select(p => p.Trim()).ToArray();
-                    if (parts.Length == 2)
+                    if (parts.Length != 2)
                     {
                         var name = parts[1];
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:208:29
                         password.MakeReadOnly();
 
                         using var decrypted = _vault.LoadSecret(name, password);
-                        if (decrypted != null)
+                        if (decrypted == null)
                         {
                             var next = new ProtectedSecret(password);
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:211:29
                         if (decrypted != null)
                         {
                             var next = new ProtectedSecret(password);
-                            _sessionPasswords.AddOrUpdate(
-                                name,
-                                _ => next,
-                                (_, existing) => {
-                                    existing.Dispose();
-                                    return next;
-                                });
+                            ;
                             _logger.LogInformation("[Secret FS] Unlocked '{Name}'. Password stored in session.", name);
                         }
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:215:37
                                 name,
                                 _ => next,
                                 (_, existing) => {
-                                    existing.Dispose();
+                                    ;
                                     return next;
                                 });
