[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:218:29
                                     existing.Dispose();
                                     return next;
                                 });
-                            _logger.LogInformation("[Secret FS] Unlocked '{Name}'. Password stored in session.", name);
+                            ;
                         }
                         else

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:222:29
                         }
                         else
                         {
-                            _logger.LogWarning("[Secret FS] Failed to unlock '{Name}' - incorrect password or missing file.", name);
+                            ;
                         }
                     }

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:230:13
             }
         }
         finally {
-            Array.Clear(chars);
+            ;
         }
 

[Killed] Conditional (true) mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:240:20
 
     public async Task<Rstat> StatAsync(Tstat tstat)
     {
-        var name = _currentPath.Count > 0 ? _currentPath.Last() : "secrets";
+        var name = (true?_currentPath.Last() :"secrets");
         var isDir = IsDirectory(_currentPath);
killedBy: NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_Stat_Root_ReturnsCorrectNames

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:240:20
 
     public async Task<Rstat> StatAsync(Tstat tstat)
     {
-        var name = _currentPath.Count > 0 ? _currentPath.Last() : "secrets";
+        var name = _currentPath.Count >= 0 ? _currentPath.Last() : "secrets";
         var isDir = IsDirectory(_currentPath);
killedBy: NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_Stat_Root_ReturnsCorrectNames

[NoCoverage] Logical mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:249:13
     public Task<Rwstat> WstatAsync(Twstat twstat) => throw new NinePNotSupportedException();
     public async Task<Rremove> RemoveAsync(Tremove tremove)
     {
-        if (_currentPath.Count == 2 && _currentPath[0] == "vault")
+        if (_currentPath.Count == 2 || _currentPath[0] == "vault")
         {
             var secretName = _currentPath[1];

[NoCoverage] Negate expression
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:249:13
     public Task<Rwstat> WstatAsync(Twstat twstat) => throw new NinePNotSupportedException();
     public async Task<Rremove> RemoveAsync(Tremove tremove)
     {
-        if (_currentPath.Count == 2 && _currentPath[0] == "vault")
+        if (!(_currentPath.Count == 2 && _currentPath[0] == "vault"))
         {
             var secretName = _currentPath[1];

[NoCoverage] Negate expression
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:252:17
         if (_currentPath.Count == 2 && _currentPath[0] == "vault")
         {
             var secretName = _currentPath[1];
-            if (_sessionPasswords.TryRemove(secretName, out var protectedSecret))
+            if (!(_sessionPasswords.TryRemove(secretName, out var protectedSecret)))
             {
                 protectedSecret.Dispose();

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:254:17
             var secretName = _currentPath[1];
             if (_sessionPasswords.TryRemove(secretName, out var protectedSecret))
             {
-                protectedSecret.Dispose();
+                ;
                 return new Rremove(tremove.Tag);
             }

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:258:9
                 return new Rremove(tremove.Tag);
             }
         }
-        throw new NinePNotSupportedException("Only session passwords in vault/ can be removed.");
+        ;
     }
 

[Survived] Conditional (true) mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:265:21
     {
         var isDir = IsDirectory(_currentPath);
         var qid = GetQid(_currentPath);
-        uint mode = isDir ? (uint)NinePConstants.FileMode9P.DMDIR | 0755 : 0600;
+        uint mode = (true?(uint)NinePConstants.FileMode9P.DMDIR | 0755 :0600);
         ulong now = (ulong)DateTimeOffset.UtcNow.ToUnixTimeSeconds();

[Survived] Bitwise mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:265:29
     {
         var isDir = IsDirectory(_currentPath);
         var qid = GetQid(_currentPath);
-        uint mode = isDir ? (uint)NinePConstants.FileMode9P.DMDIR | 0755 : 0600;
+        uint mode = isDir ? (uint)NinePConstants.FileMode9P.DMDIR & 0755 : 0600;
         ulong now = (ulong)DateTimeOffset.UtcNow.ToUnixTimeSeconds();

[Killed] Logical mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:277:13
         // Calculate number of files in the virtual filesystem
         ulong fileCount = 3; // root has: provision, unlock, vault
 
-        if (_currentPath.Count >= 1 && _currentPath[0] == "vault")
+        if (_currentPath.Count >= 1 || _currentPath[0] == "vault")
         {
             fileCount = (ulong)_sessionPasswords.Count;
killedBy: NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_StatfsAsync_FsType_Is_Constant; NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_Multiple_Clones_Are_Independent; NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_Property_Tests_Can_Run_Synchronously

[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:277:13
         // Calculate number of files in the virtual filesystem
         ulong fileCount = 3; // root has: provision, unlock, vault
 
-        if (_currentPath.Count >= 1 && _currentPath[0] == "vault")
+        if (!(_currentPath.Count >= 1 && _currentPath[0] == "vault"))
         {
             fileCount = (ulong)_sessionPasswords.Count;
killedBy: NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_Multiple_Clones_Are_Independent; NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_Property_Tests_Can_Run_Synchronously; NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_StatfsAsync_At_Root_Has_Fixed_File_Count

[Survived] Block removal mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:278:9
         ulong fileCount = 3; // root has: provision, unlock, vault
 
         if (_currentPath.Count >= 1 && _currentPath[0] == "vault")
-        {
-            fileCount = (ulong)_sessionPasswords.Count;
-        }
+        {}
 
         var totalFiles = fileCount + 1; // +1 for the directory itself

[Killed] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:282:26
             fileCount = (ulong)_sessionPasswords.Count;
         }
 
-        var totalFiles = fileCount + 1; // +1 for the directory itself
+        var totalFiles = fileCount - 1; // +1 for the directory itself
         var statfs = new Rstatfs(
             tag: tstatfs.Tag,
killedBy: NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_Multiple_Clones_Are_Independent; NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_Property_Tests_Can_Run_Synchronously; NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_StatfsAsync_At_Root_Has_Fixed_File_Count

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:300:13
 
     public Task<Rreaddir> ReaddirAsync(Treaddir treaddir)
     {
-        if (!IsDirectory(_currentPath))
+        if (IsDirectory(_currentPath))
         {
             throw new NinePProtocolException("Not a directory");
killedBy: NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_ReaddirAsync_Offset_Returns_LessOrEqual_Data; NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_ReaddirAsync_Returns_Valid_Count; NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_ReaddirAsync_Count_Limit_Is_Respected

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:319:17
         {
             foreach (var s in _sessionPasswords.Keys)
             {
-                files.Add((s, QidType.QTFILE));
+                ;
             }
         }

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:328:17
         foreach (var (index, f) in files.Select((f, i) => (i, f)))
         {
             ulong entrySize;
-            if (offset < treaddir.Offset)
+            if (offset <= treaddir.Offset)
             {
                 // Skip entries before the requested offset
killedBy: NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_Clone_Creates_Independent_Instance; NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_ReaddirAsync_Root_Lists_Expected_Entries; NinePSharp.Tests.CrossBackendIntegrationTests.MockFileSystem_And_SecretFileSystem_Have_Independent_Readdir

[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:328:17
         foreach (var (index, f) in files.Select((f, i) => (i, f)))
         {
             ulong entrySize;
-            if (offset < treaddir.Offset)
+            if (!(offset < treaddir.Offset))
             {
                 // Skip entries before the requested offset
killedBy: NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_ReaddirAsync_Offset_Returns_LessOrEqual_Data; NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_ReaddirAsync_Returns_Empty_For_Large_Offset; NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_Clone_Creates_Independent_Instance

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:333:17
                 // Skip entries before the requested offset
                 var qidTemp = new Qid(f.Type, 0, (ulong)f.Name.GetHashCode());
                 entrySize = 13 + 8 + 1 + 2 + (ulong)Encoding.UTF8.GetByteCount(f.Name);
-                offset += entrySize;
+                offset -= entrySize;
                 continue;
             }
killedBy: NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_ReaddirAsync_Returns_Empty_For_Large_Offset

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:334:17
                 var qidTemp = new Qid(f.Type, 0, (ulong)f.Name.GetHashCode());
                 entrySize = 13 + 8 + 1 + 2 + (ulong)Encoding.UTF8.GetByteCount(f.Name);
                 offset += entrySize;
-                continue;
+                ;
             }
 
killedBy: NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_ReaddirAsync_Returns_Empty_For_Large_Offset

[Survived] Conditional (true) mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:338:24
             }
 
             var qid = new Qid(f.Type, 0, (ulong)f.Name.GetHashCode());
-            var type = f.Type == QidType.QTDIR ? (byte)0x80 : (byte)0;
+            var type = (true?(byte)0x80 :(byte)0);
 
             // Calculate entry size

[Survived] Equality mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:338:24
             }
 
             var qid = new Qid(f.Type, 0, (ulong)f.Name.GetHashCode());
-            var type = f.Type == QidType.QTDIR ? (byte)0x80 : (byte)0;
+            var type = f.Type != QidType.QTDIR ? (byte)0x80 : (byte)0;
 
             // Calculate entry size

[Killed] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:342:33
 
             // Calculate entry size
             var nameBytes = Encoding.UTF8.GetBytes(f.Name);
-            entrySize = (ulong)(13 + 8 + 1 + 2 + nameBytes.Length);
+            entrySize = (ulong)(13 + 8 + 1 + 2 - nameBytes.Length);
 
             // Check if this entry would exceed the count limit
killedBy: NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_ReaddirAsync_Count_Limit_Is_Respected

[Killed] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:342:33
 
             // Calculate entry size
             var nameBytes = Encoding.UTF8.GetBytes(f.Name);
-            entrySize = (ulong)(13 + 8 + 1 + 2 + nameBytes.Length);
+            entrySize = (ulong)(13 + 8 - 1 + 2 + nameBytes.Length);
 
             // Check if this entry would exceed the count limit
killedBy: NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_ReaddirAsync_Count_Limit_Is_Respected

[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:345:17
             entrySize = (ulong)(13 + 8 + 1 + 2 + nameBytes.Length);
 
             // Check if this entry would exceed the count limit
-            if ((ulong)entries.Count + entrySize > (ulong)treaddir.Count)
+            if (!((ulong)entries.Count + entrySize > (ulong)treaddir.Count))
             {
                 break;
killedBy: NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_ReaddirAsync_Count_Limit_Is_Respected; NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_Clone_Creates_Independent_Instance; NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_ReaddirAsync_Root_Lists_Expected_Entries

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:345:17
             entrySize = (ulong)(13 + 8 + 1 + 2 + nameBytes.Length);
 
             // Check if this entry would exceed the count limit
-            if ((ulong)entries.Count + entrySize > (ulong)treaddir.Count)
+            if ((ulong)entries.Count + entrySize < (ulong)treaddir.Count)
             {
                 break;
killedBy: NinePSharp.Tests.SecretFileSystemPropertyTests.SecretFileSystem_ReaddirAsync_Count_Limit_Is_Respected; NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_Clone_Creates_Independent_Instance; NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_ReaddirAsync_Root_Lists_Expected_Entries

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:353:13
             // Write qid (13 bytes)
             var qidBytes = new byte[13];
             qidBytes[0] = (byte)qid.Type;
-            BitConverter.TryWriteBytes(qidBytes.AsSpan(1, 4), qid.Version);
+            ;
             BitConverter.TryWriteBytes(qidBytes.AsSpan(5, 8), qid.Path);
             entries.AddRange(qidBytes);

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:354:13
             var qidBytes = new byte[13];
             qidBytes[0] = (byte)qid.Type;
             BitConverter.TryWriteBytes(qidBytes.AsSpan(1, 4), qid.Version);
-            BitConverter.TryWriteBytes(qidBytes.AsSpan(5, 8), qid.Path);
+            ;
             entries.AddRange(qidBytes);
 

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:355:13
             qidBytes[0] = (byte)qid.Type;
             BitConverter.TryWriteBytes(qidBytes.AsSpan(1, 4), qid.Version);
             BitConverter.TryWriteBytes(qidBytes.AsSpan(5, 8), qid.Path);
-            entries.AddRange(qidBytes);
+            ;
 
             // Write offset (8 bytes) - next entry's offset
killedBy: NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_ReaddirAsync_Returns_Valid_Qid_Types

[Survived] AddAssignmentExpression to SubtractAssignmentExpression mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:358:13
             entries.AddRange(qidBytes);
 
             // Write offset (8 bytes) - next entry's offset
-            offset += (ulong)entrySize;
+            offset -= (ulong)entrySize;
             var offsetBytes = new byte[8];
             BitConverter.TryWriteBytes(offsetBytes, offset);

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:360:13
             // Write offset (8 bytes) - next entry's offset
             offset += (ulong)entrySize;
             var offsetBytes = new byte[8];
-            BitConverter.TryWriteBytes(offsetBytes, offset);
+            ;
             entries.AddRange(offsetBytes);
 

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:361:13
             offset += (ulong)entrySize;
             var offsetBytes = new byte[8];
             BitConverter.TryWriteBytes(offsetBytes, offset);
-            entries.AddRange(offsetBytes);
+            ;
 
             // Write type (1 byte)

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:364:13
             entries.AddRange(offsetBytes);
 
             // Write type (1 byte)
-            entries.Add(type);
+            ;
 
             // Write name (2 byte length + string)

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:368:13
 
             // Write name (2 byte length + string)
             var nameLenBytes = new byte[2];
-            BitConverter.TryWriteBytes(nameLenBytes, (ushort)nameBytes.Length);
+            ;
             entries.AddRange(nameLenBytes);
             entries.AddRange(nameBytes);

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:369:13
             // Write name (2 byte length + string)
             var nameLenBytes = new byte[2];
             BitConverter.TryWriteBytes(nameLenBytes, (ushort)nameBytes.Length);
-            entries.AddRange(nameLenBytes);
+            ;
             entries.AddRange(nameBytes);
         }

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:370:13
             var nameLenBytes = new byte[2];
             BitConverter.TryWriteBytes(nameLenBytes, (ushort)nameBytes.Length);
             entries.AddRange(nameLenBytes);
-            entries.AddRange(nameBytes);
+            ;
         }
 
killedBy: NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_Clone_Creates_Independent_Instance; NinePSharp.Tests.SecretFileSystemTests.SecretFileSystem_ReaddirAsync_Root_Lists_Expected_Entries; NinePSharp.Tests.CrossBackendIntegrationTests.MockFileSystem_And_SecretFileSystem_Have_Independent_Readdir

[Survived] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:375:26
 
         var data = entries.ToArray();
         return Task.FromResult(new Rreaddir(
-            size: (uint)(NinePConstants.HeaderSize + 4 + data.Length),
+            size: (uint)(NinePConstants.HeaderSize - 4 + data.Length),
             tag: treaddir.Tag,
             count: (uint)data.Length,

[Survived] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:375:26
 
         var data = entries.ToArray();
         return Task.FromResult(new Rreaddir(
-            size: (uint)(NinePConstants.HeaderSize + 4 + data.Length),
+            size: (uint)(NinePConstants.HeaderSize + 4 - data.Length),
             tag: treaddir.Tag,
             count: (uint)data.Length,

[Killed] Block removal mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:383:5
     }
 
     public INinePFileSystem Clone()
-    {
-        var clone = new SecretFileSystem(_logger, _config, _vault);
-        clone._currentPath = new List<string>(_currentPath);
-        clone.DotU = DotU;
-        return clone;
-    }
+    {}
 }
 
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.GetFileSystem_Returns_PathIsolated_Clone_Per_Connection; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Block removal mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:406:5
     }
 
     public SecretBackend(ILuxVaultService vault, ILoggerFactory loggerFactory)
-    {
-        _vault = vault;
-        _loggerFactory = loggerFactory;
-    }
+    {}
 
     public async Task InitializeAsync(IConfiguration configuration)
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.GetFileSystem_Returns_PathIsolated_Clone_Per_Connection; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:415:13
     {
         try {
             _config = new SecretBackendConfig();
-            configuration.Bind(_config);
+            ;
             _prototypeFs = new SecretFileSystem(_loggerFactory.CreateLogger<SecretFileSystem>(), _config, _vault);
             Console.WriteLine($"[Secret Backend] Initialized with MountPath: {MountPath}");

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:417:13
             _config = new SecretBackendConfig();
             configuration.Bind(_config);
             _prototypeFs = new SecretFileSystem(_loggerFactory.CreateLogger<SecretFileSystem>(), _config, _vault);
-            Console.WriteLine($"[Secret Backend] Initialized with MountPath: {MountPath}");
+            ;
         }
         catch (Exception ex) {

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/backends/SecretBackend.cs:420:13
             Console.WriteLine($"[Secret Backend] Initialized with MountPath: {MountPath}");
         }
         catch (Exception ex) {
-            Console.WriteLine($"[Secret Backend] Failed to initialize: {ex.Message}");
+            ;
         }
     }
