[Killed] Block removal mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:25:9
         public byte[] Data { get; set; }
 
         public SrvEntry(byte[] data)
-        {
-            Data = data;
-        }
+        {}
 
         public void Dispose()
killedBy: NinePSharp.Tests.SrvBackendTests.Write_Creates_Pipe_And_Read_Retrieves_Data

[Survived] Equality mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:31:17
 
         public void Dispose()
         {
-            if (Data != null)
+            if (Data == null)
             {
                 unsafe {

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:35:25
             {
                 unsafe {
                     fixed (byte* p = Data) {
-                        MemoryLock.Unlock((IntPtr)p, (nuint)Data.Length);
+                        ;
                     }
                 }

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:38:17
                         MemoryLock.Unlock((IntPtr)p, (nuint)Data.Length);
                     }
                 }
-                Array.Clear(Data);
+                ;
             }
         }

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:50:13
 
     public async Task<Rwalk> WalkAsync(Twalk twalk)
     {
-        if (twalk.Wname.Length == 0) return new Rwalk(twalk.Tag, Array.Empty<Qid>());
+        if (twalk.Wname.Length != 0) return new Rwalk(twalk.Tag, Array.Empty<Qid>());
 
         var qids = new List<Qid>();
killedBy: NinePSharp.Tests.SrvBackendTests.Write_Creates_Pipe_And_Read_Retrieves_Data; NinePSharp.Tests.SrvBackendTests.Read_Root_Lists_Pipes; NinePSharp.Tests.SrvBackendTests.Remove_Deletes_Pipe

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:57:17
 
         foreach (var name in twalk.Wname)
         {
-            if (name == "..") { if (tempPath.Count > 0) tempPath.RemoveAt(tempPath.Count - 1); }
+            if (name != "..") { if (tempPath.Count > 0) tempPath.RemoveAt(tempPath.Count - 1); }
             else tempPath.Add(name);
             
killedBy: NinePSharp.Tests.SrvBackendTests.Write_Creates_Pipe_And_Read_Retrieves_Data; NinePSharp.Tests.SrvBackendTests.Read_Root_Lists_Pipes; NinePSharp.Tests.SrvBackendTests.Remove_Deletes_Pipe

[NoCoverage] Negate expression
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:57:37
 
         foreach (var name in twalk.Wname)
         {
-            if (name == "..") { if (tempPath.Count > 0) tempPath.RemoveAt(tempPath.Count - 1); }
+            if (name == "..") { if (!(tempPath.Count > 0)) tempPath.RemoveAt(tempPath.Count - 1); }
             else tempPath.Add(name);
             

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:58:18
         foreach (var name in twalk.Wname)
         {
             if (name == "..") { if (tempPath.Count > 0) tempPath.RemoveAt(tempPath.Count - 1); }
-            else tempPath.Add(name);
+            else ;
             
             bool isDir = tempPath.Count == 0;
killedBy: NinePSharp.Tests.SrvBackendTests.Write_Creates_Pipe_And_Read_Retrieves_Data; NinePSharp.Tests.SrvBackendTests.Read_Root_Lists_Pipes; NinePSharp.Tests.SrvBackendTests.Remove_Deletes_Pipe

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:61:13
             else tempPath.Add(name);
             
             bool isDir = tempPath.Count == 0;
-            qids.Add(new Qid(isDir ? QidType.QTDIR : QidType.QTFILE, 0, (ulong)string.Join("/", tempPath).GetHashCode()));
+            ;
         }
 
killedBy: NinePSharp.Tests.SrvBackendTests.Write_Creates_Pipe_And_Read_Retrieves_Data; NinePSharp.Tests.SrvBackendTests.Read_Root_Lists_Pipes; NinePSharp.Tests.SrvBackendTests.Remove_Deletes_Pipe

[Survived] Conditional (true) mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:61:30
             else tempPath.Add(name);
             
             bool isDir = tempPath.Count == 0;
-            qids.Add(new Qid(isDir ? QidType.QTDIR : QidType.QTFILE, 0, (ulong)string.Join("/", tempPath).GetHashCode()));
+            qids.Add(new Qid((true?QidType.QTDIR :QidType.QTFILE), 0, (ulong)string.Join("/", tempPath).GetHashCode()));
         }
 

[NoCoverage] Conditional (false) mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:70:20
 
     public Task<Ropen> OpenAsync(Topen topen)
     {
-        var type = _currentPath.Count == 0 ? QidType.QTDIR : QidType.QTFILE;
+        var type = (false?QidType.QTDIR :QidType.QTFILE);
         return Task.FromResult(new Ropen(topen.Tag, new Qid(type, 0, 0), 0));
     }

[NoCoverage] Conditional (true) mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:70:20
 
     public Task<Ropen> OpenAsync(Topen topen)
     {
-        var type = _currentPath.Count == 0 ? QidType.QTDIR : QidType.QTFILE;
+        var type = (true?QidType.QTDIR :QidType.QTFILE);
         return Task.FromResult(new Ropen(topen.Tag, new Qid(type, 0, 0), 0));
     }

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:89:17
                 var entryBuffer = new byte[stat.Size];
                 int offset = 0;
                 stat.WriteTo(entryBuffer, ref offset);
-                entries.AddRange(entryBuffer);
+                ;
             }
             allData = entries.ToArray();
killedBy: NinePSharp.Tests.SrvBackendTests.Read_Root_Lists_Pipes

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:95:20
 
             int totalToSend = 0;
             int currentOffset = (int)tread.Offset;
-            while (currentOffset + 2 <= allData.Length)
+            while (currentOffset + 2 > allData.Length)
             {
                 ushort entrySize = (ushort)(System.Buffers.Binary.BinaryPrimitives.ReadUInt16LittleEndian(allData.AsSpan(currentOffset, 2)) + 2);
killedBy: NinePSharp.Tests.SrvBackendTests.Read_Root_Lists_Pipes

[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:95:20
 
             int totalToSend = 0;
             int currentOffset = (int)tread.Offset;
-            while (currentOffset + 2 <= allData.Length)
+            while (!(currentOffset + 2 <= allData.Length))
             {
                 ushort entrySize = (ushort)(System.Buffers.Binary.BinaryPrimitives.ReadUInt16LittleEndian(allData.AsSpan(currentOffset, 2)) + 2);
killedBy: NinePSharp.Tests.SrvBackendTests.Read_Root_Lists_Pipes

[Survived] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:97:45
             int currentOffset = (int)tread.Offset;
             while (currentOffset + 2 <= allData.Length)
             {
-                ushort entrySize = (ushort)(System.Buffers.Binary.BinaryPrimitives.ReadUInt16LittleEndian(allData.AsSpan(currentOffset, 2)) + 2);
+                ushort entrySize = (ushort)(System.Buffers.Binary.BinaryPrimitives.ReadUInt16LittleEndian(allData.AsSpan(currentOffset, 2)) - 2);
                 if (totalToSend + entrySize > tread.Count) break;
                 totalToSend += entrySize;

[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:98:21
             while (currentOffset + 2 <= allData.Length)
             {
                 ushort entrySize = (ushort)(System.Buffers.Binary.BinaryPrimitives.ReadUInt16LittleEndian(allData.AsSpan(currentOffset, 2)) + 2);
-                if (totalToSend + entrySize > tread.Count) break;
+                if (!(totalToSend + entrySize > tread.Count)) break;
                 totalToSend += entrySize;
                 currentOffset += entrySize;
killedBy: NinePSharp.Tests.SrvBackendTests.Read_Root_Lists_Pipes

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:98:21
             while (currentOffset + 2 <= allData.Length)
             {
                 ushort entrySize = (ushort)(System.Buffers.Binary.BinaryPrimitives.ReadUInt16LittleEndian(allData.AsSpan(currentOffset, 2)) + 2);
-                if (totalToSend + entrySize > tread.Count) break;
+                if (totalToSend + entrySize < tread.Count) break;
                 totalToSend += entrySize;
                 currentOffset += entrySize;
killedBy: NinePSharp.Tests.SrvBackendTests.Read_Root_Lists_Pipes

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:99:17
             {
                 ushort entrySize = (ushort)(System.Buffers.Binary.BinaryPrimitives.ReadUInt16LittleEndian(allData.AsSpan(currentOffset, 2)) + 2);
                 if (totalToSend + entrySize > tread.Count) break;
-                totalToSend += entrySize;
+                totalToSend -= entrySize;
                 currentOffset += entrySize;
             }
killedBy: NinePSharp.Tests.SrvBackendTests.Read_Root_Lists_Pipes; NinePSharp.Tests.SrvBackendTests.Remove_Deletes_Pipe

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:100:17
                 ushort entrySize = (ushort)(System.Buffers.Binary.BinaryPrimitives.ReadUInt16LittleEndian(allData.AsSpan(currentOffset, 2)) + 2);
                 if (totalToSend + entrySize > tread.Count) break;
                 totalToSend += entrySize;
-                currentOffset += entrySize;
+                currentOffset -= entrySize;
             }
             
killedBy: NinePSharp.Tests.SrvBackendTests.Read_Root_Lists_Pipes; NinePSharp.Tests.SrvBackendTests.Remove_Deletes_Pipe

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:103:17
                 currentOffset += entrySize;
             }
             
-            if (totalToSend == 0) return Task.FromResult(new Rread(tread.Tag, Array.Empty<byte>()));
+            if (totalToSend != 0) return Task.FromResult(new Rread(tread.Tag, Array.Empty<byte>()));
             return Task.FromResult(new Rread(tread.Tag, allData.AsMemory((int)tread.Offset, totalToSend).ToArray()));
         }
killedBy: NinePSharp.Tests.SrvBackendTests.Read_Root_Lists_Pipes

[Killed] Negate expression
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:109:17
         else
         {
             var name = _currentPath[0];
-            if (_pipes.TryGetValue(name, out var entry))
+            if (!(_pipes.TryGetValue(name, out var entry)))
             {
                 allData = entry.Data;
killedBy: NinePSharp.Tests.SrvBackendTests.Write_Creates_Pipe_And_Read_Retrieves_Data

[Killed] Linq method mutation (Min() to Max())
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:120:60
         }
 
         if (tread.Offset >= (ulong)allData.Length) return Task.FromResult(new Rread(tread.Tag, Array.Empty<byte>()));
-        var chunk = allData.AsSpan((int)tread.Offset, (int)Math.Min((long)tread.Count, (long)allData.Length - (long)tread.Offset)).ToArray();
+        var chunk = allData.AsSpan((int)tread.Offset, (int)Math.Max((long)tread.Count, (long)allData.Length - (long)tread.Offset)).ToArray();
         return Task.FromResult(new Rread(tread.Tag, chunk));
     }
killedBy: NinePSharp.Tests.SrvBackendTests.Write_Creates_Pipe_And_Read_Retrieves_Data

[Survived] Arithmetic mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:120:88
         }
 
         if (tread.Offset >= (ulong)allData.Length) return Task.FromResult(new Rread(tread.Tag, Array.Empty<byte>()));
-        var chunk = allData.AsSpan((int)tread.Offset, (int)Math.Min((long)tread.Count, (long)allData.Length - (long)tread.Offset)).ToArray();
+        var chunk = allData.AsSpan((int)tread.Offset, (int)Math.Min((long)tread.Count, (long)allData.Length + (long)tread.Offset)).ToArray();
         return Task.FromResult(new Rread(tread.Tag, chunk));
     }

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:126:38
 
     public Task<Rwrite> WriteAsync(Twrite twrite)
     {
-        if (_currentPath.Count == 0) throw new NinePProtocolException("Cannot write to srv root.");
+        if (_currentPath.Count == 0) ;
 
         var name = _currentPath[0];

[Survived] Boolean mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:131:73
         var name = _currentPath[0];
         var data = twrite.Data.ToArray();
 
-        byte[] pinnedData = GC.AllocateArray<byte>(data.Length, pinned: true);
+        byte[] pinnedData = GC.AllocateArray<byte>(data.Length, pinned: false);
         data.CopyTo(pinnedData, 0);
         Array.Clear(data);

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:132:9
         var data = twrite.Data.ToArray();
 
         byte[] pinnedData = GC.AllocateArray<byte>(data.Length, pinned: true);
-        data.CopyTo(pinnedData, 0);
+        ;
         Array.Clear(data);
 
killedBy: NinePSharp.Tests.SrvBackendTests.Write_Creates_Pipe_And_Read_Retrieves_Data

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:133:9
 
         byte[] pinnedData = GC.AllocateArray<byte>(data.Length, pinned: true);
         data.CopyTo(pinnedData, 0);
-        Array.Clear(data);
+        ;
 
         unsafe {

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:137:17
 
         unsafe {
             fixed (byte* p = pinnedData) {
-                MemoryLock.Lock((IntPtr)p, (nuint)pinnedData.Length);
+                ;
             }
         }

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:142:9
         }
 
         var newEntry = new SrvEntry(pinnedData);
-        _pipes.AddOrUpdate(name, newEntry, (key, old) => {
-            old.Dispose();
-            return newEntry;
-        });
+        ;
 
         return Task.FromResult(new Rwrite(twrite.Tag, (uint)twrite.Data.Length));
killedBy: NinePSharp.Tests.SrvBackendTests.Write_Creates_Pipe_And_Read_Retrieves_Data; NinePSharp.Tests.SrvBackendTests.Read_Root_Lists_Pipes

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:143:13
 
         var newEntry = new SrvEntry(pinnedData);
         _pipes.AddOrUpdate(name, newEntry, (key, old) => {
-            old.Dispose();
+            ;
             return newEntry;
         });

[NoCoverage] Null coalescing mutation (remove left)
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:154:20
 
     public async Task<Rstat> StatAsync(Tstat tstat)
     {
-        var name = _currentPath.LastOrDefault() ?? "srv";
+        var name = "srv";
         bool isDir = _currentPath.Count == 0;

[Survived] Equality mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:164:13
     
     public Task<Rremove> RemoveAsync(Tremove tremove) 
     {
-        if (_currentPath.Count > 0 && _pipes.TryRemove(_currentPath[0], out var entry))
+        if (_currentPath.Count >= 0 && _pipes.TryRemove(_currentPath[0], out var entry))
         {
             entry.Dispose();

[Survived] Block removal mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:165:9
     public Task<Rremove> RemoveAsync(Tremove tremove) 
     {
         if (_currentPath.Count > 0 && _pipes.TryRemove(_currentPath[0], out var entry))
-        {
-            entry.Dispose();
-        }
+        {}
         return Task.FromResult(new Rremove(tremove.Tag));
     }

[NoCoverage] Conditional (false) mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:174:27
     public Task<Rgetattr> GetAttrAsync(Tgetattr tgetattr)
     {
         bool isDir = _currentPath.Count == 0;
-        var qid = new Qid(isDir ? QidType.QTDIR : QidType.QTFILE, 0, DeterministicHash.GetStableHash64(string.Join("/", _currentPath)));
+        var qid = new Qid((false?QidType.QTDIR :QidType.QTFILE), 0, DeterministicHash.GetStableHash64(string.Join("/", _currentPath)));
         uint mode = isDir ? (uint)NinePConstants.FileMode9P.DMDIR | 0755 : 0666;
         return Task.FromResult(new NinePSharp.Messages.Rgetattr(tgetattr.Tag, (ulong)NinePConstants.GetAttrMask.P9_GETATTR_BASIC, qid, mode));

[NoCoverage] Conditional (true) mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:174:27
     public Task<Rgetattr> GetAttrAsync(Tgetattr tgetattr)
     {
         bool isDir = _currentPath.Count == 0;
-        var qid = new Qid(isDir ? QidType.QTDIR : QidType.QTFILE, 0, DeterministicHash.GetStableHash64(string.Join("/", _currentPath)));
+        var qid = new Qid((true?QidType.QTDIR :QidType.QTFILE), 0, DeterministicHash.GetStableHash64(string.Join("/", _currentPath)));
         uint mode = isDir ? (uint)NinePConstants.FileMode9P.DMDIR | 0755 : 0666;
         return Task.FromResult(new NinePSharp.Messages.Rgetattr(tgetattr.Tag, (ulong)NinePConstants.GetAttrMask.P9_GETATTR_BASIC, qid, mode));

[NoCoverage] Bitwise mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:175:29
     {
         bool isDir = _currentPath.Count == 0;
         var qid = new Qid(isDir ? QidType.QTDIR : QidType.QTFILE, 0, DeterministicHash.GetStableHash64(string.Join("/", _currentPath)));
-        uint mode = isDir ? (uint)NinePConstants.FileMode9P.DMDIR | 0755 : 0666;
+        uint mode = isDir ? (uint)NinePConstants.FileMode9P.DMDIR & 0755 : 0666;
         return Task.FromResult(new NinePSharp.Messages.Rgetattr(tgetattr.Tag, (ulong)NinePConstants.GetAttrMask.P9_GETATTR_BASIC, qid, mode));
     }

[NoCoverage] Conditional (false) mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:175:21
     {
         bool isDir = _currentPath.Count == 0;
         var qid = new Qid(isDir ? QidType.QTDIR : QidType.QTFILE, 0, DeterministicHash.GetStableHash64(string.Join("/", _currentPath)));
-        uint mode = isDir ? (uint)NinePConstants.FileMode9P.DMDIR | 0755 : 0666;
+        uint mode = (false?(uint)NinePConstants.FileMode9P.DMDIR | 0755 :0666);
         return Task.FromResult(new NinePSharp.Messages.Rgetattr(tgetattr.Tag, (ulong)NinePConstants.GetAttrMask.P9_GETATTR_BASIC, qid, mode));
     }

[Survived] Block removal mutation
NinePSharp/NinePSharp.Server/backends/SrvBackend.cs:182:5
     public Task<Rsetattr> SetAttrAsync(Tsetattr tsetattr) => throw new NinePNotSupportedException();
 
     public INinePFileSystem Clone()
-    {
-        var clone = new SrvFileSystem();
-        clone._currentPath = new List<string>(_currentPath);
-        clone.DotU = DotU;
-        return clone;
-    }
+    {}
 }
 
