[Killed] Statement mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:24:9
     {
         _logger = logger;
 
-        Receive<BackendRegistration>(msg =>
-        {
-            RegisterBackend(msg.MountPath, msg.Handler, replicateToPeers: true, preserveLocalIfPresent: false);
-        });
+        ;
 
         Receive<ReplicatedBackendRegistration>(msg =>
killedBy: NinePSharp.Tests.ClusterTests.Registry_Should_Register_And_Retrieve_Backends

[Killed] Statement mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:26:13
 
         Receive<BackendRegistration>(msg =>
         {
-            RegisterBackend(msg.MountPath, msg.Handler, replicateToPeers: true, preserveLocalIfPresent: false);
+            ;
         });
 
killedBy: NinePSharp.Tests.ClusterTests.Registry_Should_Register_And_Retrieve_Backends

[Survived] Boolean mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:26:75
 
         Receive<BackendRegistration>(msg =>
         {
-            RegisterBackend(msg.MountPath, msg.Handler, replicateToPeers: true, preserveLocalIfPresent: false);
+            RegisterBackend(msg.MountPath, msg.Handler, replicateToPeers: false, preserveLocalIfPresent: false);
         });
 

[Survived] Statement mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:29:9
             RegisterBackend(msg.MountPath, msg.Handler, replicateToPeers: true, preserveLocalIfPresent: false);
         });
 
-        Receive<ReplicatedBackendRegistration>(msg =>
-        {
-            RegisterBackend(msg.MountPath, msg.Handler, replicateToPeers: false, preserveLocalIfPresent: true);
-        });
+        ;
 
         Receive<ClusterEvent.MemberUp>(up =>

[NoCoverage] Boolean mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:31:106
 
         Receive<ReplicatedBackendRegistration>(msg =>
         {
-            RegisterBackend(msg.MountPath, msg.Handler, replicateToPeers: false, preserveLocalIfPresent: true);
+            RegisterBackend(msg.MountPath, msg.Handler, replicateToPeers: false, preserveLocalIfPresent: false);
         });
 

[NoCoverage] Boolean mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:31:75
 
         Receive<ReplicatedBackendRegistration>(msg =>
         {
-            RegisterBackend(msg.MountPath, msg.Handler, replicateToPeers: false, preserveLocalIfPresent: true);
+            RegisterBackend(msg.MountPath, msg.Handler, replicateToPeers: true, preserveLocalIfPresent: true);
         });
 

[Survived] Statement mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:34:9
             RegisterBackend(msg.MountPath, msg.Handler, replicateToPeers: false, preserveLocalIfPresent: true);
         });
 
-        Receive<ClusterEvent.MemberUp>(up =>
-        {
-            _logger.LogInformation("Member is Up: {Member}", up.Member);
-            if (up.Member.Address == _cluster.SelfAddress)
-            {
-                return;
-            }
-
-            var remoteRegistry = Context.ActorSelection(new RootActorPath(up.Member.Address) / "user" / "registry");
-            foreach (var backend in _backends)
-            {
-                remoteRegistry.Tell(new ReplicatedBackendRegistration(backend.Key, backend.Value));
-            }
-        });
+        ;
         
         Receive<GetBackend>(req =>

[NoCoverage] Statement mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:36:13
 
         Receive<ClusterEvent.MemberUp>(up =>
         {
-            _logger.LogInformation("Member is Up: {Member}", up.Member);
+            ;
             if (up.Member.Address == _cluster.SelfAddress)
             {

[NoCoverage] Equality mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:37:17
         Receive<ClusterEvent.MemberUp>(up =>
         {
             _logger.LogInformation("Member is Up: {Member}", up.Member);
-            if (up.Member.Address == _cluster.SelfAddress)
+            if (up.Member.Address != _cluster.SelfAddress)
             {
                 return;

[NoCoverage] Block removal mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:38:13
         {
             _logger.LogInformation("Member is Up: {Member}", up.Member);
             if (up.Member.Address == _cluster.SelfAddress)
-            {
-                return;
-            }
+            {}
 
             var remoteRegistry = Context.ActorSelection(new RootActorPath(up.Member.Address) / "user" / "registry");

[NoCoverage] Statement mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:45:17
             var remoteRegistry = Context.ActorSelection(new RootActorPath(up.Member.Address) / "user" / "registry");
             foreach (var backend in _backends)
             {
-                remoteRegistry.Tell(new ReplicatedBackendRegistration(backend.Key, backend.Value));
+                ;
             }
         });

[Killed] Statement mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:49:9
             }
         });
         
-        Receive<GetBackend>(req =>
-        {
-            var normalizedPath = NormalizeMountPath(req.MountPath);
-            if (_backends.TryGetValue(normalizedPath, out var refActor))
-            {
-                Sender.Tell(new BackendFound(normalizedPath, refActor));
-            }
-            else
-            {
-                Sender.Tell(new BackendNotFound(normalizedPath));
-            }
-        });
+        ;
 
         Receive<GetBackends>(_ =>
killedBy: NinePSharp.Tests.ClusterTests.Registry_Should_Register_And_Retrieve_Backends

[Killed] Negate expression
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:52:17
         Receive<GetBackend>(req =>
         {
             var normalizedPath = NormalizeMountPath(req.MountPath);
-            if (_backends.TryGetValue(normalizedPath, out var refActor))
+            if (!(_backends.TryGetValue(normalizedPath, out var refActor)))
             {
                 Sender.Tell(new BackendFound(normalizedPath, refActor));
killedBy: NinePSharp.Tests.ClusterTests.Registry_Should_Register_And_Retrieve_Backends

[Timeout] Statement mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:54:17
             var normalizedPath = NormalizeMountPath(req.MountPath);
             if (_backends.TryGetValue(normalizedPath, out var refActor))
             {
-                Sender.Tell(new BackendFound(normalizedPath, refActor));
+                ;
             }
             else

[Killed] Statement mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:58:17
             }
             else
             {
-                Sender.Tell(new BackendNotFound(normalizedPath));
+                ;
             }
         });
killedBy: NinePSharp.Tests.ClusterTests.Registry_Should_Register_And_Retrieve_Backends

[Survived] Statement mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:62:9
             }
         });
 
-        Receive<GetBackends>(_ =>
-        {
-            Sender.Tell(new BackendsSnapshot(_backends.Keys.OrderBy(k => k).ToArray()));
-        });
+        ;
     }
 

[NoCoverage] Statement mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:64:13
 
         Receive<GetBackends>(_ =>
         {
-            Sender.Tell(new BackendsSnapshot(_backends.Keys.OrderBy(k => k).ToArray()));
+            ;
         });
     }

[NoCoverage] Linq method mutation (OrderBy() to OrderByDescending())
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:64:46
 
         Receive<GetBackends>(_ =>
         {
-            Sender.Tell(new BackendsSnapshot(_backends.Keys.OrderBy(k => k).ToArray()));
+            Sender.Tell(new BackendsSnapshot(_backends.Keys.OrderByDescending(k => k).ToArray()));
         });
     }

[Survived] Statement mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:70:9
 
     protected override void PreStart()
     {
-        _cluster.Subscribe(Self, ClusterEvent.InitialStateAsEvents, typeof(ClusterEvent.MemberUp), typeof(ClusterEvent.MemberRemoved));
+        ;
     }
 

[Survived] Statement mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:75:9
 
     protected override void PostStop()
     {
-        _cluster.Unsubscribe(Self);
+        ;
     }
 

[Killed] Negate expression
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:81:13
     private void RegisterBackend(string mountPath, IActorRef handler, bool replicateToPeers, bool preserveLocalIfPresent)
     {
         var normalizedPath = NormalizeMountPath(mountPath);
-        if (string.IsNullOrWhiteSpace(normalizedPath))
+        if (!(string.IsNullOrWhiteSpace(normalizedPath)))
         {
             return;
killedBy: NinePSharp.Tests.ClusterTests.Registry_Should_Register_And_Retrieve_Backends

[Killed] Negate expression
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:86:13
             return;
         }
 
-        if (preserveLocalIfPresent &&
-            _backends.TryGetValue(normalizedPath, out var existing) &&
-            IsLocalActor(existing))
+        if (!(preserveLocalIfPresent &&
+            _backends.TryGetValue(normalizedPath, out var existing) &&
+            IsLocalActor(existing)))
         {
             return;
killedBy: NinePSharp.Tests.ClusterTests.Registry_Should_Register_And_Retrieve_Backends

[Survived] Statement mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:93:9
             return;
         }
 
-        _logger.LogInformation("Registering backend '{MountPath}' from {Sender}", normalizedPath, Sender);
+        ;
         _backends = _backends.SetItem(normalizedPath, handler);
 

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:96:13
         _logger.LogInformation("Registering backend '{MountPath}' from {Sender}", normalizedPath, Sender);
         _backends = _backends.SetItem(normalizedPath, handler);
 
-        if (!replicateToPeers)
+        if (replicateToPeers)
         {
             return;

[NoCoverage] Equality mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:101:66
             return;
         }
 
-        foreach (var member in _cluster.State.Members.Where(m => m.Status == MemberStatus.Up && m.Address != _cluster.SelfAddress))
+        foreach (var member in _cluster.State.Members.Where(m => m.Status != MemberStatus.Up && m.Address != _cluster.SelfAddress))
         {
             var remoteRegistry = Context.ActorSelection(new RootActorPath(member.Address) / "user" / "registry");

[NoCoverage] Logical mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:101:66
             return;
         }
 
-        foreach (var member in _cluster.State.Members.Where(m => m.Status == MemberStatus.Up && m.Address != _cluster.SelfAddress))
+        foreach (var member in _cluster.State.Members.Where(m => m.Status == MemberStatus.Up || m.Address != _cluster.SelfAddress))
         {
             var remoteRegistry = Context.ActorSelection(new RootActorPath(member.Address) / "user" / "registry");

[NoCoverage] Statement mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:104:13
         foreach (var member in _cluster.State.Members.Where(m => m.Status == MemberStatus.Up && m.Address != _cluster.SelfAddress))
         {
             var remoteRegistry = Context.ActorSelection(new RootActorPath(member.Address) / "user" / "registry");
-            remoteRegistry.Tell(new ReplicatedBackendRegistration(normalizedPath, handler));
+            ;
         }
     }

[NoCoverage] Logical mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:110:16
 
     private bool IsLocalActor(IActorRef actorRef)
     {
-        return actorRef.Path.Address == _cluster.SelfAddress || string.IsNullOrEmpty(actorRef.Path.Address.Host);
+        return actorRef.Path.Address == _cluster.SelfAddress && string.IsNullOrEmpty(actorRef.Path.Address.Host);
     }
 

[NoCoverage] Equality mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:110:16
 
     private bool IsLocalActor(IActorRef actorRef)
     {
-        return actorRef.Path.Address == _cluster.SelfAddress || string.IsNullOrEmpty(actorRef.Path.Address.Host);
+        return actorRef.Path.Address != _cluster.SelfAddress || string.IsNullOrEmpty(actorRef.Path.Address.Host);
     }
 

[Killed] Negate expression
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:115:13
 
     private static string NormalizeMountPath(string mountPath)
     {
-        if (string.IsNullOrWhiteSpace(mountPath))
+        if (!(string.IsNullOrWhiteSpace(mountPath)))
         {
             return "/";
killedBy: NinePSharp.Tests.ClusterTests.Registry_Should_Register_And_Retrieve_Backends

[NoCoverage] Block removal mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:116:9
     private static string NormalizeMountPath(string mountPath)
     {
         if (string.IsNullOrWhiteSpace(mountPath))
-        {
-            return "/";
-        }
+        {}
 
         return mountPath.StartsWith("/") ? mountPath : "/" + mountPath;

[Killed] Conditional (false) mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:120:16
             return "/";
         }
 
-        return mountPath.StartsWith("/") ? mountPath : "/" + mountPath;
+        return (false?mountPath :"/" + mountPath);
     }
 }
killedBy: NinePSharp.Tests.ClusterTests.Registry_Should_Register_And_Retrieve_Backends

[Survived] Conditional (true) mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:120:16
             return "/";
         }
 
-        return mountPath.StartsWith("/") ? mountPath : "/" + mountPath;
+        return (true?mountPath :"/" + mountPath);
     }
 }

[Killed] Block removal mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:135:5
     public string MountPath { get; }
     public IActorRef Actor { get; }
     public BackendFound(string path, IActorRef actor)
-    {
-        MountPath = path;
-        Actor = actor;
-    }
+    {}
 }
 
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession; NinePSharp.Tests.ClusterTests.Registry_Should_Register_And_Retrieve_Backends

[Killed] Block removal mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:154:5
     public IReadOnlyList<string> MountPaths { get; }
 
     public BackendsSnapshot(IReadOnlyList<string> mountPaths)
-    {
-        MountPaths = mountPaths;
-    }
+    {}
 }
 
killedBy: NinePSharp.Tests.ClusterFederationTests.RootListing_Includes_ClusterRegisteredMounts

[NoCoverage] Block removal mutation
NinePSharp.Server/cluster/actors/BackendRegistryActor.cs:165:5
     public IActorRef Handler { get; }
 
     public ReplicatedBackendRegistration(string mountPath, IActorRef handler)
-    {
-        MountPath = mountPath;
-        Handler = handler;
-    }
+    {}
 }
 
