[Killed] Statement mutation
NinePSharp.Server/cluster/actors/BackendSupervisorActor.cs:16:9
     {
         _backend = backend;
 
-        Receive<SpawnSession>(msg =>
-        {
-            // 1. Create the FileSystem instance from the backend
-            // Note: For now we pass null credentials, or we need to pass them in the message
-            // Ideally SpawnSession DTO should contain encrypted credentials
-            var fs = _backend.GetFileSystem(null);
-            
-            // 2. Spawn a NinePSessionActor to manage this FS session
-            var sessionActor = Context.ActorOf(Props.Create(() => new NinePSessionActor(fs)));
-            
-            // 3. Return the ref
-            Sender.Tell(new SessionSpawned(sessionActor));
-        });
+        ;
     }
 }
killedBy: NinePSharp.Tests.ClusterTests.Supervisor_Should_Spawn_Session

[Killed] Statement mutation
NinePSharp.Server/cluster/actors/BackendSupervisorActor.cs:27:13
             var sessionActor = Context.ActorOf(Props.Create(() => new NinePSessionActor(fs)));
             
             // 3. Return the ref
-            Sender.Tell(new SessionSpawned(sessionActor));
+            ;
         });
     }
killedBy: NinePSharp.Tests.ClusterTests.Supervisor_Should_Spawn_Session
