[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
NinePSharp/NinePSharp.Server/cluster/ClusterConfigLoader.cs:15:13
     public static AkkaConfig LoadFromTextFile(string filePath, ILogger logger)
     {
         var config = new AkkaConfig();
-        if (!File.Exists(filePath))
+        if (File.Exists(filePath))
         {
             logger.LogWarning("Cluster config file '{FilePath}' not found. Using defaults.", filePath);
killedBy: NinePSharp.Tests.ClusterConfigTests.LoadFromTextFile_Parses_Bind_And_Interface_Settings

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/cluster/ClusterConfigLoader.cs:17:13
         var config = new AkkaConfig();
         if (!File.Exists(filePath))
         {
-            logger.LogWarning("Cluster config file '{FilePath}' not found. Using defaults.", filePath);
+            ;
             return config;
         }

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/cluster/ClusterConfigLoader.cs:21:9
             return config;
         }
 
-        logger.LogInformation("Loading cluster configuration from '{FilePath}'...", filePath);
+        ;
         
         var lines = File.ReadAllLines(filePath);

[Killed] String Method Mutation (Replace Trim() with Empty String)
NinePSharp/NinePSharp.Server/cluster/ClusterConfigLoader.cs:26:27
         var lines = File.ReadAllLines(filePath);
         foreach (var line in lines)
         {
-            var trimmed = line.Trim();
+            var trimmed = "";
             if (string.IsNullOrWhiteSpace(trimmed) || trimmed.StartsWith("#")) continue;
 
killedBy: NinePSharp.Tests.ClusterConfigTests.LoadFromTextFile_Parses_Bind_And_Interface_Settings

[Killed] Negate expression
NinePSharp/NinePSharp.Server/cluster/ClusterConfigLoader.cs:27:17
         foreach (var line in lines)
         {
             var trimmed = line.Trim();
-            if (string.IsNullOrWhiteSpace(trimmed) || trimmed.StartsWith("#")) continue;
+            if (!(string.IsNullOrWhiteSpace(trimmed) || trimmed.StartsWith("#"))) continue;
 
             var parts = trimmed.Split('=', 2);
killedBy: NinePSharp.Tests.ClusterConfigTests.LoadFromTextFile_Parses_Bind_And_Interface_Settings

[Survived] Logical mutation
NinePSharp/NinePSharp.Server/cluster/ClusterConfigLoader.cs:27:17
         foreach (var line in lines)
         {
             var trimmed = line.Trim();
-            if (string.IsNullOrWhiteSpace(trimmed) || trimmed.StartsWith("#")) continue;
+            if (string.IsNullOrWhiteSpace(trimmed) && trimmed.StartsWith("#")) continue;
 
             var parts = trimmed.Split('=', 2);

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/cluster/ClusterConfigLoader.cs:30:17
             if (string.IsNullOrWhiteSpace(trimmed) || trimmed.StartsWith("#")) continue;
 
             var parts = trimmed.Split('=', 2);
-            if (parts.Length != 2) continue;
+            if (parts.Length == 2) continue;
 
             var key = parts[0].Trim().ToLowerInvariant();
killedBy: NinePSharp.Tests.ClusterConfigTests.LoadFromTextFile_Parses_Bind_And_Interface_Settings

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/cluster/ClusterConfigLoader.cs:30:36
             if (string.IsNullOrWhiteSpace(trimmed) || trimmed.StartsWith("#")) continue;
 
             var parts = trimmed.Split('=', 2);
-            if (parts.Length != 2) continue;
+            if (parts.Length != 2) ;
 
             var key = parts[0].Trim().ToLowerInvariant();

[Killed] String Method Mutation (Replace Trim() with Empty String)
NinePSharp/NinePSharp.Server/cluster/ClusterConfigLoader.cs:32:23
             var parts = trimmed.Split('=', 2);
             if (parts.Length != 2) continue;
 
-            var key = parts[0].Trim().ToLowerInvariant();
+            var key = "".ToLowerInvariant();
             var value = parts[1].Trim();
 
killedBy: NinePSharp.Tests.ClusterConfigTests.LoadFromTextFile_Parses_Bind_And_Interface_Settings

[Killed] String Method Mutation (Replace ToLowerInvariant() with ToUpperInvariant())
NinePSharp/NinePSharp.Server/cluster/ClusterConfigLoader.cs:32:23
             var parts = trimmed.Split('=', 2);
             if (parts.Length != 2) continue;
 
-            var key = parts[0].Trim().ToLowerInvariant();
+            var key = parts[0].Trim().ToUpperInvariant();
             var value = parts[1].Trim();
 
killedBy: NinePSharp.Tests.ClusterConfigTests.LoadFromTextFile_Parses_Bind_And_Interface_Settings

[Killed] String Method Mutation (Replace Trim() with Empty String)
NinePSharp/NinePSharp.Server/cluster/ClusterConfigLoader.cs:33:25
             if (parts.Length != 2) continue;
 
             var key = parts[0].Trim().ToLowerInvariant();
-            var value = parts[1].Trim();
+            var value = "";
 
             switch (key)
killedBy: NinePSharp.Tests.ClusterConfigTests.LoadFromTextFile_Parses_Bind_And_Interface_Settings

[Survived] Negate expression
NinePSharp/NinePSharp.Server/cluster/ClusterConfigLoader.cs:39:34
             {
                 case "systemname": config.SystemName = value; break;
                 case "hostname": config.Hostname = value; break;
-                case "port": if (int.TryParse(value, out var p)) config.Port = p; break;
+                case "port": if (!(int.TryParse(value, out var p))) config.Port = p; break;
                 case "bindhostname": config.BindHostname = value; break;
                 case "bindport":

[Killed] Negate expression
NinePSharp/NinePSharp.Server/cluster/ClusterConfigLoader.cs:42:25
                 case "port": if (int.TryParse(value, out var p)) config.Port = p; break;
                 case "bindhostname": config.BindHostname = value; break;
                 case "bindport":
-                    if (int.TryParse(value, out var bp)) config.BindPort = bp;
+                    if (!(int.TryParse(value, out var bp))) config.BindPort = bp;
                     break;
                 case "publichostname": config.PublicHostname = value; break;
killedBy: NinePSharp.Tests.ClusterConfigTests.LoadFromTextFile_Parses_Bind_And_Interface_Settings

[Killed] Negate expression
NinePSharp/NinePSharp.Server/cluster/ClusterConfigLoader.cs:46:25
                     break;
                 case "publichostname": config.PublicHostname = value; break;
                 case "publicport":
-                    if (int.TryParse(value, out var pp)) config.PublicPort = pp;
+                    if (!(int.TryParse(value, out var pp))) config.PublicPort = pp;
                     break;
                 case "interface":
killedBy: NinePSharp.Tests.ClusterConfigTests.LoadFromTextFile_Parses_Bind_And_Interface_Settings

[Killed] Negate expression
NinePSharp/NinePSharp.Server/cluster/ClusterConfigLoader.cs:54:25
                     break;
                 case "preferipv6":
                 case "ipv6":
-                    if (bool.TryParse(value, out var preferIpv6)) config.PreferIPv6 = preferIpv6;
+                    if (!(bool.TryParse(value, out var preferIpv6))) config.PreferIPv6 = preferIpv6;
                     break;
                 case "role": config.Role = value; break;
killedBy: NinePSharp.Tests.ClusterConfigTests.LoadFromTextFile_Parses_Bind_And_Interface_Settings

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/cluster/ClusterConfigLoader.cs:58:21
                     break;
                 case "role": config.Role = value; break;
                 case "seed":
-                    config.SeedNodes.Add(value);
+                    ;
                     break;
             }
killedBy: NinePSharp.Tests.ClusterConfigTests.LoadFromTextFile_Parses_Bind_And_Interface_Settings
