[Killed] Block removal mutation
NinePSharp.Server/cluster/messages/ClusterMessages.cs:13:5
     public IActorRef Handler { get; }
 
     public BackendRegistration(string mountPath, IActorRef handler)
-    {
-        MountPath = mountPath;
-        Handler = handler;
-    }
+    {}
 }
 
killedBy: NinePSharp.Tests.ClusterTests.Registry_Should_Register_And_Retrieve_Backends

[NoCoverage] Block removal mutation
NinePSharp.Server/cluster/messages/ClusterMessages.cs:25:5
     public object Message { get; } // T-Message
 
     public Remote9PRequest(long requestId, object message)
-    {
-        RequestId = requestId;
-        Message = message;
-    }
+    {}
 }
 

[NoCoverage] Block removal mutation
NinePSharp.Server/cluster/messages/ClusterMessages.cs:37:5
     public object Message { get; } // R-Message
 
     public Remote9PResponse(long requestId, object message)
-    {
-        RequestId = requestId;
-        Message = message;
-    }
+    {}
 }
 
