[Killed] Block removal mutation
NinePSharp.Server/cluster/messages/DTOs.cs:18:5
 
     public TWalkDto() {}
     public TWalkDto(Twalk t)
-    {
-        Tag = t.Tag; Fid = t.Fid; NewFid = t.NewFid; Wname = t.Wname;
-    }
+    {}
 }
 
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession

[Survived] Block removal mutation
NinePSharp.Server/cluster/messages/DTOs.cs:33:5
 
     public TReadDto() {}
     public TReadDto(Tread t)
-    {
-        Tag = t.Tag; Fid = t.Fid; Offset = t.Offset; Count = t.Count;
-    }
+    {}
 }
 

[NoCoverage] Block removal mutation
NinePSharp.Server/cluster/messages/DTOs.cs:48:5
 
     public TWriteDto() {}
     public TWriteDto(Twrite t)
-    {
-        Tag = t.Tag; Fid = t.Fid; Offset = t.Offset; Data = t.Data.ToArray();
-    }
+    {}
 }
 

[Survived] Block removal mutation
NinePSharp.Server/cluster/messages/DTOs.cs:62:30
     public byte Mode { get; set; }
     
     public TOpenDto() {}
-    public TOpenDto(Topen t) { Tag = t.Tag; Fid = t.Fid; Mode = t.Mode; }
+    public TOpenDto(Topen t) {}
 }
 

[NoCoverage] Block removal mutation
NinePSharp.Server/cluster/messages/DTOs.cs:71:32
     public ushort Tag { get; set; }
     public uint Fid { get; set; }
     public TClunkDto() {}
-    public TClunkDto(Tclunk t) { Tag = t.Tag; Fid = t.Fid; }
+    public TClunkDto(Tclunk t) {}
 }
 

[Survived] Block removal mutation
NinePSharp.Server/cluster/messages/DTOs.cs:80:30
     public ushort Tag { get; set; }
     public uint Fid { get; set; }
     public TStatDto() {}
-    public TStatDto(Tstat t) { Tag = t.Tag; Fid = t.Fid; }
+    public TStatDto(Tstat t) {}
 }
 

[NoCoverage] Block removal mutation
NinePSharp.Server/cluster/messages/DTOs.cs:90:36
     public uint Fid { get; set; }
     public ulong RequestMask { get; set; }
     public TGetAttrDto() {}
-    public TGetAttrDto(Tgetattr t) { Tag = t.Tag; Fid = t.Fid; RequestMask = t.RequestMask; }
+    public TGetAttrDto(Tgetattr t) {}
 }
 

[NoCoverage] Block removal mutation
NinePSharp.Server/cluster/messages/DTOs.cs:109:5
     public ulong MtimeNsec { get; set; }
     public TSetAttrDto() {}
     public TSetAttrDto(Tsetattr t) 
-    { 
-        Tag = t.Tag; Fid = t.Fid; Valid = t.Valid; Mode = t.Mode; Uid = t.Uid; Gid = t.Gid; 
-        FileSize = t.FileSize; AtimeSec = t.AtimeSec; AtimeNsec = t.AtimeNsec; 
-        MtimeSec = t.MtimeSec; MtimeNsec = t.MtimeNsec;
-    }
+    {}
 }
 

[NoCoverage] Block removal mutation
NinePSharp.Server/cluster/messages/DTOs.cs:122:34
     public ushort Tag { get; set; }
     public uint Fid { get; set; }
     public TRemoveDto() {}
-    public TRemoveDto(Tremove t) { Tag = t.Tag; Fid = t.Fid; }
+    public TRemoveDto(Tremove t) {}
 }
 

[NoCoverage] Statement mutation
NinePSharp.Server/cluster/messages/DTOs.cs:138:9
         Tag = t.Tag; Fid = t.Fid; DotU = t.Stat.DotU;
         StatBytes = new byte[t.Stat.Size];
         int offset = 0;
-        t.Stat.WriteTo(StatBytes, ref offset);
+        ;
     }
 }

[NoCoverage] Block removal mutation
NinePSharp.Server/cluster/messages/DTOs.cs:147:36
 {
     public ushort Tag { get; set; }
     public RSetAttrDto() {}
-    public RSetAttrDto(Rsetattr r) { Tag = r.Tag; }
+    public RSetAttrDto(Rsetattr r) {}
 }
 

[NoCoverage] Block removal mutation
NinePSharp.Server/cluster/messages/DTOs.cs:155:34
 {
     public ushort Tag { get; set; }
     public RRemoveDto() {}
-    public RRemoveDto(Rremove r) { Tag = r.Tag; }
+    public RRemoveDto(Rremove r) {}
 }
 

[NoCoverage] Block removal mutation
NinePSharp.Server/cluster/messages/DTOs.cs:163:32
 {
     public ushort Tag { get; set; }
     public RWstatDto() {}
-    public RWstatDto(Rwstat r) { Tag = r.Tag; }
+    public RWstatDto(Rwstat r) {}
 }
 

[Killed] Block removal mutation
NinePSharp.Server/cluster/messages/DTOs.cs:172:30
     public ushort Tag { get; set; }
     public Qid[] Wqid { get; set; } = Array.Empty<Qid>();
     public RWalkDto() {}
-    public RWalkDto(Rwalk r) { Tag = r.Tag; Wqid = r.Wqid; }
+    public RWalkDto(Rwalk r) {}
 }
 
killedBy: NinePSharp.Tests.ClusterTests.SessionActor_Should_Forward_Requests_To_FileSystem

[NoCoverage] Block removal mutation
NinePSharp.Server/cluster/messages/DTOs.cs:181:30
     public ushort Tag { get; set; }
     public byte[] Data { get; set; } = Array.Empty<byte>();
     public RReadDto() {}
-    public RReadDto(Rread r) { Tag = r.Tag; Data = r.Data.ToArray(); }
+    public RReadDto(Rread r) {}
 }
 

[Survived] Block removal mutation
NinePSharp.Server/cluster/messages/DTOs.cs:190:32
     public ushort Tag { get; set; }
     public uint Count { get; set; }
     public RWriteDto() {}
-    public RWriteDto(Rwrite r) { Tag = r.Tag; Count = r.Count; }
+    public RWriteDto(Rwrite r) {}
 }
 

[NoCoverage] Block removal mutation
NinePSharp.Server/cluster/messages/DTOs.cs:200:30
     public Qid Qid { get; set; }
     public uint Iounit { get; set; }
     public ROpenDto() {}
-    public ROpenDto(Ropen r) { Tag = r.Tag; Qid = r.Qid; Iounit = r.Iounit; }
+    public ROpenDto(Ropen r) {}
 }
 

[NoCoverage] Block removal mutation
NinePSharp.Server/cluster/messages/DTOs.cs:208:32
 {
     public ushort Tag { get; set; }
     public RClunkDto() {}
-    public RClunkDto(Rclunk r) { Tag = r.Tag; }
+    public RClunkDto(Rclunk r) {}
 }
 

[NoCoverage] Statement mutation
NinePSharp.Server/cluster/messages/DTOs.cs:224:9
         DotU = r.Stat.DotU;
         StatBytes = new byte[r.Stat.Size];
         int offset = 0;
-        r.Stat.WriteTo(StatBytes, ref offset);
+        ;
     }
 }

[NoCoverage] Block removal mutation
NinePSharp.Server/cluster/messages/DTOs.cs:255:5
 
     public RGetAttrDto() {}
     public RGetAttrDto(Rgetattr r)
-    {
-        Tag = r.Tag; Valid = r.Valid; Qid = r.Qid; Mode = r.Mode; Uid = r.Uid; Gid = r.Gid;
-        Nlink = r.Nlink; Rdev = r.Rdev; DataSize = r.DataSize; BlkSize = r.BlkSize; Blocks = r.Blocks;
-        AtimeSec = r.AtimeSec; AtimeNsec = r.AtimeNsec; MtimeSec = r.MtimeSec; MtimeNsec = r.MtimeNsec;
-        CtimeSec = r.CtimeSec; CtimeNsec = r.CtimeNsec; BtimeSec = r.BtimeSec; BtimeNsec = r.BtimeNsec;
-        Gen = r.Gen; DataVersion = r.DataVersion;
-    }
+    {}
 }
 

[NoCoverage] Block removal mutation
NinePSharp.Server/cluster/messages/DTOs.cs:270:32
     public ushort Tag { get; set; }
     public string Ename { get; set; } = "";
     public RErrorDto() {}
-    public RErrorDto(Rerror r) { Tag = r.Tag; Ename = r.Ename; }
+    public RErrorDto(Rerror r) {}
 }
 
