[Killed] Block removal mutation
NinePSharp/NinePSharp.Server/cluster/RemoteFileSystem.cs:22:5
     public bool DotU { get; set; }
 
     public RemoteFileSystem(IActorRef sessionActor)
-    {
-        _sessionActor = sessionActor;
-    }
+    {}
 
     public async Task<Rwalk> WalkAsync(Twalk twalk)
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/cluster/RemoteFileSystem.cs:32:38
         var response = await _sessionActor.Ask(dto, _timeout);
         
         if (response is RWalkDto r) return new Rwalk(r.Tag, r.Wqid);
-        if (response is RErrorDto e) throw new NinePProtocolException(e.Ename);
+        if (response is RErrorDto e) ;
         throw new Exception("Unexpected response from remote actor");
     }

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/cluster/RemoteFileSystem.cs:33:9
         
         if (response is RWalkDto r) return new Rwalk(r.Tag, r.Wqid);
         if (response is RErrorDto e) throw new NinePProtocolException(e.Ename);
-        throw new Exception("Unexpected response from remote actor");
+        ;
     }
 

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/cluster/RemoteFileSystem.cs:42:38
         var response = await _sessionActor.Ask(dto, _timeout);
 
         if (response is RReadDto r) return new Rread(r.Tag, r.Data);
-        if (response is RErrorDto e) throw new NinePProtocolException(e.Ename);
+        if (response is RErrorDto e) ;
         throw new Exception("Unexpected response from remote actor");
     }

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/cluster/RemoteFileSystem.cs:52:38
         var response = await _sessionActor.Ask(dto, _timeout);
 
         if (response is RWriteDto r) return new Rwrite(r.Tag, r.Count);
-        if (response is RErrorDto e) throw new NinePProtocolException(e.Ename);
+        if (response is RErrorDto e) ;
         throw new Exception("Unexpected response from remote actor");
     }

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/cluster/RemoteFileSystem.cs:62:38
         var response = await _sessionActor.Ask(dto, _timeout);
 
         if (response is ROpenDto r) return new Ropen(r.Tag, r.Qid, r.Iounit);
-        if (response is RErrorDto e) throw new NinePProtocolException(e.Ename);
+        if (response is RErrorDto e) ;
         throw new Exception("Unexpected response from remote actor");
     }

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/cluster/RemoteFileSystem.cs:72:38
         var response = await _sessionActor.Ask(dto, _timeout);
 
         if (response is RClunkDto r) return new Rclunk(r.Tag);
-        if (response is RErrorDto e) throw new NinePProtocolException(e.Ename);
+        if (response is RErrorDto e) ;
         throw new Exception("Unexpected response from remote actor");
     }

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/cluster/RemoteFileSystem.cs:83:40
 
         if (response is RStatDto r)
         {
-            if (r.StatBytes == null || r.StatBytes.Length == 0)
+            if (r.StatBytes == null || r.StatBytes.Length != 0)
             {
                 throw new NinePProtocolException("Remote stat payload was empty.");
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/cluster/RemoteFileSystem.cs:83:17
 
         if (response is RStatDto r)
         {
-            if (r.StatBytes == null || r.StatBytes.Length == 0)
+            if (r.StatBytes != null || r.StatBytes.Length == 0)
             {
                 throw new NinePProtocolException("Remote stat payload was empty.");
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/cluster/RemoteFileSystem.cs:85:17
         {
             if (r.StatBytes == null || r.StatBytes.Length == 0)
             {
-                throw new NinePProtocolException("Remote stat payload was empty.");
+                ;
             }
 

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/cluster/RemoteFileSystem.cs:92:38
             var stat = new Stat(r.StatBytes, ref offset, r.DotU);
             return new Rstat(r.Tag, stat);
         }
-        if (response is RErrorDto e) throw new NinePProtocolException(e.Ename);
+        if (response is RErrorDto e) ;
         throw new Exception("Unexpected response from remote actor");
     }

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/cluster/RemoteFileSystem.cs:102:38
         var response = await _sessionActor.Ask(dto, _timeout);
 
         if (response is RWstatDto r) return new Rwstat(r.Tag);
-        if (response is RErrorDto e) throw new NinePProtocolException(e.Ename);
+        if (response is RErrorDto e) ;
         throw new Exception("Unexpected response from remote actor");
     }

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/cluster/RemoteFileSystem.cs:112:38
         var response = await _sessionActor.Ask(dto, _timeout);
 
         if (response is RRemoveDto r) return new Rremove(r.Tag);
-        if (response is RErrorDto e) throw new NinePProtocolException(e.Ename);
+        if (response is RErrorDto e) ;
         throw new Exception("Unexpected response from remote actor");
     }

[NoCoverage] Block removal mutation
NinePSharp/NinePSharp.Server/cluster/RemoteFileSystem.cs:122:9
         var response = await _sessionActor.Ask(dto, _timeout);
         
         if (response is RGetAttrDto r)
-        {
-            return new NinePSharp.Messages.Rgetattr(
-                r.Tag, r.Valid, r.Qid, r.Mode, r.Uid, r.Gid, 
-                r.Nlink, r.Rdev, r.DataSize, r.BlkSize, r.Blocks, 
-                r.AtimeSec, r.AtimeNsec, r.MtimeSec, r.MtimeNsec, 
-                r.CtimeSec, r.CtimeNsec, r.BtimeSec, r.BtimeNsec, 
-                r.Gen, r.DataVersion);
-        }
+        {}
         if (response is RErrorDto e) throw new NinePProtocolException(e.Ename);
         throw new Exception("Unexpected response from remote actor");

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/cluster/RemoteFileSystem.cs:140:38
         var response = await _sessionActor.Ask(dto, _timeout);
 
         if (response is RSetAttrDto r) return new Rsetattr(r.Tag);
-        if (response is RErrorDto e) throw new NinePProtocolException(e.Ename);
+        if (response is RErrorDto e) ;
         throw new Exception("Unexpected response from remote actor");
     }

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/cluster/RemoteFileSystem.cs:152:9
         var response = _sessionActor.Ask(new SpawnClone(), _timeout).Result;
         
         if (response is CloneSpawned c) return new RemoteFileSystem(c.Actor);
-        throw new Exception("Failed to clone remote filesystem session");
+        ;
     }
 }
