[Killed] Negate expression
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:23:13
 
     public static void ResolveSecrets(object? obj, ReadOnlySpan<byte> masterKey)
     {
-        if (obj == null || masterKey.IsEmpty) return;
+        if (!(obj == null || masterKey.IsEmpty)) return;
 
         var type = obj.GetType();
killedBy: NinePSharp.Tests.ConfigSecretResolverTests.ConfigSecretResolver_Resolves_Recursive_Secrets

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:23:13
 
     public static void ResolveSecrets(object? obj, ReadOnlySpan<byte> masterKey)
     {
-        if (obj == null || masterKey.IsEmpty) return;
+        if (obj != null || masterKey.IsEmpty) return;
 
         var type = obj.GetType();
killedBy: NinePSharp.Tests.ConfigSecretResolverTests.ConfigSecretResolver_Resolves_Recursive_Secrets

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:26:33
         if (obj == null || masterKey.IsEmpty) return;
 
         var type = obj.GetType();
-        if (type.IsPrimitive || type == typeof(string) || type == typeof(ProtectedSecret)) return;
+        if (type.IsPrimitive || type != typeof(string) || type == typeof(ProtectedSecret)) return;
 
         if (obj is IEnumerable enumerable && !(obj is string))
killedBy: NinePSharp.Tests.ConfigSecretResolverTests.ConfigSecretResolver_Resolves_Recursive_Secrets

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:26:59
         if (obj == null || masterKey.IsEmpty) return;
 
         var type = obj.GetType();
-        if (type.IsPrimitive || type == typeof(string) || type == typeof(ProtectedSecret)) return;
+        if (type.IsPrimitive || type == typeof(string) || type != typeof(ProtectedSecret)) return;
 
         if (obj is IEnumerable enumerable && !(obj is string))
killedBy: NinePSharp.Tests.ConfigSecretResolverTests.ConfigSecretResolver_Resolves_Recursive_Secrets

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:28:46
         var type = obj.GetType();
         if (type.IsPrimitive || type == typeof(string) || type == typeof(ProtectedSecret)) return;
 
-        if (obj is IEnumerable enumerable && !(obj is string))
+        if (obj is IEnumerable enumerable && (obj is string))
         {
             foreach (var item in enumerable)
killedBy: NinePSharp.Tests.ConfigSecretResolverTests.ConfigSecretResolver_Handles_Normal_Strings; NinePSharp.Tests.ConfigSecretResolverTests.ConfigSecretResolver_Resolves_Recursive_Secrets

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:32:17
         {
             foreach (var item in enumerable)
             {
-                ResolveSecrets(item, masterKey);
+                ;
             }
             return;

[Killed] Bitwise mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:37:45
             return;
         }
 
-        var properties = type.GetProperties(BindingFlags.Public | BindingFlags.Instance);
+        var properties = type.GetProperties(BindingFlags.Public & BindingFlags.Instance);
         foreach (var prop in properties)
         {
killedBy: NinePSharp.Tests.ConfigSecretResolverTests.ConfigSecretResolver_Resolves_Recursive_Secrets

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:40:17
         var properties = type.GetProperties(BindingFlags.Public | BindingFlags.Instance);
         foreach (var prop in properties)
         {
-            if (!prop.CanRead) continue;
+            if (prop.CanRead) continue;
 
             var value = prop.GetValue(obj);
killedBy: NinePSharp.Tests.ConfigSecretResolverTests.ConfigSecretResolver_Resolves_Recursive_Secrets

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:40:32
         var properties = type.GetProperties(BindingFlags.Public | BindingFlags.Instance);
         foreach (var prop in properties)
         {
-            if (!prop.CanRead) continue;
+            if (!prop.CanRead) ;
 
             var value = prop.GetValue(obj);

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:43:17
             if (!prop.CanRead) continue;
 
             var value = prop.GetValue(obj);
-            if (value == null) continue;
+            if (value != null) continue;
 
             if (prop.PropertyType == typeof(string))
killedBy: NinePSharp.Tests.ConfigSecretResolverTests.ConfigSecretResolver_Resolves_Recursive_Secrets

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:43:32
             if (!prop.CanRead) continue;
 
             var value = prop.GetValue(obj);
-            if (value == null) continue;
+            if (value == null) ;
 
             if (prop.PropertyType == typeof(string))

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:45:17
             var value = prop.GetValue(obj);
             if (value == null) continue;
 
-            if (prop.PropertyType == typeof(string))
+            if (prop.PropertyType != typeof(string))
             {
                 var strValue = (string)value;
killedBy: NinePSharp.Tests.ConfigSecretResolverTests.ConfigSecretResolver_Handles_Normal_Strings; NinePSharp.Tests.ConfigSecretResolverTests.ConfigSecretResolver_Resolves_Recursive_Secrets

[Killed] Negate expression
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:48:21
             if (prop.PropertyType == typeof(string))
             {
                 var strValue = (string)value;
-                if (strValue.StartsWith("secret://") && prop.CanWrite)
+                if (!(strValue.StartsWith("secret://") && prop.CanWrite))
                 {
                     var decrypted = LuxVault.UnprotectConfig(strValue, masterKey);
killedBy: NinePSharp.Tests.ConfigSecretResolverTests.ConfigSecretResolver_Resolves_Recursive_Secrets

[Survived] Logical mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:48:21
             if (prop.PropertyType == typeof(string))
             {
                 var strValue = (string)value;
-                if (strValue.StartsWith("secret://") && prop.CanWrite)
+                if (strValue.StartsWith("secret://") || prop.CanWrite)
                 {
                     var decrypted = LuxVault.UnprotectConfig(strValue, masterKey);

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:51:25
                 if (strValue.StartsWith("secret://") && prop.CanWrite)
                 {
                     var decrypted = LuxVault.UnprotectConfig(strValue, masterKey);
-                    if (decrypted != null)
+                    if (decrypted == null)
                     {
                         prop.SetValue(obj, decrypted);
killedBy: NinePSharp.Tests.ConfigSecretResolverTests.ConfigSecretResolver_Resolves_Recursive_Secrets

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:53:25
                     var decrypted = LuxVault.UnprotectConfig(strValue, masterKey);
                     if (decrypted != null)
                     {
-                        prop.SetValue(obj, decrypted);
+                        ;
                     }
                 }
killedBy: NinePSharp.Tests.ConfigSecretResolverTests.ConfigSecretResolver_Resolves_Recursive_Secrets

[Killed] Negate expression
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:57:22
                     }
                 }
             }
-            else if (prop.PropertyType.IsClass)
+            else if (!(prop.PropertyType.IsClass))
             {
                 ResolveSecrets(value, masterKey);
killedBy: NinePSharp.Tests.ConfigSecretResolverTests.ConfigSecretResolver_Resolves_Recursive_Secrets

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:59:17
             }
             else if (prop.PropertyType.IsClass)
             {
-                ResolveSecrets(value, masterKey);
+                ;
             }
         }
killedBy: NinePSharp.Tests.ConfigSecretResolverTests.ConfigSecretResolver_Resolves_Recursive_Secrets

[NoCoverage] Equality mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:66:13
 
     public static void ProtectSensitiveFields(object? obj)
     {
-        if (obj == null) return;
+        if (obj != null) return;
 
         var type = obj.GetType();

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:66:26
 
     public static void ProtectSensitiveFields(object? obj)
     {
-        if (obj == null) return;
+        if (obj == null) ;
 
         var type = obj.GetType();

[NoCoverage] Logical mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:69:13
         if (obj == null) return;
 
         var type = obj.GetType();
-        if (type.IsPrimitive || type == typeof(string) || type == typeof(ProtectedSecret)) return;
+        if (type.IsPrimitive || type == typeof(string) && type == typeof(ProtectedSecret)) return;
 
         if (obj is IEnumerable enumerable && !(obj is string))

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:75:17
         {
             foreach (var item in enumerable)
             {
-                ProtectSensitiveFields(item);
+                ;
             }
             return;

[NoCoverage] Negate expression
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:97:21
                 // or just rely on the fact that we can't easily "hide" strings in .NET once they are created.
                 // However, we CAN ensure that the values aren't left in a decryptable state if they were secret://
                 
-                if (strValue.StartsWith("secret://"))
+                if (!(strValue.StartsWith("secret://")))
                 {
                     // This is a special case: the user is providing an ALREADY encrypted secret.

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ConfigSecretResolver.cs:108:17
             }
             else if (prop.PropertyType.IsClass)
             {
-                ProtectSensitiveFields(value);
+                ;
             }
         }
