[Killed] Statement mutation
NinePSharp.Server/configuration/parser/configParser.cs:12:9
     {
         var section = configuration.GetSection(sectionName);
         var settings = new T();
-        section.Bind(settings);
+        ;
         return settings;
     }
killedBy: NinePSharp.Tests.Configuration.ConfigParserTests.Bind_Should_Populate_EndpointConfig_Correcty; NinePSharp.Tests.Configuration.ConfigParserTests.Bind_Should_Roundtrip_Arbitrary_ServerConfig
