[Killed] Equality mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:24:13
 
     public static void InitializeSessionKey(ReadOnlySpan<byte> sessionKey)
     {
-        if (_sessionKey != null) return;
+        if (_sessionKey == null) return;
         
         // Allocate pinned array for session key
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:24:34
 
     public static void InitializeSessionKey(ReadOnlySpan<byte> sessionKey)
     {
-        if (_sessionKey != null) return;
+        if (_sessionKey != null) ;
         
         // Allocate pinned array for session key

[Survived] Boolean mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:27:73
         if (_sessionKey != null) return;
         
         // Allocate pinned array for session key
-        _sessionKey = GC.AllocateArray<byte>(sessionKey.Length, pinned: true);
+        _sessionKey = GC.AllocateArray<byte>(sessionKey.Length, pinned: false);
         sessionKey.CopyTo(_sessionKey);
         

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:28:9
         
         // Allocate pinned array for session key
         _sessionKey = GC.AllocateArray<byte>(sessionKey.Length, pinned: true);
-        sessionKey.CopyTo(_sessionKey);
+        ;
         
         // Memory-lock the static session key

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:33:17
         // Memory-lock the static session key
         unsafe {
             fixed (byte* pKey = _sessionKey) {
-                MemoryLock.Lock((IntPtr)pKey, (nuint)_sessionKey.Length);
+                ;
             }
         }

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:41:13
     [Obsolete("Use the SecureString or ReadOnlySpan<byte> constructor to prevent cleartext leakage into the managed heap.")]
     public ProtectedSecret(string clearText)
     {
-        if (_sessionKey == null) throw new InvalidOperationException("Session key not initialized.");
+        if (_sessionKey != null) throw new InvalidOperationException("Session key not initialized.");
         
         byte[] clearBytes = GC.AllocateArray<byte>(Encoding.UTF8.GetByteCount(clearText), pinned: true);
killedBy: NinePSharp.Tests.ZeroExposureTests.ProtectedSecret_ToString_DoesNotLeak

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:41:34
     [Obsolete("Use the SecureString or ReadOnlySpan<byte> constructor to prevent cleartext leakage into the managed heap.")]
     public ProtectedSecret(string clearText)
     {
-        if (_sessionKey == null) throw new InvalidOperationException("Session key not initialized.");
+        if (_sessionKey == null) ;
         
         byte[] clearBytes = GC.AllocateArray<byte>(Encoding.UTF8.GetByteCount(clearText), pinned: true);

[Survived] Boolean mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:43:99
     {
         if (_sessionKey == null) throw new InvalidOperationException("Session key not initialized.");
         
-        byte[] clearBytes = GC.AllocateArray<byte>(Encoding.UTF8.GetByteCount(clearText), pinned: true);
+        byte[] clearBytes = GC.AllocateArray<byte>(Encoding.UTF8.GetByteCount(clearText), pinned: false);
         Encoding.UTF8.GetBytes(clearText, 0, clearText.Length, clearBytes, 0);
         

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:44:9
         if (_sessionKey == null) throw new InvalidOperationException("Session key not initialized.");
         
         byte[] clearBytes = GC.AllocateArray<byte>(Encoding.UTF8.GetByteCount(clearText), pinned: true);
-        Encoding.UTF8.GetBytes(clearText, 0, clearText.Length, clearBytes, 0);
+        ;
         
         unsafe {

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:48:17
         
         unsafe {
             fixed (byte* pClear = clearBytes) {
-                MemoryLock.Lock((IntPtr)pClear, (nuint)clearBytes.Length);
+                ;
             }
         }

[Survived] Block removal mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:53:9
         }
         
         try
-        {
-            _encryptedData = LuxVault.Encrypt(clearBytes, _sessionKey);
-        }
+        {}
         finally
         {

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:60:21
         {
             unsafe {
                 fixed (byte* pClear = clearBytes) {
-                    MemoryLock.Unlock((IntPtr)pClear, (nuint)clearBytes.Length);
+                    ;
                 }
             }

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:63:13
                     MemoryLock.Unlock((IntPtr)pClear, (nuint)clearBytes.Length);
                 }
             }
-            Array.Clear(clearBytes);
+            ;
         }
     }

[Survived] Arithmetic mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:72:38
         if (_sessionKey == null) throw new InvalidOperationException("Session key not initialized.");
         
         IntPtr ptr = Marshal.SecureStringToGlobalAllocUnicode(secureString);
-        nuint unmanagedLen = (nuint)(secureString.Length * 2);
+        nuint unmanagedLen = (nuint)(secureString.Length / 2);
         MemoryLock.Lock(ptr, unmanagedLen);
         

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:73:9
         
         IntPtr ptr = Marshal.SecureStringToGlobalAllocUnicode(secureString);
         nuint unmanagedLen = (nuint)(secureString.Length * 2);
-        MemoryLock.Lock(ptr, unmanagedLen);
+        ;
         
         try

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:81:21
                 int length = secureString.Length;
                 char* chars = (char*)ptr.ToPointer();
                 int byteCount = Encoding.UTF8.GetByteCount(chars, length);
-                if (byteCount == 0)
+                if (byteCount != 0)
                 {
                     _encryptedData = LuxVault.Encrypt(Array.Empty<byte>(), _sessionKey);
killedBy: NinePSharp.Tests.ProtectedSecretTests.ProtectedSecret_RoundTrip_Works; NinePSharp.Tests.VaultRegressionTests.ProtectedSecret_Use_Wipes_Memory_After_Call; NinePSharp.Tests.VaultRegressionTests.ProtectedSecret_Constructor_Wipes_Input_Buffer

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:84:21
                 if (byteCount == 0)
                 {
                     _encryptedData = LuxVault.Encrypt(Array.Empty<byte>(), _sessionKey);
-                    return;
+                    ;
                 }
                 byte[] clearBytes = GC.AllocateArray<byte>(byteCount, pinned: true);

[Survived] Boolean mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:86:79
                     _encryptedData = LuxVault.Encrypt(Array.Empty<byte>(), _sessionKey);
                     return;
                 }
-                byte[] clearBytes = GC.AllocateArray<byte>(byteCount, pinned: true);
+                byte[] clearBytes = GC.AllocateArray<byte>(byteCount, pinned: false);
                 
                 fixed (byte* pBytes = clearBytes) {

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:89:21
                 byte[] clearBytes = GC.AllocateArray<byte>(byteCount, pinned: true);
                 
                 fixed (byte* pBytes = clearBytes) {
-                    MemoryLock.Lock((IntPtr)pBytes, (nuint)clearBytes.Length);
+                    ;
                 }
                 

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:95:25
                 try {
                     fixed (byte* pBytes = clearBytes)
                     {
-                        Encoding.UTF8.GetBytes(chars, length, pBytes, byteCount);
+                        ;
                     }
                     _encryptedData = LuxVault.Encrypt(clearBytes, _sessionKey);
killedBy: NinePSharp.Tests.VaultRegressionTests.ProtectedSecret_Use_Wipes_Memory_After_Call; NinePSharp.Tests.VaultRegressionTests.ProtectedSecret_Constructor_Wipes_Input_Buffer; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Dispose_Zeros_Internal_Memory

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:101:25
                 }
                 finally {
                     fixed (byte* pBytes = clearBytes) {
-                        MemoryLock.Unlock((IntPtr)pBytes, (nuint)clearBytes.Length);
+                        ;
                     }
                     Array.Clear(clearBytes);

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:109:13
         }
         finally
         {
-            MemoryLock.Unlock(ptr, unmanagedLen);
+            ;
             Marshal.ZeroFreeGlobalAllocUnicode(ptr);
         }

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:110:13
         finally
         {
             MemoryLock.Unlock(ptr, unmanagedLen);
-            Marshal.ZeroFreeGlobalAllocUnicode(ptr);
+            ;
         }
     }

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:126:9
     /// </summary>
     public void Use(Action<ReadOnlySpan<byte>> action)
     {
-        ObjectDisposedException.ThrowIf(_encryptedData == null, this);
+        ;
         if (_sessionKey == null) throw new InvalidOperationException("Session key not initialized.");
 
killedBy: NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Dispose_Zeros_Internal_Memory; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Memory_Not_Leaked_To_Managed_Heap

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:126:41
     /// </summary>
     public void Use(Action<ReadOnlySpan<byte>> action)
     {
-        ObjectDisposedException.ThrowIf(_encryptedData == null, this);
+        ObjectDisposedException.ThrowIf(_encryptedData != null, this);
         if (_sessionKey == null) throw new InvalidOperationException("Session key not initialized.");
 
killedBy: NinePSharp.Tests.ProtectedSecretTests.ProtectedSecret_RoundTrip_Works; NinePSharp.Tests.ProtectedSecretTests.ProtectedSecret_SecureString_RoundTrip_Works; NinePSharp.Tests.ProtectedSecretTests.ProtectedSecret_DisposeClearsData

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:127:13
     public void Use(Action<ReadOnlySpan<byte>> action)
     {
         ObjectDisposedException.ThrowIf(_encryptedData == null, this);
-        if (_sessionKey == null) throw new InvalidOperationException("Session key not initialized.");
+        if (_sessionKey != null) throw new InvalidOperationException("Session key not initialized.");
 
         using var secret = LuxVault.DecryptToBytes(_encryptedData, _sessionKey);
killedBy: NinePSharp.Tests.ProtectedSecretTests.ProtectedSecret_RoundTrip_Works; NinePSharp.Tests.ProtectedSecretTests.ProtectedSecret_SecureString_RoundTrip_Works; NinePSharp.Tests.ProtectedSecretTests.ProtectedSecret_ReadOnlySpan_Constructor_Works

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:127:34
     public void Use(Action<ReadOnlySpan<byte>> action)
     {
         ObjectDisposedException.ThrowIf(_encryptedData == null, this);
-        if (_sessionKey == null) throw new InvalidOperationException("Session key not initialized.");
+        if (_sessionKey == null) ;
 
         using var secret = LuxVault.DecryptToBytes(_encryptedData, _sessionKey);

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:130:13
         if (_sessionKey == null) throw new InvalidOperationException("Session key not initialized.");
 
         using var secret = LuxVault.DecryptToBytes(_encryptedData, _sessionKey);
-        if (secret != null)
+        if (secret == null)
         {
             action(secret.Span);
killedBy: NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Dispose_Zeros_Internal_Memory; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Exception_During_Use_Still_Zeros_Memory; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Zeros_Memory_After_Use

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:132:13
         using var secret = LuxVault.DecryptToBytes(_encryptedData, _sessionKey);
         if (secret != null)
         {
-            action(secret.Span);
+            ;
         }
     }
killedBy: NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Dispose_Zeros_Internal_Memory; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Exception_During_Use_Still_Zeros_Memory; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Zeros_Memory_After_Use

[NoCoverage] Boolean mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:152:73
         {
             // Copy into a temporary pinned array for the async boundary
             // (ReadOnlySpan cannot cross await)
-            byte[] temp = GC.AllocateArray<byte>(secret.Length, pinned: true);
+            byte[] temp = GC.AllocateArray<byte>(secret.Length, pinned: false);
             try
             {

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:155:17
             byte[] temp = GC.AllocateArray<byte>(secret.Length, pinned: true);
             try
             {
-                secret.Span.CopyTo(temp);
+                ;
                 await action(temp.AsMemory());
             }

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:156:17
             try
             {
                 secret.Span.CopyTo(temp);
-                await action(temp.AsMemory());
+                ;
             }
             finally

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:160:17
             }
             finally
             {
-                Array.Clear(temp);
+                ;
             }
         }

[NoCoverage] Block removal mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:173:22
     public string? Reveal()
     {
         string? result = null;
-        Use(bytes => {
-            result = Encoding.UTF8.GetString(bytes);
-        });
+        Use(bytes => {});
         return result;
     }

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:173:9
     public string? Reveal()
     {
         string? result = null;
-        Use(bytes => {
-            result = Encoding.UTF8.GetString(bytes);
-        });
+        ;
         return result;
     }

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:181:13
 
     public void Dispose()
     {
-        if (_encryptedData != null)
+        if (_encryptedData == null)
         {
             Array.Clear(_encryptedData);
killedBy: NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Dispose_Zeros_Internal_Memory; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Memory_Not_Leaked_To_Managed_Heap

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/configuration/ProtectedSecret.cs:183:13
     {
         if (_encryptedData != null)
         {
-            Array.Clear(_encryptedData);
+            ;
             _encryptedData = null;
         }
