[Killed] Block removal mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:41:5
     /// <param name="backends">The collection of local backends available.</param>
     /// <param name="clusterManager">The cluster manager for remote backend discovery.</param>
     public NinePFSDispatcher(ILogger<NinePFSDispatcher> logger, IEnumerable<IProtocolBackend> backends, IClusterManager clusterManager)
-    {
-        _logger = logger;
-        _backends = backends;
-        _clusterManager = clusterManager;
-    }
+    {}
 
     /// <inheritdoc />
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tattach_Unknown_Aname_Returns_Error

[Survived] Conditional (false) mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:50:23
     /// <inheritdoc />
     public async Task<object> DispatchAsync(NinePMessage message, bool dotu, X509Certificate2? certificate = null)
     {
-        var dialect = dotu ? NinePDialect.NineP2000U : NinePDialect.NineP2000;
+        var dialect = (false?NinePDialect.NineP2000U :NinePDialect.NineP2000);
         ushort tag = GetTag(message);
         try

[Survived] Conditional (true) mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:50:23
     /// <inheritdoc />
     public async Task<object> DispatchAsync(NinePMessage message, bool dotu, X509Certificate2? certificate = null)
     {
-        var dialect = dotu ? NinePDialect.NineP2000U : NinePDialect.NineP2000;
+        var dialect = (true?NinePDialect.NineP2000U :NinePDialect.NineP2000);
         ushort tag = GetTag(message);
         try

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:54:17
         ushort tag = GetTag(message);
         try
         {
-            if (message.IsMsgTversion)
+            if (!(message.IsMsgTversion))
             {
                 var t = ((NinePMessage.MsgTversion)message).Item;
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_Returns_Rauth_With_QTAUTH_Qid

[Killed] Block removal mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:55:13
         try
         {
             if (message.IsMsgTversion)
-            {
-                var t = ((NinePMessage.MsgTversion)message).Item;
-                return new Rversion(t.Tag, t.MSize, t.Version);
-            }
+            {}
 
             if (message.IsMsgTauth)
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tversion_Returns_Rversion

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:60:17
                 return new Rversion(t.Tag, t.MSize, t.Version);
             }
 
-            if (message.IsMsgTauth)
+            if (!(message.IsMsgTauth))
             {
                 var t = ((NinePMessage.MsgTauth)message).Item;
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_Returns_Rauth_With_QTAUTH_Qid

[Killed] Block removal mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:61:13
             }
 
             if (message.IsMsgTauth)
-            {
-                var t = ((NinePMessage.MsgTauth)message).Item;
-                var secure = new SecureString();
-                _authFids[t.Afid] = secure;
-                return new Rauth(t.Tag, new Qid(QidType.QTAUTH, 0, (ulong)t.Afid));
-            }
+            {}
 
             if (message.IsMsgTattach)
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_Returns_Rauth_With_QTAUTH_Qid

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:68:17
                 return new Rauth(t.Tag, new Qid(QidType.QTAUTH, 0, (ulong)t.Afid));
             }
 
-            if (message.IsMsgTattach)
+            if (!(message.IsMsgTattach))
             {
                 var t = ((NinePMessage.MsgTattach)message).Item;
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.AuthPassThroughDispatcherTests.Twrite_To_AuthFid_Returns_Rwrite_With_Full_Count

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:72:21
             {
                 var t = ((NinePMessage.MsgTattach)message).Item;
                 SecureString? credentials = null;
-                if (t.Afid != NinePConstants.NoFid && _authFids.TryRemove(t.Afid, out var authSec))
+                if (t.Afid == NinePConstants.NoFid && _authFids.TryRemove(t.Afid, out var authSec))
                 {
                     if (authSec.Length > 0)
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tattach_Drains_AuthFid_Buffer_So_Second_Attach_Gets_Null; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tattach_With_AuthFid_Passes_Credentials_To_Backend

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:74:25
                 SecureString? credentials = null;
                 if (t.Afid != NinePConstants.NoFid && _authFids.TryRemove(t.Afid, out var authSec))
                 {
-                    if (authSec.Length > 0)
+                    if (authSec.Length >= 0)
                     {
                         credentials = authSec;
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tattach_With_Empty_AuthFid_Passes_Null_Not_EmptyString

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:74:25
                 SecureString? credentials = null;
                 if (t.Afid != NinePConstants.NoFid && _authFids.TryRemove(t.Afid, out var authSec))
                 {
-                    if (authSec.Length > 0)
+                    if (authSec.Length < 0)
                     {
                         credentials = authSec;
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tattach_Drains_AuthFid_Buffer_So_Second_Attach_Gets_Null; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tattach_With_AuthFid_Passes_Credentials_To_Backend

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:77:25
                     if (authSec.Length > 0)
                     {
                         credentials = authSec;
-                        credentials.MakeReadOnly();
+                        ;
                     }
                     else

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:81:25
                     }
                     else
                     {
-                        authSec.Dispose();
+                        ;
                     }
                 }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:85:21
                     }
                 }
 
-                if (string.IsNullOrEmpty(t.Aname) || t.Aname == "/")
+                if (!(string.IsNullOrEmpty(t.Aname) || t.Aname == "/"))
                 {
                     _fids[t.Fid] = new RootFileSystem(_backends.ToList(), _clusterManager);
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tattach_Unknown_Aname_Returns_Error

[Killed] Logical mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:85:21
                     }
                 }
 
-                if (string.IsNullOrEmpty(t.Aname) || t.Aname == "/")
+                if (string.IsNullOrEmpty(t.Aname) && t.Aname == "/")
                 {
                     _fids[t.Fid] = new RootFileSystem(_backends.ToList(), _clusterManager);
killedBy: NinePSharp.Tests.SecurityAuditTests.Dispatcher_Handles_Fid_Flooding_Stress

[Killed] Block removal mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:86:17
                 }
 
                 if (string.IsNullOrEmpty(t.Aname) || t.Aname == "/")
-                {
-                    _fids[t.Fid] = new RootFileSystem(_backends.ToList(), _clusterManager);
-                    return new Rattach(t.Tag, new Qid(QidType.QTDIR, 0, 0));
-                }
+                {}
 
                 var backend = _backends.FirstOrDefault(b => b.MountPath == t.Aname || b.MountPath == "/" + t.Aname || b.Name == t.Aname);
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession; NinePSharp.Tests.ClusterFederationTests.RootListing_Includes_ClusterRegisteredMounts

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:91:61
                     return new Rattach(t.Tag, new Qid(QidType.QTDIR, 0, 0));
                 }
 
-                var backend = _backends.FirstOrDefault(b => b.MountPath == t.Aname || b.MountPath == "/" + t.Aname || b.Name == t.Aname);
+                var backend = _backends.FirstOrDefault(b => b.MountPath != t.Aname || b.MountPath == "/" + t.Aname || b.Name == t.Aname);
                 if (backend != null)
                 {
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tattach_Unknown_Aname_Returns_Error

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:91:119
                     return new Rattach(t.Tag, new Qid(QidType.QTDIR, 0, 0));
                 }
 
-                var backend = _backends.FirstOrDefault(b => b.MountPath == t.Aname || b.MountPath == "/" + t.Aname || b.Name == t.Aname);
+                var backend = _backends.FirstOrDefault(b => b.MountPath == t.Aname || b.MountPath == "/" + t.Aname || b.Name != t.Aname);
                 if (backend != null)
                 {
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tattach_Unknown_Aname_Returns_Error

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:92:21
                 }
 
                 var backend = _backends.FirstOrDefault(b => b.MountPath == t.Aname || b.MountPath == "/" + t.Aname || b.Name == t.Aname);
-                if (backend != null)
+                if (backend == null)
                 {
                     var fs = backend.GetFileSystem(credentials, certificate);
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tattach_With_Empty_AuthFid_Passes_Null_Not_EmptyString

[Killed] Block removal mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:93:17
 
                 var backend = _backends.FirstOrDefault(b => b.MountPath == t.Aname || b.MountPath == "/" + t.Aname || b.Name == t.Aname);
                 if (backend != null)
-                {
-                    var fs = backend.GetFileSystem(credentials, certificate);
-                    _fids[t.Fid] = fs;
-                    return new Rattach(t.Tag, new Qid(QidType.QTDIR, 0, 0));
-                }
+                {}
 
                 if (_clusterManager.Registry != null)
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tattach_With_Empty_AuthFid_Passes_Null_Not_EmptyString

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:99:21
                     return new Rattach(t.Tag, new Qid(QidType.QTDIR, 0, 0));
                 }
 
-                if (_clusterManager.Registry != null)
+                if (_clusterManager.Registry == null)
                 {
                     var remotePath = t.Aname.StartsWith("/", StringComparison.Ordinal) ? t.Aname : "/" + t.Aname;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tattach_With_No_Backend_Returns_Rerror

[NoCoverage] Conditional (false) mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:101:38
 
                 if (_clusterManager.Registry != null)
                 {
-                    var remotePath = t.Aname.StartsWith("/", StringComparison.Ordinal) ? t.Aname : "/" + t.Aname;
+                    var remotePath = (false?t.Aname :"/" + t.Aname);
                     var registryResponse = await _clusterManager.Registry.Ask<object>(new GetBackend(remotePath), _clusterTimeout);
                     if (registryResponse is BackendFound found)

[NoCoverage] Conditional (true) mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:101:38
 
                 if (_clusterManager.Registry != null)
                 {
-                    var remotePath = t.Aname.StartsWith("/", StringComparison.Ordinal) ? t.Aname : "/" + t.Aname;
+                    var remotePath = (true?t.Aname :"/" + t.Aname);
                     var registryResponse = await _clusterManager.Registry.Ask<object>(new GetBackend(remotePath), _clusterTimeout);
                     if (registryResponse is BackendFound found)

[NoCoverage] Block removal mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:107:25
                     {
                         var sessionResponse = await found.Actor.Ask<object>(new SpawnSession(), _clusterTimeout);
                         if (sessionResponse is SessionSpawned session)
-                        {
-                            _fids[t.Fid] = new RemoteFileSystem(session.Session);
-                            return new Rattach(t.Tag, new Qid(QidType.QTDIR, 0, 0));
-                        }
+                        {}
                     }
                 }

[Killed] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:114:17
                     }
                 }
 
-                throw new NinePProtocolException($"No backend found for aname '{t.Aname}'");
+                ;
             }
 
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tattach_With_No_Backend_Returns_Rerror

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:117:17
                 throw new NinePProtocolException($"No backend found for aname '{t.Aname}'");
             }
 
-            if (message.IsMsgTwalk)
+            if (!(message.IsMsgTwalk))
             {
                 var t = ((NinePMessage.MsgTwalk)message).Item;
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.AuthPassThroughDispatcherTests.Twrite_To_AuthFid_Returns_Rwrite_With_Full_Count

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:120:21
             if (message.IsMsgTwalk)
             {
                 var t = ((NinePMessage.MsgTwalk)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
 
                 // Per 9P spec: newfid must not already exist (unless newfid == fid for walk-in-place)
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.StateViolationTests.FID_Lifecycle_Sequence_Validation; NinePSharp.Tests.ProtocolAdherenceTests.Walk_Nwname0_Clones_Fid

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:120:60
             if (message.IsMsgTwalk)
             {
                 var t = ((NinePMessage.MsgTwalk)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
 
                 // Per 9P spec: newfid must not already exist (unless newfid == fid for walk-in-place)

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:123:21
                 if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
 
                 // Per 9P spec: newfid must not already exist (unless newfid == fid for walk-in-place)
-                if (t.NewFid != t.Fid && _fids.ContainsKey(t.NewFid))
+                if (!(t.NewFid != t.Fid && _fids.ContainsKey(t.NewFid)))
                     return new Rerror(t.Tag, $"newfid {t.NewFid} already exists");
 
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession; NinePSharp.Tests.StateViolationTests.FID_Lifecycle_Sequence_Validation

[Killed] Logical mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:123:21
                 if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
 
                 // Per 9P spec: newfid must not already exist (unless newfid == fid for walk-in-place)
-                if (t.NewFid != t.Fid && _fids.ContainsKey(t.NewFid))
+                if (t.NewFid != t.Fid || _fids.ContainsKey(t.NewFid))
                     return new Rerror(t.Tag, $"newfid {t.NewFid} already exists");
 
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession; NinePSharp.Tests.StateViolationTests.FID_Lifecycle_Sequence_Validation

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:132:21
                 // Atomic Twalk: only assign newfid if walk is successful
                 // Per spec: nwname = 0 means clone, always successful.
                 // Otherwise, must return exactly nwname QIDs.
-                if (t.Wname.Length == 0 || (response.Wqid != null && response.Wqid.Length == t.Wname.Length))
+                if (!(t.Wname.Length == 0 || (response.Wqid != null && response.Wqid.Length == t.Wname.Length)))
                 {
                     _fids[t.NewFid] = targetFs;
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession; NinePSharp.Tests.StateViolationTests.Walk_NewFid_Already_Exists_Returns_Error

[Killed] Logical mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:132:45
                 // Atomic Twalk: only assign newfid if walk is successful
                 // Per spec: nwname = 0 means clone, always successful.
                 // Otherwise, must return exactly nwname QIDs.
-                if (t.Wname.Length == 0 || (response.Wqid != null && response.Wqid.Length == t.Wname.Length))
+                if (t.Wname.Length == 0 || (response.Wqid != null || response.Wqid.Length == t.Wname.Length))
                 {
                     _fids[t.NewFid] = targetFs;
killedBy: NinePSharp.Tests.ProtocolAdherenceTests.Walk_Failed_Does_Not_Create_NewFid

[Killed] Block removal mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:133:17
                 // Per spec: nwname = 0 means clone, always successful.
                 // Otherwise, must return exactly nwname QIDs.
                 if (t.Wname.Length == 0 || (response.Wqid != null && response.Wqid.Length == t.Wname.Length))
-                {
-                    _fids[t.NewFid] = targetFs;
-                }
+                {}
 
                 return response;
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession; NinePSharp.Tests.StateViolationTests.Walk_NewFid_Already_Exists_Returns_Error

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:140:17
                 return response;
             }
 
-            if (message.IsMsgTopen)
+            if (!(message.IsMsgTopen))
             {
                 var t = ((NinePMessage.MsgTopen)message).Item;
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.AuthPassThroughDispatcherTests.Twrite_To_AuthFid_Returns_Rwrite_With_Full_Count

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:143:21
             if (message.IsMsgTopen)
             {
                 var t = ((NinePMessage.MsgTopen)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.OpenAsync(t);
             }
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession; NinePSharp.Tests.StateViolationTests.FID_Lifecycle_Sequence_Validation

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:143:60
             if (message.IsMsgTopen)
             {
                 var t = ((NinePMessage.MsgTopen)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.OpenAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:147:17
                 return await fs.OpenAsync(t);
             }
 
-            if (message.IsMsgTread)
+            if (!(message.IsMsgTread))
             {
                 var t = ((NinePMessage.MsgTread)message).Item;
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.AuthPassThroughDispatcherTests.Twrite_To_AuthFid_Returns_Rwrite_With_Full_Count

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:150:21
             if (message.IsMsgTread)
             {
                 var t = ((NinePMessage.MsgTread)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.ReadAsync(t);
             }
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession; NinePSharp.Tests.StateViolationTests.FID_Lifecycle_Sequence_Validation; NinePSharp.Tests.StateMachineChaosTests.Read_Without_Attach_Returns_Error

[Killed] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:150:60
             if (message.IsMsgTread)
             {
                 var t = ((NinePMessage.MsgTread)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.ReadAsync(t);
             }
killedBy: NinePSharp.Tests.StateMachineChaosTests.Read_Without_Attach_Returns_Error; NinePSharp.Tests.ProtocolAdherenceTests.Walk_Failed_Does_Not_Create_NewFid

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:154:17
                 return await fs.ReadAsync(t);
             }
 
-            if (message.IsMsgTwrite)
+            if (!(message.IsMsgTwrite))
             {
                 var t = ((NinePMessage.MsgTwrite)message).Item;
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.AuthPassThroughDispatcherTests.Twrite_To_AuthFid_Returns_Rwrite_With_Full_Count

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:157:21
             if (message.IsMsgTwrite)
             {
                 var t = ((NinePMessage.MsgTwrite)message).Item;
-                if (_authFids.TryGetValue(t.Fid, out var secure))
+                if (!(_authFids.TryGetValue(t.Fid, out var secure)))
                 {
                     string data = System.Text.Encoding.UTF8.GetString(t.Data.ToArray());
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Twrite_To_AuthFid_Returns_Rwrite_With_Full_Count; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tattach_Drains_AuthFid_Buffer_So_Second_Attach_Gets_Null

[Killed] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:160:46
                 if (_authFids.TryGetValue(t.Fid, out var secure))
                 {
                     string data = System.Text.Encoding.UTF8.GetString(t.Data.ToArray());
-                    foreach (char c in data) secure.AppendChar(c);
+                    foreach (char c in data) ;
                     return new Rwrite(t.Tag, (uint)t.Data.Length);
                 }
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tattach_Drains_AuthFid_Buffer_So_Second_Attach_Gets_Null; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tattach_With_AuthFid_Passes_Credentials_To_Backend

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:163:21
                     foreach (char c in data) secure.AppendChar(c);
                     return new Rwrite(t.Tag, (uint)t.Data.Length);
                 }
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.WriteAsync(t);
             }

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:163:60
                     foreach (char c in data) secure.AppendChar(c);
                     return new Rwrite(t.Tag, (uint)t.Data.Length);
                 }
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.WriteAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:167:17
                 return await fs.WriteAsync(t);
             }
 
-            if (message.IsMsgTclunk)
+            if (!(message.IsMsgTclunk))
             {
                 var t = ((NinePMessage.MsgTclunk)message).Item;
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.SecurityAuditTests.Dispatcher_Handles_Fid_Flooding_Stress

[Killed] Boolean mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:170:36
             if (message.IsMsgTclunk)
             {
                 var t = ((NinePMessage.MsgTclunk)message).Item;
-                bool authRemoved = false;
+                bool authRemoved = true;
                 if (_authFids.TryRemove(t.Fid, out var secure))
                 {
killedBy: NinePSharp.Tests.StateMachineChaosTests.Double_Clunk_Returns_Error

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:171:21
             {
                 var t = ((NinePMessage.MsgTclunk)message).Item;
                 bool authRemoved = false;
-                if (_authFids.TryRemove(t.Fid, out var secure))
+                if (!(_authFids.TryRemove(t.Fid, out var secure)))
                 {
                     secure.Dispose();
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer
