[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:173:21
                 bool authRemoved = false;
                 if (_authFids.TryRemove(t.Fid, out var secure))
                 {
-                    secure.Dispose();
+                    ;
                     authRemoved = true;
                 }

[Killed] Boolean mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:174:35
                 if (_authFids.TryRemove(t.Fid, out var secure))
                 {
                     secure.Dispose();
-                    authRemoved = true;
+                    authRemoved = false;
                 }
                 
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:177:21
                     authRemoved = true;
                 }
                 
-                if (_fids.TryRemove(t.Fid, out var fs))
+                if (!(_fids.TryRemove(t.Fid, out var fs)))
                 {
                     return await fs.ClunkAsync(t);
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer

[Killed] Block removal mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:178:17
                 }
                 
                 if (_fids.TryRemove(t.Fid, out var fs))
-                {
-                    return await fs.ClunkAsync(t);
-                }
+                {}
 
                 if (authRemoved) return new Rclunk(t.Tag);
killedBy: NinePSharp.Tests.StateViolationTests.FID_Lifecycle_Sequence_Validation; NinePSharp.Tests.StateViolationTests.Double_Clunk_Returns_Error; NinePSharp.Tests.StateViolationTests.Multiple_Concurrent_FIDs_Tracked_Independently

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:182:21
                     return await fs.ClunkAsync(t);
                 }
 
-                if (authRemoved) return new Rclunk(t.Tag);
+                if (!(authRemoved)) return new Rclunk(t.Tag);
                 return new Rerror(t.Tag, $"Unknown FID: {t.Fid}");
             }
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.StateViolationTests.Double_Clunk_Returns_Error; NinePSharp.Tests.StateMachineChaosTests.Double_Clunk_Returns_Error

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:186:17
                 return new Rerror(t.Tag, $"Unknown FID: {t.Fid}");
             }
 
-            if (message.IsMsgTstat)
+            if (!(message.IsMsgTstat))
             {
                 var t = ((NinePMessage.MsgTstat)message).Item;
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.SecurityAuditTests.Dispatcher_Handles_Fid_Flooding_Stress; NinePSharp.Tests.StateViolationTests.Multiple_Concurrent_FIDs_Tracked_Independently

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:189:21
             if (message.IsMsgTstat)
             {
                 var t = ((NinePMessage.MsgTstat)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.StatAsync(t);
             }
killedBy: NinePSharp.Tests.SecurityAuditTests.Dispatcher_Handles_Fid_Flooding_Stress

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:189:60
             if (message.IsMsgTstat)
             {
                 var t = ((NinePMessage.MsgTstat)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.StatAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:193:17
                 return await fs.StatAsync(t);
             }
 
-            if (message.IsMsgTgetattr)
+            if (!(message.IsMsgTgetattr))
             {
                 var t = ((NinePMessage.MsgTgetattr)message).Item;
killedBy: NinePSharp.Tests.StateViolationTests.Remove_Also_Clunks_FID

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:196:21
             if (message.IsMsgTgetattr)
             {
                 var t = ((NinePMessage.MsgTgetattr)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.GetAttrAsync(t);
             }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:196:60
             if (message.IsMsgTgetattr)
             {
                 var t = ((NinePMessage.MsgTgetattr)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.GetAttrAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:200:17
                 return await fs.GetAttrAsync(t);
             }
 
-            if (message.IsMsgTsetattr)
+            if (!(message.IsMsgTsetattr))
             {
                 var t = ((NinePMessage.MsgTsetattr)message).Item;
killedBy: NinePSharp.Tests.StateViolationTests.Remove_Also_Clunks_FID

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:203:60
             if (message.IsMsgTsetattr)
             {
                 var t = ((NinePMessage.MsgTsetattr)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.SetAttrAsync(t);
             }

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:203:21
             if (message.IsMsgTsetattr)
             {
                 var t = ((NinePMessage.MsgTsetattr)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.SetAttrAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:207:17
                 return await fs.SetAttrAsync(t);
             }
 
-            if (message.IsMsgTcreate)
+            if (!(message.IsMsgTcreate))
             {
                 var t = ((NinePMessage.MsgTcreate)message).Item;
killedBy: NinePSharp.Tests.StateViolationTests.Remove_Also_Clunks_FID; NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:210:21
             if (message.IsMsgTcreate)
             {
                 var t = ((NinePMessage.MsgTcreate)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.CreateAsync(t);
             }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:210:60
             if (message.IsMsgTcreate)
             {
                 var t = ((NinePMessage.MsgTcreate)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.CreateAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:214:17
                 return await fs.CreateAsync(t);
             }
 
-            if (message.IsMsgTwstat)
+            if (!(message.IsMsgTwstat))
             {
                 var t = ((NinePMessage.MsgTwstat)message).Item;
killedBy: NinePSharp.Tests.StateViolationTests.Remove_Also_Clunks_FID; NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:217:21
             if (message.IsMsgTwstat)
             {
                 var t = ((NinePMessage.MsgTwstat)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.WstatAsync(t);
             }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:217:60
             if (message.IsMsgTwstat)
             {
                 var t = ((NinePMessage.MsgTwstat)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.WstatAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:221:17
                 return await fs.WstatAsync(t);
             }
 
-            if (message.IsMsgTremove)
+            if (!(message.IsMsgTremove))
             {
                 var t = ((NinePMessage.MsgTremove)message).Item;
killedBy: NinePSharp.Tests.StateViolationTests.Remove_Also_Clunks_FID; NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Survived] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:224:21
             if (message.IsMsgTremove)
             {
                 var t = ((NinePMessage.MsgTremove)message).Item;
-                if (_fids.TryRemove(t.Fid, out var fs))
+                if (!(_fids.TryRemove(t.Fid, out var fs)))
                 {
                     return await fs.RemoveAsync(t);

[Survived] Block removal mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:225:17
             {
                 var t = ((NinePMessage.MsgTremove)message).Item;
                 if (_fids.TryRemove(t.Fid, out var fs))
-                {
-                    return await fs.RemoveAsync(t);
-                }
+                {}
                 throw new NinePProtocolException("Unknown FID");
             }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:228:17
                 {
                     return await fs.RemoveAsync(t);
                 }
-                throw new NinePProtocolException("Unknown FID");
+                ;
             }
 

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:232:17
             }
 
             // 9P2000.L Specific Additions
-            if (message.IsMsgTstatfs)
+            if (!(message.IsMsgTstatfs))
             {
                 var t = ((NinePMessage.MsgTstatfs)message).Item;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:235:21
             if (message.IsMsgTstatfs)
             {
                 var t = ((NinePMessage.MsgTstatfs)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.StatfsAsync(t);
             }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:235:60
             if (message.IsMsgTstatfs)
             {
                 var t = ((NinePMessage.MsgTstatfs)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.StatfsAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:239:17
                 return await fs.StatfsAsync(t);
             }
 
-            if (message.IsMsgTlopen)
+            if (!(message.IsMsgTlopen))
             {
                 var t = ((NinePMessage.MsgTlopen)message).Item;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:242:60
             if (message.IsMsgTlopen)
             {
                 var t = ((NinePMessage.MsgTlopen)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.LopenAsync(t);
             }

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:242:21
             if (message.IsMsgTlopen)
             {
                 var t = ((NinePMessage.MsgTlopen)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.LopenAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:246:17
                 return await fs.LopenAsync(t);
             }
 
-            if (message.IsMsgTlcreate)
+            if (!(message.IsMsgTlcreate))
             {
                 var t = ((NinePMessage.MsgTlcreate)message).Item;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:249:21
             if (message.IsMsgTlcreate)
             {
                 var t = ((NinePMessage.MsgTlcreate)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.LcreateAsync(t);
             }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:249:60
             if (message.IsMsgTlcreate)
             {
                 var t = ((NinePMessage.MsgTlcreate)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.LcreateAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:253:17
                 return await fs.LcreateAsync(t);
             }
 
-            if (message.IsMsgTsymlink)
+            if (!(message.IsMsgTsymlink))
             {
                 var t = ((NinePMessage.MsgTsymlink)message).Item;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:256:60
             if (message.IsMsgTsymlink)
             {
                 var t = ((NinePMessage.MsgTsymlink)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.SymlinkAsync(t);
             }

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:256:21
             if (message.IsMsgTsymlink)
             {
                 var t = ((NinePMessage.MsgTsymlink)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.SymlinkAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:260:17
                 return await fs.SymlinkAsync(t);
             }
 
-            if (message.IsMsgTmknod)
+            if (!(message.IsMsgTmknod))
             {
                 var t = ((NinePMessage.MsgTmknod)message).Item;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:263:61
             if (message.IsMsgTmknod)
             {
                 var t = ((NinePMessage.MsgTmknod)message).Item;
-                if (!_fids.TryGetValue(t.Dfid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Dfid, out var fs)) ;
                 return await fs.MknodAsync(t);
             }

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:263:21
             if (message.IsMsgTmknod)
             {
                 var t = ((NinePMessage.MsgTmknod)message).Item;
-                if (!_fids.TryGetValue(t.Dfid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Dfid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.MknodAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:267:17
                 return await fs.MknodAsync(t);
             }
 
-            if (message.IsMsgTrename)
+            if (!(message.IsMsgTrename))
             {
                 var t = ((NinePMessage.MsgTrename)message).Item;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:270:60
             if (message.IsMsgTrename)
             {
                 var t = ((NinePMessage.MsgTrename)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.RenameAsync(t);
             }

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:270:21
             if (message.IsMsgTrename)
             {
                 var t = ((NinePMessage.MsgTrename)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.RenameAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:274:17
                 return await fs.RenameAsync(t);
             }
 
-            if (message.IsMsgTreadlink)
+            if (!(message.IsMsgTreadlink))
             {
                 var t = ((NinePMessage.MsgTreadlink)message).Item;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:277:21
             if (message.IsMsgTreadlink)
             {
                 var t = ((NinePMessage.MsgTreadlink)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.ReadlinkAsync(t);
             }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:277:60
             if (message.IsMsgTreadlink)
             {
                 var t = ((NinePMessage.MsgTreadlink)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.ReadlinkAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:281:17
                 return await fs.ReadlinkAsync(t);
             }
 
-            if (message.IsMsgTxattrwalk)
+            if (!(message.IsMsgTxattrwalk))
             {
                 var t = ((NinePMessage.MsgTxattrwalk)message).Item;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:284:21
             if (message.IsMsgTxattrwalk)
             {
                 var t = ((NinePMessage.MsgTxattrwalk)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.XattrwalkAsync(t);
             }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:284:60
             if (message.IsMsgTxattrwalk)
             {
                 var t = ((NinePMessage.MsgTxattrwalk)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.XattrwalkAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:288:17
                 return await fs.XattrwalkAsync(t);
             }
 
-            if (message.IsMsgTxattrcreate)
+            if (!(message.IsMsgTxattrcreate))
             {
                 var t = ((NinePMessage.MsgTxattrcreate)message).Item;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:291:60
             if (message.IsMsgTxattrcreate)
             {
                 var t = ((NinePMessage.MsgTxattrcreate)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.XattrcreateAsync(t);
             }

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:291:21
             if (message.IsMsgTxattrcreate)
             {
                 var t = ((NinePMessage.MsgTxattrcreate)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.XattrcreateAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:295:17
                 return await fs.XattrcreateAsync(t);
             }
 
-            if (message.IsMsgTreaddir)
+            if (!(message.IsMsgTreaddir))
             {
                 var t = ((NinePMessage.MsgTreaddir)message).Item;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:298:60
             if (message.IsMsgTreaddir)
             {
                 var t = ((NinePMessage.MsgTreaddir)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.ReaddirAsync(t);
             }

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:298:21
             if (message.IsMsgTreaddir)
             {
                 var t = ((NinePMessage.MsgTreaddir)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.ReaddirAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:302:17
                 return await fs.ReaddirAsync(t);
             }
 
-            if (message.IsMsgTfsync)
+            if (!(message.IsMsgTfsync))
             {
                 var t = ((NinePMessage.MsgTfsync)message).Item;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:305:21
             if (message.IsMsgTfsync)
             {
                 var t = ((NinePMessage.MsgTfsync)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.FsyncAsync(t);
             }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:305:60
             if (message.IsMsgTfsync)
             {
                 var t = ((NinePMessage.MsgTfsync)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.FsyncAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:309:17
                 return await fs.FsyncAsync(t);
             }
 
-            if (message.IsMsgTlock)
+            if (!(message.IsMsgTlock))
             {
                 var t = ((NinePMessage.MsgTlock)message).Item;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:312:60
             if (message.IsMsgTlock)
             {
                 var t = ((NinePMessage.MsgTlock)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.LockAsync(t);
             }

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:312:21
             if (message.IsMsgTlock)
             {
                 var t = ((NinePMessage.MsgTlock)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.LockAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:316:17
                 return await fs.LockAsync(t);
             }
 
-            if (message.IsMsgTgetlock)
+            if (!(message.IsMsgTgetlock))
             {
                 var t = ((NinePMessage.MsgTgetlock)message).Item;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:319:21
             if (message.IsMsgTgetlock)
             {
                 var t = ((NinePMessage.MsgTgetlock)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.GetlockAsync(t);
             }
