[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:319:60
             if (message.IsMsgTgetlock)
             {
                 var t = ((NinePMessage.MsgTgetlock)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.GetlockAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:323:17
                 return await fs.GetlockAsync(t);
             }
 
-            if (message.IsMsgTlink)
+            if (!(message.IsMsgTlink))
             {
                 var t = ((NinePMessage.MsgTlink)message).Item;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:326:21
             if (message.IsMsgTlink)
             {
                 var t = ((NinePMessage.MsgTlink)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.LinkAsync(t);
             }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:326:60
             if (message.IsMsgTlink)
             {
                 var t = ((NinePMessage.MsgTlink)message).Item;
-                if (!_fids.TryGetValue(t.Fid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Fid, out var fs)) ;
                 return await fs.LinkAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:330:17
                 return await fs.LinkAsync(t);
             }
 
-            if (message.IsMsgTmkdir)
+            if (!(message.IsMsgTmkdir))
             {
                 var t = ((NinePMessage.MsgTmkdir)message).Item;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:333:61
             if (message.IsMsgTmkdir)
             {
                 var t = ((NinePMessage.MsgTmkdir)message).Item;
-                if (!_fids.TryGetValue(t.Dfid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.Dfid, out var fs)) ;
                 return await fs.MkdirAsync(t);
             }

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:333:21
             if (message.IsMsgTmkdir)
             {
                 var t = ((NinePMessage.MsgTmkdir)message).Item;
-                if (!_fids.TryGetValue(t.Dfid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.Dfid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.MkdirAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:337:17
                 return await fs.MkdirAsync(t);
             }
 
-            if (message.IsMsgTrenameat)
+            if (!(message.IsMsgTrenameat))
             {
                 var t = ((NinePMessage.MsgTrenameat)message).Item;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:340:66
             if (message.IsMsgTrenameat)
             {
                 var t = ((NinePMessage.MsgTrenameat)message).Item;
-                if (!_fids.TryGetValue(t.OldDirFid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.OldDirFid, out var fs)) ;
                 return await fs.RenameatAsync(t);
             }

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:340:21
             if (message.IsMsgTrenameat)
             {
                 var t = ((NinePMessage.MsgTrenameat)message).Item;
-                if (!_fids.TryGetValue(t.OldDirFid, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.OldDirFid, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.RenameatAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:344:17
                 return await fs.RenameatAsync(t);
             }
 
-            if (message.IsMsgTunlinkat)
+            if (!(message.IsMsgTunlinkat))
             {
                 var t = ((NinePMessage.MsgTunlinkat)message).Item;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:347:21
             if (message.IsMsgTunlinkat)
             {
                 var t = ((NinePMessage.MsgTunlinkat)message).Item;
-                if (!_fids.TryGetValue(t.DirFd, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (_fids.TryGetValue(t.DirFd, out var fs)) throw new NinePProtocolException("Unknown FID");
                 return await fs.UnlinkatAsync(t);
             }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:347:62
             if (message.IsMsgTunlinkat)
             {
                 var t = ((NinePMessage.MsgTunlinkat)message).Item;
-                if (!_fids.TryGetValue(t.DirFd, out var fs)) throw new NinePProtocolException("Unknown FID");
+                if (!_fids.TryGetValue(t.DirFd, out var fs)) ;
                 return await fs.UnlinkatAsync(t);
             }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:351:17
                 return await fs.UnlinkatAsync(t);
             }
 
-            if (message.IsMsgTflush)
+            if (!(message.IsMsgTflush))
             {
                 var t = ((NinePMessage.MsgTflush)message).Item;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Block removal mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:352:13
             }
 
             if (message.IsMsgTflush)
-            {
-                var t = ((NinePMessage.MsgTflush)message).Item;
-                return new Rflush(t.Tag);
-            }
+            {}
 
             throw new NinePProtocolException("Message type not implemented or supported");
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:357:13
                 return new Rflush(t.Tag);
             }
 
-            throw new NinePProtocolException("Message type not implemented or supported");
+            ;
         }
         catch (NinePProtocolException ex)

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:361:17
         }
         catch (NinePProtocolException ex)
         {
-            if (dotu)
+            if (!(dotu))
             {
                 // In 9P2000.L, we return Rlerror with numerical errno
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tattach_Unknown_Aname_Returns_Error; NinePSharp.Tests.AuthPassThroughDispatcherTests.Twrite_To_NonAuthFid_Without_Attach_Returns_Error

[NoCoverage] Block removal mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:362:13
         catch (NinePProtocolException ex)
         {
             if (dotu)
-            {
-                // In 9P2000.L, we return Rlerror with numerical errno
-                return new Messages.Rlerror(tag, (uint)ex.ErrorCode);
-            }
+            {}
             return new Messages.Rerror(tag, ex.ErrorMessage);
         }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:370:13
         }
         catch (Exception ex)
         {
-            _logger.LogError(ex, "Unexpected error during dispatch");
+            ;
             if (dotu)
             {

[NoCoverage] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:371:17
         catch (Exception ex)
         {
             _logger.LogError(ex, "Unexpected error during dispatch");
-            if (dotu)
+            if (!(dotu))
             {
                 return new Messages.Rlerror(tag, 5); // EIO

[NoCoverage] Block removal mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:372:13
         {
             _logger.LogError(ex, "Unexpected error during dispatch");
             if (dotu)
-            {
-                return new Messages.Rlerror(tag, 5); // EIO
-            }
+            {}
             return new Messages.Rerror(tag, "Internal Server Error");
         }

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:381:13
 
     private ushort GetTag(NinePMessage message)
     {
-        if (message.IsMsgTversion) return ((NinePMessage.MsgTversion)message).Item.Tag;
+        if (!(message.IsMsgTversion)) return ((NinePMessage.MsgTversion)message).Item.Tag;
         if (message.IsMsgTauth) return ((NinePMessage.MsgTauth)message).Item.Tag;
         if (message.IsMsgTattach) return ((NinePMessage.MsgTattach)message).Item.Tag;
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_Returns_Rauth_With_QTAUTH_Qid

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:382:13
     private ushort GetTag(NinePMessage message)
     {
         if (message.IsMsgTversion) return ((NinePMessage.MsgTversion)message).Item.Tag;
-        if (message.IsMsgTauth) return ((NinePMessage.MsgTauth)message).Item.Tag;
+        if (!(message.IsMsgTauth)) return ((NinePMessage.MsgTauth)message).Item.Tag;
         if (message.IsMsgTattach) return ((NinePMessage.MsgTattach)message).Item.Tag;
         if (message.IsMsgTwalk) return ((NinePMessage.MsgTwalk)message).Item.Tag;
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tattach_Unknown_Aname_Returns_Error

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:383:13
     {
         if (message.IsMsgTversion) return ((NinePMessage.MsgTversion)message).Item.Tag;
         if (message.IsMsgTauth) return ((NinePMessage.MsgTauth)message).Item.Tag;
-        if (message.IsMsgTattach) return ((NinePMessage.MsgTattach)message).Item.Tag;
+        if (!(message.IsMsgTattach)) return ((NinePMessage.MsgTattach)message).Item.Tag;
         if (message.IsMsgTwalk) return ((NinePMessage.MsgTwalk)message).Item.Tag;
         if (message.IsMsgTopen) return ((NinePMessage.MsgTopen)message).Item.Tag;
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.AuthPassThroughDispatcherTests.Twrite_To_AuthFid_Returns_Rwrite_With_Full_Count

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:384:13
         if (message.IsMsgTversion) return ((NinePMessage.MsgTversion)message).Item.Tag;
         if (message.IsMsgTauth) return ((NinePMessage.MsgTauth)message).Item.Tag;
         if (message.IsMsgTattach) return ((NinePMessage.MsgTattach)message).Item.Tag;
-        if (message.IsMsgTwalk) return ((NinePMessage.MsgTwalk)message).Item.Tag;
+        if (!(message.IsMsgTwalk)) return ((NinePMessage.MsgTwalk)message).Item.Tag;
         if (message.IsMsgTopen) return ((NinePMessage.MsgTopen)message).Item.Tag;
         if (message.IsMsgTread) return ((NinePMessage.MsgTread)message).Item.Tag;
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.AuthPassThroughDispatcherTests.Twrite_To_AuthFid_Returns_Rwrite_With_Full_Count

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:385:13
         if (message.IsMsgTauth) return ((NinePMessage.MsgTauth)message).Item.Tag;
         if (message.IsMsgTattach) return ((NinePMessage.MsgTattach)message).Item.Tag;
         if (message.IsMsgTwalk) return ((NinePMessage.MsgTwalk)message).Item.Tag;
-        if (message.IsMsgTopen) return ((NinePMessage.MsgTopen)message).Item.Tag;
+        if (!(message.IsMsgTopen)) return ((NinePMessage.MsgTopen)message).Item.Tag;
         if (message.IsMsgTread) return ((NinePMessage.MsgTread)message).Item.Tag;
         if (message.IsMsgTwrite) return ((NinePMessage.MsgTwrite)message).Item.Tag;
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.AuthPassThroughDispatcherTests.Twrite_To_AuthFid_Returns_Rwrite_With_Full_Count

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:386:13
         if (message.IsMsgTattach) return ((NinePMessage.MsgTattach)message).Item.Tag;
         if (message.IsMsgTwalk) return ((NinePMessage.MsgTwalk)message).Item.Tag;
         if (message.IsMsgTopen) return ((NinePMessage.MsgTopen)message).Item.Tag;
-        if (message.IsMsgTread) return ((NinePMessage.MsgTread)message).Item.Tag;
+        if (!(message.IsMsgTread)) return ((NinePMessage.MsgTread)message).Item.Tag;
         if (message.IsMsgTwrite) return ((NinePMessage.MsgTwrite)message).Item.Tag;
         if (message.IsMsgTclunk) return ((NinePMessage.MsgTclunk)message).Item.Tag;
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tauth_With_DifferentAfids_Creates_Separate_Buffers; NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.AuthPassThroughDispatcherTests.Twrite_To_AuthFid_Returns_Rwrite_With_Full_Count

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:387:13
         if (message.IsMsgTwalk) return ((NinePMessage.MsgTwalk)message).Item.Tag;
         if (message.IsMsgTopen) return ((NinePMessage.MsgTopen)message).Item.Tag;
         if (message.IsMsgTread) return ((NinePMessage.MsgTread)message).Item.Tag;
-        if (message.IsMsgTwrite) return ((NinePMessage.MsgTwrite)message).Item.Tag;
+        if (!(message.IsMsgTwrite)) return ((NinePMessage.MsgTwrite)message).Item.Tag;
         if (message.IsMsgTclunk) return ((NinePMessage.MsgTclunk)message).Item.Tag;
         if (message.IsMsgTstat) return ((NinePMessage.MsgTstat)message).Item.Tag;
killedBy: NinePSharp.Tests.AuthPassThroughDispatcherTests.Tclunk_AuthFid_Cleans_Up_Buffer; NinePSharp.Tests.SecurityAuditTests.Dispatcher_Handles_Fid_Flooding_Stress; NinePSharp.Tests.SecurityAuditTests.AuthFid_Flooding_Exhaustion_Test

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:388:13
         if (message.IsMsgTopen) return ((NinePMessage.MsgTopen)message).Item.Tag;
         if (message.IsMsgTread) return ((NinePMessage.MsgTread)message).Item.Tag;
         if (message.IsMsgTwrite) return ((NinePMessage.MsgTwrite)message).Item.Tag;
-        if (message.IsMsgTclunk) return ((NinePMessage.MsgTclunk)message).Item.Tag;
+        if (!(message.IsMsgTclunk)) return ((NinePMessage.MsgTclunk)message).Item.Tag;
         if (message.IsMsgTstat) return ((NinePMessage.MsgTstat)message).Item.Tag;
         if (message.IsMsgTgetattr) return ((NinePMessage.MsgTgetattr)message).Item.Tag;
killedBy: NinePSharp.Tests.SecurityAuditTests.Dispatcher_Handles_Fid_Flooding_Stress; NinePSharp.Tests.StateMachineChaosTests.Massive_FID_Usage_Does_Not_Crash

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:389:13
         if (message.IsMsgTread) return ((NinePMessage.MsgTread)message).Item.Tag;
         if (message.IsMsgTwrite) return ((NinePMessage.MsgTwrite)message).Item.Tag;
         if (message.IsMsgTclunk) return ((NinePMessage.MsgTclunk)message).Item.Tag;
-        if (message.IsMsgTstat) return ((NinePMessage.MsgTstat)message).Item.Tag;
+        if (!(message.IsMsgTstat)) return ((NinePMessage.MsgTstat)message).Item.Tag;
         if (message.IsMsgTgetattr) return ((NinePMessage.MsgTgetattr)message).Item.Tag;
         if (message.IsMsgTsetattr) return ((NinePMessage.MsgTsetattr)message).Item.Tag;
killedBy: NinePSharp.Tests.StateViolationTests.Remove_Also_Clunks_FID; NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:390:13
         if (message.IsMsgTwrite) return ((NinePMessage.MsgTwrite)message).Item.Tag;
         if (message.IsMsgTclunk) return ((NinePMessage.MsgTclunk)message).Item.Tag;
         if (message.IsMsgTstat) return ((NinePMessage.MsgTstat)message).Item.Tag;
-        if (message.IsMsgTgetattr) return ((NinePMessage.MsgTgetattr)message).Item.Tag;
+        if (!(message.IsMsgTgetattr)) return ((NinePMessage.MsgTgetattr)message).Item.Tag;
         if (message.IsMsgTsetattr) return ((NinePMessage.MsgTsetattr)message).Item.Tag;
         if (message.IsMsgTcreate) return ((NinePMessage.MsgTcreate)message).Item.Tag;
killedBy: NinePSharp.Tests.StateViolationTests.Remove_Also_Clunks_FID; NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:391:13
         if (message.IsMsgTclunk) return ((NinePMessage.MsgTclunk)message).Item.Tag;
         if (message.IsMsgTstat) return ((NinePMessage.MsgTstat)message).Item.Tag;
         if (message.IsMsgTgetattr) return ((NinePMessage.MsgTgetattr)message).Item.Tag;
-        if (message.IsMsgTsetattr) return ((NinePMessage.MsgTsetattr)message).Item.Tag;
+        if (!(message.IsMsgTsetattr)) return ((NinePMessage.MsgTsetattr)message).Item.Tag;
         if (message.IsMsgTcreate) return ((NinePMessage.MsgTcreate)message).Item.Tag;
         if (message.IsMsgTwstat) return ((NinePMessage.MsgTwstat)message).Item.Tag;
killedBy: NinePSharp.Tests.StateViolationTests.Remove_Also_Clunks_FID; NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:392:13
         if (message.IsMsgTstat) return ((NinePMessage.MsgTstat)message).Item.Tag;
         if (message.IsMsgTgetattr) return ((NinePMessage.MsgTgetattr)message).Item.Tag;
         if (message.IsMsgTsetattr) return ((NinePMessage.MsgTsetattr)message).Item.Tag;
-        if (message.IsMsgTcreate) return ((NinePMessage.MsgTcreate)message).Item.Tag;
+        if (!(message.IsMsgTcreate)) return ((NinePMessage.MsgTcreate)message).Item.Tag;
         if (message.IsMsgTwstat) return ((NinePMessage.MsgTwstat)message).Item.Tag;
         if (message.IsMsgTremove) return ((NinePMessage.MsgTremove)message).Item.Tag;
killedBy: NinePSharp.Tests.StateViolationTests.Remove_Also_Clunks_FID; NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:393:13
         if (message.IsMsgTgetattr) return ((NinePMessage.MsgTgetattr)message).Item.Tag;
         if (message.IsMsgTsetattr) return ((NinePMessage.MsgTsetattr)message).Item.Tag;
         if (message.IsMsgTcreate) return ((NinePMessage.MsgTcreate)message).Item.Tag;
-        if (message.IsMsgTwstat) return ((NinePMessage.MsgTwstat)message).Item.Tag;
+        if (!(message.IsMsgTwstat)) return ((NinePMessage.MsgTwstat)message).Item.Tag;
         if (message.IsMsgTremove) return ((NinePMessage.MsgTremove)message).Item.Tag;
         if (message.IsMsgTstatfs) return ((NinePMessage.MsgTstatfs)message).Item.Tag;
killedBy: NinePSharp.Tests.StateViolationTests.Remove_Also_Clunks_FID; NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:394:13
         if (message.IsMsgTsetattr) return ((NinePMessage.MsgTsetattr)message).Item.Tag;
         if (message.IsMsgTcreate) return ((NinePMessage.MsgTcreate)message).Item.Tag;
         if (message.IsMsgTwstat) return ((NinePMessage.MsgTwstat)message).Item.Tag;
-        if (message.IsMsgTremove) return ((NinePMessage.MsgTremove)message).Item.Tag;
+        if (!(message.IsMsgTremove)) return ((NinePMessage.MsgTremove)message).Item.Tag;
         if (message.IsMsgTstatfs) return ((NinePMessage.MsgTstatfs)message).Item.Tag;
         if (message.IsMsgTlopen) return ((NinePMessage.MsgTlopen)message).Item.Tag;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:395:13
         if (message.IsMsgTcreate) return ((NinePMessage.MsgTcreate)message).Item.Tag;
         if (message.IsMsgTwstat) return ((NinePMessage.MsgTwstat)message).Item.Tag;
         if (message.IsMsgTremove) return ((NinePMessage.MsgTremove)message).Item.Tag;
-        if (message.IsMsgTstatfs) return ((NinePMessage.MsgTstatfs)message).Item.Tag;
+        if (!(message.IsMsgTstatfs)) return ((NinePMessage.MsgTstatfs)message).Item.Tag;
         if (message.IsMsgTlopen) return ((NinePMessage.MsgTlopen)message).Item.Tag;
         if (message.IsMsgTlcreate) return ((NinePMessage.MsgTlcreate)message).Item.Tag;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:396:13
         if (message.IsMsgTwstat) return ((NinePMessage.MsgTwstat)message).Item.Tag;
         if (message.IsMsgTremove) return ((NinePMessage.MsgTremove)message).Item.Tag;
         if (message.IsMsgTstatfs) return ((NinePMessage.MsgTstatfs)message).Item.Tag;
-        if (message.IsMsgTlopen) return ((NinePMessage.MsgTlopen)message).Item.Tag;
+        if (!(message.IsMsgTlopen)) return ((NinePMessage.MsgTlopen)message).Item.Tag;
         if (message.IsMsgTlcreate) return ((NinePMessage.MsgTlcreate)message).Item.Tag;
         if (message.IsMsgTsymlink) return ((NinePMessage.MsgTsymlink)message).Item.Tag;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:397:13
         if (message.IsMsgTremove) return ((NinePMessage.MsgTremove)message).Item.Tag;
         if (message.IsMsgTstatfs) return ((NinePMessage.MsgTstatfs)message).Item.Tag;
         if (message.IsMsgTlopen) return ((NinePMessage.MsgTlopen)message).Item.Tag;
-        if (message.IsMsgTlcreate) return ((NinePMessage.MsgTlcreate)message).Item.Tag;
+        if (!(message.IsMsgTlcreate)) return ((NinePMessage.MsgTlcreate)message).Item.Tag;
         if (message.IsMsgTsymlink) return ((NinePMessage.MsgTsymlink)message).Item.Tag;
         if (message.IsMsgTmknod) return ((NinePMessage.MsgTmknod)message).Item.Tag;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:398:13
         if (message.IsMsgTstatfs) return ((NinePMessage.MsgTstatfs)message).Item.Tag;
         if (message.IsMsgTlopen) return ((NinePMessage.MsgTlopen)message).Item.Tag;
         if (message.IsMsgTlcreate) return ((NinePMessage.MsgTlcreate)message).Item.Tag;
-        if (message.IsMsgTsymlink) return ((NinePMessage.MsgTsymlink)message).Item.Tag;
+        if (!(message.IsMsgTsymlink)) return ((NinePMessage.MsgTsymlink)message).Item.Tag;
         if (message.IsMsgTmknod) return ((NinePMessage.MsgTmknod)message).Item.Tag;
         if (message.IsMsgTrename) return ((NinePMessage.MsgTrename)message).Item.Tag;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:399:13
         if (message.IsMsgTlopen) return ((NinePMessage.MsgTlopen)message).Item.Tag;
         if (message.IsMsgTlcreate) return ((NinePMessage.MsgTlcreate)message).Item.Tag;
         if (message.IsMsgTsymlink) return ((NinePMessage.MsgTsymlink)message).Item.Tag;
-        if (message.IsMsgTmknod) return ((NinePMessage.MsgTmknod)message).Item.Tag;
+        if (!(message.IsMsgTmknod)) return ((NinePMessage.MsgTmknod)message).Item.Tag;
         if (message.IsMsgTrename) return ((NinePMessage.MsgTrename)message).Item.Tag;
         if (message.IsMsgTreadlink) return ((NinePMessage.MsgTreadlink)message).Item.Tag;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:400:13
         if (message.IsMsgTlcreate) return ((NinePMessage.MsgTlcreate)message).Item.Tag;
         if (message.IsMsgTsymlink) return ((NinePMessage.MsgTsymlink)message).Item.Tag;
         if (message.IsMsgTmknod) return ((NinePMessage.MsgTmknod)message).Item.Tag;
-        if (message.IsMsgTrename) return ((NinePMessage.MsgTrename)message).Item.Tag;
+        if (!(message.IsMsgTrename)) return ((NinePMessage.MsgTrename)message).Item.Tag;
         if (message.IsMsgTreadlink) return ((NinePMessage.MsgTreadlink)message).Item.Tag;
         if (message.IsMsgTxattrwalk) return ((NinePMessage.MsgTxattrwalk)message).Item.Tag;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:401:13
         if (message.IsMsgTsymlink) return ((NinePMessage.MsgTsymlink)message).Item.Tag;
         if (message.IsMsgTmknod) return ((NinePMessage.MsgTmknod)message).Item.Tag;
         if (message.IsMsgTrename) return ((NinePMessage.MsgTrename)message).Item.Tag;
-        if (message.IsMsgTreadlink) return ((NinePMessage.MsgTreadlink)message).Item.Tag;
+        if (!(message.IsMsgTreadlink)) return ((NinePMessage.MsgTreadlink)message).Item.Tag;
         if (message.IsMsgTxattrwalk) return ((NinePMessage.MsgTxattrwalk)message).Item.Tag;
         if (message.IsMsgTxattrcreate) return ((NinePMessage.MsgTxattrcreate)message).Item.Tag;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:402:13
         if (message.IsMsgTmknod) return ((NinePMessage.MsgTmknod)message).Item.Tag;
         if (message.IsMsgTrename) return ((NinePMessage.MsgTrename)message).Item.Tag;
         if (message.IsMsgTreadlink) return ((NinePMessage.MsgTreadlink)message).Item.Tag;
-        if (message.IsMsgTxattrwalk) return ((NinePMessage.MsgTxattrwalk)message).Item.Tag;
+        if (!(message.IsMsgTxattrwalk)) return ((NinePMessage.MsgTxattrwalk)message).Item.Tag;
         if (message.IsMsgTxattrcreate) return ((NinePMessage.MsgTxattrcreate)message).Item.Tag;
         if (message.IsMsgTreaddir) return ((NinePMessage.MsgTreaddir)message).Item.Tag;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:403:13
         if (message.IsMsgTrename) return ((NinePMessage.MsgTrename)message).Item.Tag;
         if (message.IsMsgTreadlink) return ((NinePMessage.MsgTreadlink)message).Item.Tag;
         if (message.IsMsgTxattrwalk) return ((NinePMessage.MsgTxattrwalk)message).Item.Tag;
-        if (message.IsMsgTxattrcreate) return ((NinePMessage.MsgTxattrcreate)message).Item.Tag;
+        if (!(message.IsMsgTxattrcreate)) return ((NinePMessage.MsgTxattrcreate)message).Item.Tag;
         if (message.IsMsgTreaddir) return ((NinePMessage.MsgTreaddir)message).Item.Tag;
         if (message.IsMsgTfsync) return ((NinePMessage.MsgTfsync)message).Item.Tag;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:404:13
         if (message.IsMsgTreadlink) return ((NinePMessage.MsgTreadlink)message).Item.Tag;
         if (message.IsMsgTxattrwalk) return ((NinePMessage.MsgTxattrwalk)message).Item.Tag;
         if (message.IsMsgTxattrcreate) return ((NinePMessage.MsgTxattrcreate)message).Item.Tag;
-        if (message.IsMsgTreaddir) return ((NinePMessage.MsgTreaddir)message).Item.Tag;
+        if (!(message.IsMsgTreaddir)) return ((NinePMessage.MsgTreaddir)message).Item.Tag;
         if (message.IsMsgTfsync) return ((NinePMessage.MsgTfsync)message).Item.Tag;
         if (message.IsMsgTlock) return ((NinePMessage.MsgTlock)message).Item.Tag;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush
