[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:405:13
         if (message.IsMsgTxattrwalk) return ((NinePMessage.MsgTxattrwalk)message).Item.Tag;
         if (message.IsMsgTxattrcreate) return ((NinePMessage.MsgTxattrcreate)message).Item.Tag;
         if (message.IsMsgTreaddir) return ((NinePMessage.MsgTreaddir)message).Item.Tag;
-        if (message.IsMsgTfsync) return ((NinePMessage.MsgTfsync)message).Item.Tag;
+        if (!(message.IsMsgTfsync)) return ((NinePMessage.MsgTfsync)message).Item.Tag;
         if (message.IsMsgTlock) return ((NinePMessage.MsgTlock)message).Item.Tag;
         if (message.IsMsgTgetlock) return ((NinePMessage.MsgTgetlock)message).Item.Tag;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:406:13
         if (message.IsMsgTxattrcreate) return ((NinePMessage.MsgTxattrcreate)message).Item.Tag;
         if (message.IsMsgTreaddir) return ((NinePMessage.MsgTreaddir)message).Item.Tag;
         if (message.IsMsgTfsync) return ((NinePMessage.MsgTfsync)message).Item.Tag;
-        if (message.IsMsgTlock) return ((NinePMessage.MsgTlock)message).Item.Tag;
+        if (!(message.IsMsgTlock)) return ((NinePMessage.MsgTlock)message).Item.Tag;
         if (message.IsMsgTgetlock) return ((NinePMessage.MsgTgetlock)message).Item.Tag;
         if (message.IsMsgTlink) return ((NinePMessage.MsgTlink)message).Item.Tag;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:407:13
         if (message.IsMsgTreaddir) return ((NinePMessage.MsgTreaddir)message).Item.Tag;
         if (message.IsMsgTfsync) return ((NinePMessage.MsgTfsync)message).Item.Tag;
         if (message.IsMsgTlock) return ((NinePMessage.MsgTlock)message).Item.Tag;
-        if (message.IsMsgTgetlock) return ((NinePMessage.MsgTgetlock)message).Item.Tag;
+        if (!(message.IsMsgTgetlock)) return ((NinePMessage.MsgTgetlock)message).Item.Tag;
         if (message.IsMsgTlink) return ((NinePMessage.MsgTlink)message).Item.Tag;
         if (message.IsMsgTmkdir) return ((NinePMessage.MsgTmkdir)message).Item.Tag;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:408:13
         if (message.IsMsgTfsync) return ((NinePMessage.MsgTfsync)message).Item.Tag;
         if (message.IsMsgTlock) return ((NinePMessage.MsgTlock)message).Item.Tag;
         if (message.IsMsgTgetlock) return ((NinePMessage.MsgTgetlock)message).Item.Tag;
-        if (message.IsMsgTlink) return ((NinePMessage.MsgTlink)message).Item.Tag;
+        if (!(message.IsMsgTlink)) return ((NinePMessage.MsgTlink)message).Item.Tag;
         if (message.IsMsgTmkdir) return ((NinePMessage.MsgTmkdir)message).Item.Tag;
         if (message.IsMsgTrenameat) return ((NinePMessage.MsgTrenameat)message).Item.Tag;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:409:13
         if (message.IsMsgTlock) return ((NinePMessage.MsgTlock)message).Item.Tag;
         if (message.IsMsgTgetlock) return ((NinePMessage.MsgTgetlock)message).Item.Tag;
         if (message.IsMsgTlink) return ((NinePMessage.MsgTlink)message).Item.Tag;
-        if (message.IsMsgTmkdir) return ((NinePMessage.MsgTmkdir)message).Item.Tag;
+        if (!(message.IsMsgTmkdir)) return ((NinePMessage.MsgTmkdir)message).Item.Tag;
         if (message.IsMsgTrenameat) return ((NinePMessage.MsgTrenameat)message).Item.Tag;
         if (message.IsMsgTunlinkat) return ((NinePMessage.MsgTunlinkat)message).Item.Tag;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:410:13
         if (message.IsMsgTgetlock) return ((NinePMessage.MsgTgetlock)message).Item.Tag;
         if (message.IsMsgTlink) return ((NinePMessage.MsgTlink)message).Item.Tag;
         if (message.IsMsgTmkdir) return ((NinePMessage.MsgTmkdir)message).Item.Tag;
-        if (message.IsMsgTrenameat) return ((NinePMessage.MsgTrenameat)message).Item.Tag;
+        if (!(message.IsMsgTrenameat)) return ((NinePMessage.MsgTrenameat)message).Item.Tag;
         if (message.IsMsgTunlinkat) return ((NinePMessage.MsgTunlinkat)message).Item.Tag;
         if (message.IsMsgTflush) return ((NinePMessage.MsgTflush)message).Item.Tag;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:411:13
         if (message.IsMsgTlink) return ((NinePMessage.MsgTlink)message).Item.Tag;
         if (message.IsMsgTmkdir) return ((NinePMessage.MsgTmkdir)message).Item.Tag;
         if (message.IsMsgTrenameat) return ((NinePMessage.MsgTrenameat)message).Item.Tag;
-        if (message.IsMsgTunlinkat) return ((NinePMessage.MsgTunlinkat)message).Item.Tag;
+        if (!(message.IsMsgTunlinkat)) return ((NinePMessage.MsgTunlinkat)message).Item.Tag;
         if (message.IsMsgTflush) return ((NinePMessage.MsgTflush)message).Item.Tag;
         return 0;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.DispatchAsync_Tflush_Returns_Rflush

[Survived] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/NinePFSDispatcher.cs:412:13
         if (message.IsMsgTmkdir) return ((NinePMessage.MsgTmkdir)message).Item.Tag;
         if (message.IsMsgTrenameat) return ((NinePMessage.MsgTrenameat)message).Item.Tag;
         if (message.IsMsgTunlinkat) return ((NinePMessage.MsgTunlinkat)message).Item.Tag;
-        if (message.IsMsgTflush) return ((NinePMessage.MsgTflush)message).Item.Tag;
+        if (!(message.IsMsgTflush)) return ((NinePMessage.MsgTflush)message).Item.Tag;
         return 0;
     }
