[Killed] Block removal mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:28:5
     public bool DotU { get; set; }
 
     public RootFileSystem(List<IProtocolBackend> backends, IClusterManager? clusterManager = null)
-    {
-        _backends = backends;
-        _clusterManager = clusterManager;
-    }
+    {}
 
     public async Task<Rwalk> WalkAsync(Twalk twalk)
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession; NinePSharp.Tests.ClusterFederationTests.RootListing_Includes_ClusterRegisteredMounts

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:36:13
     public async Task<Rwalk> WalkAsync(Twalk twalk)
     {
         // If we are already delegating, pass the walk to the backend
-        if (_delegatedFs != null) return await _delegatedFs.WalkAsync(twalk);
+        if (_delegatedFs == null) return await _delegatedFs.WalkAsync(twalk);
 
         if (twalk.Wname.Length == 0) return new Rwalk(twalk.Tag, Array.Empty<Qid>());
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession; NinePSharp.Tests.NinePFSDispatcherTests.RootFileSystem_ReaddirAsync_Delegates_When_Entered_Backend

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:38:13
         // If we are already delegating, pass the walk to the backend
         if (_delegatedFs != null) return await _delegatedFs.WalkAsync(twalk);
 
-        if (twalk.Wname.Length == 0) return new Rwalk(twalk.Tag, Array.Empty<Qid>());
+        if (twalk.Wname.Length != 0) return new Rwalk(twalk.Tag, Array.Empty<Qid>());
 
         // Try to find a backend that matches the first element of the walk
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession; NinePSharp.Tests.NinePFSDispatcherTests.RootFileSystem_ReaddirAsync_Delegates_When_Entered_Backend

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:42:53
 
         // Try to find a backend that matches the first element of the walk
         var name = twalk.Wname[0];
-        var backend = _backends.FirstOrDefault(b => b.MountPath.Trim('/') == name);
+        var backend = _backends.FirstOrDefault(b => b.MountPath.Trim('/') != name);
 
         if (backend == null && _clusterManager?.Registry != null)
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.RootFileSystem_ReaddirAsync_Delegates_When_Entered_Backend; NinePSharp.Tests.NinePFSDispatcherTests.RootFileSystem_Walk_From_Root_To_MockBackend; NinePSharp.Tests.NinePFSDispatcherTests.RootFileSystem_StatfsAsync_Delegates_When_Entered_Backend

[Killed] Linq method mutation (FirstOrDefault() to First())
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:42:23
 
         // Try to find a backend that matches the first element of the walk
         var name = twalk.Wname[0];
-        var backend = _backends.FirstOrDefault(b => b.MountPath.Trim('/') == name);
+        var backend = _backends.First(b => b.MountPath.Trim('/') == name);
 
         if (backend == null && _clusterManager?.Registry != null)
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:44:13
         var name = twalk.Wname[0];
         var backend = _backends.FirstOrDefault(b => b.MountPath.Trim('/') == name);
 
-        if (backend == null && _clusterManager?.Registry != null)
+        if (!(backend == null && _clusterManager?.Registry != null))
         {
             var mountPath = "/" + name;
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession; NinePSharp.Tests.NinePFSDispatcherTests.RootFileSystem_ReaddirAsync_Delegates_When_Entered_Backend

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:44:32
         var name = twalk.Wname[0];
         var backend = _backends.FirstOrDefault(b => b.MountPath.Trim('/') == name);
 
-        if (backend == null && _clusterManager?.Registry != null)
+        if (backend == null && _clusterManager?.Registry == null)
         {
             var mountPath = "/" + name;
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:58:25
                     var qid = new Qid(QidType.QTDIR, 0, (ulong)name.GetHashCode());
                     var qids = new List<Qid> { qid };
 
-                    if (twalk.Wname.Length > 1)
+                    if (twalk.Wname.Length < 1)
                     {
                         var subWalk = new Twalk(twalk.Tag, twalk.Fid, twalk.NewFid, twalk.Wname.Skip(1).ToArray());
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:58:25
                     var qid = new Qid(QidType.QTDIR, 0, (ulong)name.GetHashCode());
                     var qids = new List<Qid> { qid };
 
-                    if (twalk.Wname.Length > 1)
+                    if (!(twalk.Wname.Length > 1))
                     {
                         var subWalk = new Twalk(twalk.Tag, twalk.Fid, twalk.NewFid, twalk.Wname.Skip(1).ToArray());
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession

[Survived] Linq method mutation (Skip() to Take())
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:60:85
 
                     if (twalk.Wname.Length > 1)
                     {
-                        var subWalk = new Twalk(twalk.Tag, twalk.Fid, twalk.NewFid, twalk.Wname.Skip(1).ToArray());
+                        var subWalk = new Twalk(twalk.Tag, twalk.Fid, twalk.NewFid, twalk.Wname.Take(1).ToArray());
                         var subResponse = await _delegatedFs.WalkAsync(subWalk);
                         if (subResponse.Wqid != null)

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:62:29
                     {
                         var subWalk = new Twalk(twalk.Tag, twalk.Fid, twalk.NewFid, twalk.Wname.Skip(1).ToArray());
                         var subResponse = await _delegatedFs.WalkAsync(subWalk);
-                        if (subResponse.Wqid != null)
+                        if (subResponse.Wqid == null)
                         {
                             qids.AddRange(subResponse.Wqid);
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession

[Killed] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:64:29
                         var subResponse = await _delegatedFs.WalkAsync(subWalk);
                         if (subResponse.Wqid != null)
                         {
-                            qids.AddRange(subResponse.Wqid);
+                            ;
                         }
                     }
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:73:13
             }
         }
 
-        if (backend != null)
+        if (backend == null)
         {
             // Enter the backend
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.RootFileSystem_ReaddirAsync_Delegates_When_Entered_Backend; NinePSharp.Tests.NinePFSDispatcherTests.RootFileSystem_Walk_From_Root_To_MockBackend; NinePSharp.Tests.NinePFSDispatcherTests.RootFileSystem_StatfsAsync_Delegates_When_Entered_Backend

[Survived] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:82:17
             var qid = new Qid(QidType.QTDIR, 0, (ulong)name.GetHashCode());
             var qids = new List<Qid> { qid };
 
-            if (twalk.Wname.Length > 1)
+            if (twalk.Wname.Length >= 1)
             {
                 // We have more steps! 

[NoCoverage] Linq method mutation (Skip() to Take())
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:88:77
                 // We must create a TWALK that starts from the backend root.
                 // NOTE: the FID in twalk is the root fid, but the sub-walk
                 // is conceptually walking relative to the new delegated FS.
-                var subWalk = new Twalk(twalk.Tag, twalk.Fid, twalk.NewFid, twalk.Wname.Skip(1).ToArray());
+                var subWalk = new Twalk(twalk.Tag, twalk.Fid, twalk.NewFid, twalk.Wname.Take(1).ToArray());
                 var subResponse = await _delegatedFs.WalkAsync(subWalk);
                 

[NoCoverage] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:91:21
                 var subWalk = new Twalk(twalk.Tag, twalk.Fid, twalk.NewFid, twalk.Wname.Skip(1).ToArray());
                 var subResponse = await _delegatedFs.WalkAsync(subWalk);
                 
-                if (subResponse.Wqid != null)
+                if (subResponse.Wqid == null)
                 {
                     qids.AddRange(subResponse.Wqid);

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:105:13
 
     public async Task<Rread> ReadAsync(Tread tread)
     {
-        if (_delegatedFs != null) return await _delegatedFs.ReadAsync(tread);
+        if (_delegatedFs == null) return await _delegatedFs.ReadAsync(tread);
 
         var mountNames = new HashSet<string>(StringComparer.Ordinal);
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession; NinePSharp.Tests.ClusterFederationTests.RootListing_Includes_ClusterRegisteredMounts

[NoCoverage] String Method Mutation (Replace Trim() with Empty String)
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:111:24
 
         foreach (var backend in _backends)
         {
-            var name = backend.MountPath.Trim('/');
+            var name = "";
             if (string.IsNullOrEmpty(name)) continue;
             mountNames.Add(name);

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:112:45
         foreach (var backend in _backends)
         {
             var name = backend.MountPath.Trim('/');
-            if (string.IsNullOrEmpty(name)) continue;
+            if (string.IsNullOrEmpty(name)) ;
             mountNames.Add(name);
         }

[NoCoverage] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:112:17
         foreach (var backend in _backends)
         {
             var name = backend.MountPath.Trim('/');
-            if (string.IsNullOrEmpty(name)) continue;
+            if (!(string.IsNullOrEmpty(name))) continue;
             mountNames.Add(name);
         }

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:113:13
         {
             var name = backend.MountPath.Trim('/');
             if (string.IsNullOrEmpty(name)) continue;
-            mountNames.Add(name);
+            ;
         }
 

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:116:13
             mountNames.Add(name);
         }
 
-        if (_clusterManager?.Registry != null)
+        if (_clusterManager?.Registry == null)
         {
             try
killedBy: NinePSharp.Tests.ClusterFederationTests.RootListing_Includes_ClusterRegisteredMounts

[Killed] String Method Mutation (Replace Trim() with Empty String)
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:125:36
                 {
                     foreach (var mountPath in snapshot.MountPaths)
                     {
-                        var name = mountPath.Trim('/');
+                        var name = "";
                         if (string.IsNullOrEmpty(name)) continue;
                         mountNames.Add(name);
killedBy: NinePSharp.Tests.ClusterFederationTests.RootListing_Includes_ClusterRegisteredMounts

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:126:29
                     foreach (var mountPath in snapshot.MountPaths)
                     {
                         var name = mountPath.Trim('/');
-                        if (string.IsNullOrEmpty(name)) continue;
+                        if (!(string.IsNullOrEmpty(name))) continue;
                         mountNames.Add(name);
                     }
killedBy: NinePSharp.Tests.ClusterFederationTests.RootListing_Includes_ClusterRegisteredMounts

[NoCoverage] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:126:57
                     foreach (var mountPath in snapshot.MountPaths)
                     {
                         var name = mountPath.Trim('/');
-                        if (string.IsNullOrEmpty(name)) continue;
+                        if (string.IsNullOrEmpty(name)) ;
                         mountNames.Add(name);
                     }

[Survived] Linq method mutation (OrderBy() to OrderByDescending())
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:138:30
         }
 
         var entries = new List<byte>();
-        foreach (var name in mountNames.OrderBy(n => n, StringComparer.Ordinal))
+        foreach (var name in mountNames.OrderByDescending(n => n, StringComparer.Ordinal))
         {
             var stat = new Stat(0, 0, 0, new Qid(QidType.QTDIR, 0, (ulong)name.GetHashCode()), 0755 | (uint)NinePConstants.FileMode9P.DMDIR, 0, 0, 0, name, "scott", "scott", "scott", dotu: DotU);

[Survived] Bitwise mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:140:96
         var entries = new List<byte>();
         foreach (var name in mountNames.OrderBy(n => n, StringComparer.Ordinal))
         {
-            var stat = new Stat(0, 0, 0, new Qid(QidType.QTDIR, 0, (ulong)name.GetHashCode()), 0755 | (uint)NinePConstants.FileMode9P.DMDIR, 0, 0, 0, name, "scott", "scott", "scott", dotu: DotU);
+            var stat = new Stat(0, 0, 0, new Qid(QidType.QTDIR, 0, (ulong)name.GetHashCode()), 0755 & (uint)NinePConstants.FileMode9P.DMDIR, 0, 0, 0, name, "scott", "scott", "scott", dotu: DotU);
 
             var entryBuffer = new byte[stat.Size];

[Killed] Arithmetic mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:155:29
         int currentOffset = (int)tread.Offset;
         while (currentOffset + 2 <= allData.Length)
         {
-            int entrySize = BinaryPrimitives.ReadUInt16LittleEndian(allData.AsSpan(currentOffset, 2)) + 2;
+            int entrySize = BinaryPrimitives.ReadUInt16LittleEndian(allData.AsSpan(currentOffset, 2)) - 2;
             if (entrySize <= 0 || currentOffset + entrySize > allData.Length) break;
             if (totalToSend + entrySize > tread.Count) break;
killedBy: NinePSharp.Tests.ClusterFederationTests.RootListing_Includes_ClusterRegisteredMounts

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:156:17
         while (currentOffset + 2 <= allData.Length)
         {
             int entrySize = BinaryPrimitives.ReadUInt16LittleEndian(allData.AsSpan(currentOffset, 2)) + 2;
-            if (entrySize <= 0 || currentOffset + entrySize > allData.Length) break;
+            if (entrySize > 0 || currentOffset + entrySize > allData.Length) break;
             if (totalToSend + entrySize > tread.Count) break;
             totalToSend += entrySize;
killedBy: NinePSharp.Tests.ClusterFederationTests.RootListing_Includes_ClusterRegisteredMounts

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:156:35
         while (currentOffset + 2 <= allData.Length)
         {
             int entrySize = BinaryPrimitives.ReadUInt16LittleEndian(allData.AsSpan(currentOffset, 2)) + 2;
-            if (entrySize <= 0 || currentOffset + entrySize > allData.Length) break;
+            if (entrySize <= 0 || currentOffset + entrySize >= allData.Length) break;
             if (totalToSend + entrySize > tread.Count) break;
             totalToSend += entrySize;
killedBy: NinePSharp.Tests.ClusterFederationTests.RootListing_Includes_ClusterRegisteredMounts

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:157:17
         {
             int entrySize = BinaryPrimitives.ReadUInt16LittleEndian(allData.AsSpan(currentOffset, 2)) + 2;
             if (entrySize <= 0 || currentOffset + entrySize > allData.Length) break;
-            if (totalToSend + entrySize > tread.Count) break;
+            if (totalToSend + entrySize < tread.Count) break;
             totalToSend += entrySize;
             currentOffset += entrySize;
killedBy: NinePSharp.Tests.ClusterFederationTests.RootListing_Includes_ClusterRegisteredMounts

[Killed] Negate expression
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:157:17
         {
             int entrySize = BinaryPrimitives.ReadUInt16LittleEndian(allData.AsSpan(currentOffset, 2)) + 2;
             if (entrySize <= 0 || currentOffset + entrySize > allData.Length) break;
-            if (totalToSend + entrySize > tread.Count) break;
+            if (!(totalToSend + entrySize > tread.Count)) break;
             totalToSend += entrySize;
             currentOffset += entrySize;
killedBy: NinePSharp.Tests.ClusterFederationTests.RootListing_Includes_ClusterRegisteredMounts

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:162:13
             currentOffset += entrySize;
         }
 
-        if (totalToSend == 0) return new Rread(tread.Tag, Array.Empty<byte>());
+        if (totalToSend != 0) return new Rread(tread.Tag, Array.Empty<byte>());
         return new Rread(tread.Tag, allData.AsMemory((int)tread.Offset, totalToSend).ToArray());
     }
killedBy: NinePSharp.Tests.ClusterFederationTests.RootListing_Includes_ClusterRegisteredMounts

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:168:13
 
     public async Task<Rstat> StatAsync(Tstat tstat)
     {
-        if (_delegatedFs != null) return await _delegatedFs.StatAsync(tstat);
+        if (_delegatedFs == null) return await _delegatedFs.StatAsync(tstat);
         var stat = new Stat(0, 0, 0, new Qid(QidType.QTDIR, 0, 0), 0755 | (uint)NinePConstants.FileMode9P.DMDIR, 0, 0, 0, "/", "scott", "scott", "scott", dotu: DotU);
         return new Rstat(tstat.Tag, stat);
killedBy: NinePSharp.Tests.SecurityAuditTests.Dispatcher_Handles_Fid_Flooding_Stress

[Survived] Bitwise mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:169:68
     public async Task<Rstat> StatAsync(Tstat tstat)
     {
         if (_delegatedFs != null) return await _delegatedFs.StatAsync(tstat);
-        var stat = new Stat(0, 0, 0, new Qid(QidType.QTDIR, 0, 0), 0755 | (uint)NinePConstants.FileMode9P.DMDIR, 0, 0, 0, "/", "scott", "scott", "scott", dotu: DotU);
+        var stat = new Stat(0, 0, 0, new Qid(QidType.QTDIR, 0, 0), 0755 & (uint)NinePConstants.FileMode9P.DMDIR, 0, 0, 0, "/", "scott", "scott", "scott", dotu: DotU);
         return new Rstat(tstat.Tag, stat);
     }

[Survived] Null coalescing mutation (remove left)
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:173:54
         return new Rstat(tstat.Tag, stat);
     }
 
-    public Task<Rclunk> ClunkAsync(Tclunk tclunk) => _delegatedFs?.ClunkAsync(tclunk) ?? Task.FromResult(new Rclunk(tclunk.Tag));
+    public Task<Rclunk> ClunkAsync(Tclunk tclunk) => Task.FromResult(new Rclunk(tclunk.Tag));
     
     public async Task<Ropen> OpenAsync(Topen topen)

[Survived] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:177:13
     
     public async Task<Ropen> OpenAsync(Topen topen)
     {
-        if (_delegatedFs != null) return await _delegatedFs.OpenAsync(topen);
+        if (_delegatedFs == null) return await _delegatedFs.OpenAsync(topen);
         return new Ropen(topen.Tag, new Qid(QidType.QTDIR, 0, 0), 0);
     }

[NoCoverage] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:187:13
 
     public Task<Rgetattr> GetAttrAsync(Tgetattr tgetattr)
     {
-        if (_delegatedFs != null) return _delegatedFs.GetAttrAsync(tgetattr);
+        if (_delegatedFs == null) return _delegatedFs.GetAttrAsync(tgetattr);
         
         var qid = new Qid(QidType.QTDIR, 0, 0);

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:198:13
 
     public Task<Rstatfs> StatfsAsync(Tstatfs tstatfs)
     {
-        if (_delegatedFs != null) return _delegatedFs.StatfsAsync(tstatfs);
+        if (_delegatedFs == null) return _delegatedFs.StatfsAsync(tstatfs);
         
         // Return dummy file system statistics for the root.
killedBy: NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_StatfsAsync_Returns_Consistent_Values; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_StatfsAsync_At_Root_With_Multiple_Backends

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:207:13
 
     public async Task<Rreaddir> ReaddirAsync(Treaddir treaddir)
     {
-        if (_delegatedFs != null) return await _delegatedFs.ReaddirAsync(treaddir);
+        if (_delegatedFs == null) return await _delegatedFs.ReaddirAsync(treaddir);
 
         var mountNames = new HashSet<string>(StringComparer.Ordinal);
killedBy: NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_ReaddirAsync_Respects_Count_Limit; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_With_Only_MockBackend; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_Clone_Preserves_Backends_List

[Killed] Linq method mutation (OrderBy() to OrderByDescending())
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:242:30
         var entries = new List<byte>();
         ulong currentCountOffset = 0;
 
-        foreach (var name in mountNames.OrderBy(n => n, StringComparer.Ordinal))
+        foreach (var name in mountNames.OrderByDescending(n => n, StringComparer.Ordinal))
         {
             currentCountOffset++;
killedBy: NinePSharp.Tests.NinePFSDispatcherTests.RootFileSystem_ReaddirAsync_Returns_Sorted_Backends

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:244:13
 
         foreach (var name in mountNames.OrderBy(n => n, StringComparer.Ordinal))
         {
-            currentCountOffset++;
+            ;
             // 9P2000.L Readdir returns [qid[13] offset[8] type[1] name[s]]
             var qid = new Qid(QidType.QTDIR, 0, (ulong)name.GetHashCode());

[Survived] PostIncrementExpression to PostDecrementExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:244:13
 
         foreach (var name in mountNames.OrderBy(n => n, StringComparer.Ordinal))
         {
-            currentCountOffset++;
+            currentCountOffset--;
             // 9P2000.L Readdir returns [qid[13] offset[8] type[1] name[s]]
             var qid = new Qid(QidType.QTDIR, 0, (ulong)name.GetHashCode());

[Killed] Arithmetic mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:250:29
             
             // Calculate size: qid(13) + offset(8) + type(1) + name string (2 + len)
             int nameLen = System.Text.Encoding.UTF8.GetByteCount(name);
-            int entrySize = 13 + 8 + 1 + 2 + nameLen;
+            int entrySize = 13 + 8 - 1 + 2 + nameLen;
             var entryBuffer = new byte[entrySize];
             
killedBy: NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_ReaddirAsync_Respects_Count_Limit; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_With_Only_MockBackend; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_Clone_Preserves_Backends_List

[Killed] Arithmetic mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:250:29
             
             // Calculate size: qid(13) + offset(8) + type(1) + name string (2 + len)
             int nameLen = System.Text.Encoding.UTF8.GetByteCount(name);
-            int entrySize = 13 + 8 + 1 + 2 + nameLen;
+            int entrySize = 13 + 8 + 1 + 2 - nameLen;
             var entryBuffer = new byte[entrySize];
             
killedBy: NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_ReaddirAsync_Respects_Count_Limit; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_With_Only_MockBackend; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_Clone_Preserves_Backends_List

[Killed] PostIncrementExpression to PostDecrementExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:255:25
             
             int writeOffset = 0;
             // Write Qid
-            entryBuffer[writeOffset++] = (byte)qid.Type;
+            entryBuffer[writeOffset--] = (byte)qid.Type;
             BinaryPrimitives.WriteUInt32LittleEndian(entryBuffer.AsSpan(writeOffset, 4), qid.Version); writeOffset += 4;
             BinaryPrimitives.WriteUInt64LittleEndian(entryBuffer.AsSpan(writeOffset, 8), qid.Path); writeOffset += 8;
killedBy: NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_ReaddirAsync_Respects_Count_Limit; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_With_Only_MockBackend; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_Clone_Preserves_Backends_List

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:256:104
             int writeOffset = 0;
             // Write Qid
             entryBuffer[writeOffset++] = (byte)qid.Type;
-            BinaryPrimitives.WriteUInt32LittleEndian(entryBuffer.AsSpan(writeOffset, 4), qid.Version); writeOffset += 4;
+            BinaryPrimitives.WriteUInt32LittleEndian(entryBuffer.AsSpan(writeOffset, 4), qid.Version); writeOffset -= 4;
             BinaryPrimitives.WriteUInt64LittleEndian(entryBuffer.AsSpan(writeOffset, 8), qid.Path); writeOffset += 8;
             
killedBy: NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_ReaddirAsync_Respects_Count_Limit; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_With_Only_MockBackend; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_Clone_Preserves_Backends_List

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:256:13
             int writeOffset = 0;
             // Write Qid
             entryBuffer[writeOffset++] = (byte)qid.Type;
-            BinaryPrimitives.WriteUInt32LittleEndian(entryBuffer.AsSpan(writeOffset, 4), qid.Version); writeOffset += 4;
+            ; writeOffset += 4;
             BinaryPrimitives.WriteUInt64LittleEndian(entryBuffer.AsSpan(writeOffset, 8), qid.Path); writeOffset += 8;
             

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:257:101
             // Write Qid
             entryBuffer[writeOffset++] = (byte)qid.Type;
             BinaryPrimitives.WriteUInt32LittleEndian(entryBuffer.AsSpan(writeOffset, 4), qid.Version); writeOffset += 4;
-            BinaryPrimitives.WriteUInt64LittleEndian(entryBuffer.AsSpan(writeOffset, 8), qid.Path); writeOffset += 8;
+            BinaryPrimitives.WriteUInt64LittleEndian(entryBuffer.AsSpan(writeOffset, 8), qid.Path); writeOffset -= 8;
             
             // Write Offset (the offset for the NEXT read to start at)
killedBy: NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_ReaddirAsync_Respects_Count_Limit; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_With_Only_MockBackend; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_Clone_Preserves_Backends_List

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:257:13
             // Write Qid
             entryBuffer[writeOffset++] = (byte)qid.Type;
             BinaryPrimitives.WriteUInt32LittleEndian(entryBuffer.AsSpan(writeOffset, 4), qid.Version); writeOffset += 4;
-            BinaryPrimitives.WriteUInt64LittleEndian(entryBuffer.AsSpan(writeOffset, 8), qid.Path); writeOffset += 8;
+            ; writeOffset += 8;
             
             // Write Offset (the offset for the NEXT read to start at)

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:260:13
             BinaryPrimitives.WriteUInt64LittleEndian(entryBuffer.AsSpan(writeOffset, 8), qid.Path); writeOffset += 8;
             
             // Write Offset (the offset for the NEXT read to start at)
-            BinaryPrimitives.WriteUInt64LittleEndian(entryBuffer.AsSpan(writeOffset, 8), currentCountOffset); writeOffset += 8;
+            ; writeOffset += 8;
             
             // Write Type
