[Survived] AddAssignmentExpression to SubtractAssignmentExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:260:111
             BinaryPrimitives.WriteUInt64LittleEndian(entryBuffer.AsSpan(writeOffset, 8), qid.Path); writeOffset += 8;
             
             // Write Offset (the offset for the NEXT read to start at)
-            BinaryPrimitives.WriteUInt64LittleEndian(entryBuffer.AsSpan(writeOffset, 8), currentCountOffset); writeOffset += 8;
+            BinaryPrimitives.WriteUInt64LittleEndian(entryBuffer.AsSpan(writeOffset, 8), currentCountOffset); writeOffset -= 8;
             
             // Write Type

[Survived] PostIncrementExpression to PostDecrementExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:263:25
             BinaryPrimitives.WriteUInt64LittleEndian(entryBuffer.AsSpan(writeOffset, 8), currentCountOffset); writeOffset += 8;
             
             // Write Type
-            entryBuffer[writeOffset++] = (byte)qid.Type;
+            entryBuffer[writeOffset--] = (byte)qid.Type;
             
             // Write Name

[Survived] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:266:13
             entryBuffer[writeOffset++] = (byte)qid.Type;
             
             // Write Name
-            BinaryPrimitives.WriteUInt16LittleEndian(entryBuffer.AsSpan(writeOffset, 2), (ushort)nameLen); writeOffset += 2;
+            ; writeOffset += 2;
             System.Text.Encoding.UTF8.GetBytes(name).CopyTo(entryBuffer.AsSpan(writeOffset, nameLen));
             writeOffset += nameLen;

[Survived] AddAssignmentExpression to SubtractAssignmentExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:266:108
             entryBuffer[writeOffset++] = (byte)qid.Type;
             
             // Write Name
-            BinaryPrimitives.WriteUInt16LittleEndian(entryBuffer.AsSpan(writeOffset, 2), (ushort)nameLen); writeOffset += 2;
+            BinaryPrimitives.WriteUInt16LittleEndian(entryBuffer.AsSpan(writeOffset, 2), (ushort)nameLen); writeOffset -= 2;
             System.Text.Encoding.UTF8.GetBytes(name).CopyTo(entryBuffer.AsSpan(writeOffset, nameLen));
             writeOffset += nameLen;

[Killed] Statement mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:267:13
             
             // Write Name
             BinaryPrimitives.WriteUInt16LittleEndian(entryBuffer.AsSpan(writeOffset, 2), (ushort)nameLen); writeOffset += 2;
-            System.Text.Encoding.UTF8.GetBytes(name).CopyTo(entryBuffer.AsSpan(writeOffset, nameLen));
+            ;
             writeOffset += nameLen;
             
killedBy: NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_With_Only_MockBackend; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_Clone_Preserves_Backends_List; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_With_Only_SecretBackend

[Survived] AddAssignmentExpression to SubtractAssignmentExpression mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:268:13
             // Write Name
             BinaryPrimitives.WriteUInt16LittleEndian(entryBuffer.AsSpan(writeOffset, 2), (ushort)nameLen); writeOffset += 2;
             System.Text.Encoding.UTF8.GetBytes(name).CopyTo(entryBuffer.AsSpan(writeOffset, nameLen));
-            writeOffset += nameLen;
+            writeOffset -= nameLen;
             
             entries.AddRange(entryBuffer);

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:279:13
         // We will just return the block of entries starting from the requested offset index.
         // For simplicity in this dummy root FS, if offset > 0, we'll try to slice chunks.
         
-        if (treaddir.Offset == 0)
+        if (treaddir.Offset != 0)
         {
              var chunk = allData.AsSpan(0, (int)Math.Min((long)treaddir.Count, (long)allData.Length)).ToArray();
killedBy: NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_With_Only_MockBackend; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_Clone_Preserves_Backends_List; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_ReaddirAsync_Pagination_With_Multiple_Backends

[Killed] Linq method mutation (Min() to Max())
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:281:49
         
         if (treaddir.Offset == 0)
         {
-             var chunk = allData.AsSpan(0, (int)Math.Min((long)treaddir.Count, (long)allData.Length)).ToArray();
+             var chunk = allData.AsSpan(0, (int)Math.Max((long)treaddir.Count, (long)allData.Length)).ToArray();
              return new Rreaddir((uint)(chunk.Length + NinePConstants.HeaderSize + 4), treaddir.Tag, (uint)chunk.Length, chunk);
         }
killedBy: NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_ReaddirAsync_Respects_Count_Limit; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_With_Only_MockBackend; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_Clone_Preserves_Backends_List

[Survived] Arithmetic mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:282:41
         if (treaddir.Offset == 0)
         {
              var chunk = allData.AsSpan(0, (int)Math.Min((long)treaddir.Count, (long)allData.Length)).ToArray();
-             return new Rreaddir((uint)(chunk.Length + NinePConstants.HeaderSize + 4), treaddir.Tag, (uint)chunk.Length, chunk);
+             return new Rreaddir((uint)(chunk.Length - NinePConstants.HeaderSize + 4), treaddir.Tag, (uint)chunk.Length, chunk);
         }
         else

[Survived] Arithmetic mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:282:41
         if (treaddir.Offset == 0)
         {
              var chunk = allData.AsSpan(0, (int)Math.Min((long)treaddir.Count, (long)allData.Length)).ToArray();
-             return new Rreaddir((uint)(chunk.Length + NinePConstants.HeaderSize + 4), treaddir.Tag, (uint)chunk.Length, chunk);
+             return new Rreaddir((uint)(chunk.Length + NinePConstants.HeaderSize - 4), treaddir.Tag, (uint)chunk.Length, chunk);
         }
         else

[Survived] Block removal mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:285:9
              return new Rreaddir((uint)(chunk.Length + NinePConstants.HeaderSize + 4), treaddir.Tag, (uint)chunk.Length, chunk);
         }
         else
-        {
-            // If offset > 0, we'd need to parse our generated list to find the element.
-            // Since Root FS is so small, we can re-generate it every time, but here we just return empty for subsequent reads for simplicity,
-            // assuming the first read (offset 0) fetched all mounts (they fit in a standard 8k buffer easily).
-            return new Rreaddir(NinePConstants.HeaderSize + 4, treaddir.Tag, 0, Array.Empty<byte>());
-        }
+        {}
     }
     public INinePFileSystem Clone()

[Survived] Object initializer mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:294:21
     }
     public INinePFileSystem Clone()
     {
-        var clone = new RootFileSystem(_backends, _clusterManager) { DotU = this.DotU };
+        var clone = new RootFileSystem(_backends, _clusterManager) {};
         if (_delegatedFs != null) clone._delegatedFs = _delegatedFs.Clone();
         return clone;

[Killed] Equality mutation
ninepsharp-stryker/NinePSharp/NinePSharp.Server/RootFileSystem.cs:295:13
     public INinePFileSystem Clone()
     {
         var clone = new RootFileSystem(_backends, _clusterManager) { DotU = this.DotU };
-        if (_delegatedFs != null) clone._delegatedFs = _delegatedFs.Clone();
+        if (_delegatedFs == null) clone._delegatedFs = _delegatedFs.Clone();
         return clone;
     }
killedBy: NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_StatRoundTrips; NinePSharp.Tests.ClusterFederationTests.RootWalk_RemoteMount_DelegatesToRemoteSession; NinePSharp.Tests.CrossBackendIntegrationTests.RootFileSystem_Clone_Preserves_Backends_List
