[Timeout] Arithmetic mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:32:71
 
         // ─── Parallel Optimization & Sharded Arenas ─────────────────────────
         
-        private static readonly int MaxParallelOps = (int)Math.Max(1, Environment.ProcessorCount * 0.8);
+        private static readonly int MaxParallelOps = (int)Math.Max(1, Environment.ProcessorCount / 0.8);
         private static readonly SemaphoreSlim ConcurrencyGovernor = new(MaxParallelOps, MaxParallelOps);
         private static int _concurrencyGovernorEnabled = 1;

[Timeout] Linq method mutation (Max() to Min())
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:32:59
 
         // ─── Parallel Optimization & Sharded Arenas ─────────────────────────
         
-        private static readonly int MaxParallelOps = (int)Math.Max(1, Environment.ProcessorCount * 0.8);
+        private static readonly int MaxParallelOps = (int)Math.Min(1, Environment.ProcessorCount * 0.8);
         private static readonly SemaphoreSlim ConcurrencyGovernor = new(MaxParallelOps, MaxParallelOps);
         private static int _concurrencyGovernorEnabled = 1;

[Timeout] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:36:62
         private static readonly SemaphoreSlim ConcurrencyGovernor = new(MaxParallelOps, MaxParallelOps);
         private static int _concurrencyGovernorEnabled = 1;
 
-        internal static bool IsConcurrencyGovernorEnabled => Volatile.Read(ref _concurrencyGovernorEnabled) == 1;
+        internal static bool IsConcurrencyGovernorEnabled => Volatile.Read(ref _concurrencyGovernorEnabled) != 1;
         internal static void SetConcurrencyGovernorEnabled(bool enabled) => Volatile.Write(ref _concurrencyGovernorEnabled, enabled ? 1 : 0);
 

[Timeout] Conditional (false) mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:37:125
         private static int _concurrencyGovernorEnabled = 1;
 
         internal static bool IsConcurrencyGovernorEnabled => Volatile.Read(ref _concurrencyGovernorEnabled) == 1;
-        internal static void SetConcurrencyGovernorEnabled(bool enabled) => Volatile.Write(ref _concurrencyGovernorEnabled, enabled ? 1 : 0);
+        internal static void SetConcurrencyGovernorEnabled(bool enabled) => Volatile.Write(ref _concurrencyGovernorEnabled, (false?1 :0));
 
         private static readonly ICpuMonitor? CpuMonitor;

[Timeout] Conditional (true) mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:37:125
         private static int _concurrencyGovernorEnabled = 1;
 
         internal static bool IsConcurrencyGovernorEnabled => Volatile.Read(ref _concurrencyGovernorEnabled) == 1;
-        internal static void SetConcurrencyGovernorEnabled(bool enabled) => Volatile.Write(ref _concurrencyGovernorEnabled, enabled ? 1 : 0);
+        internal static void SetConcurrencyGovernorEnabled(bool enabled) => Volatile.Write(ref _concurrencyGovernorEnabled, (true?1 :0));
 
         private static readonly ICpuMonitor? CpuMonitor;

[Timeout] Negate expression
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:47:17
         static LuxVault()
         {
             // Select platform-appropriate monitor
-            if (OperatingSystem.IsWindows())
+            if (!(OperatingSystem.IsWindows()))
             {
                 CpuMonitor = new WindowsCpuMonitor();

[Timeout] Block removal mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:48:13
         {
             // Select platform-appropriate monitor
             if (OperatingSystem.IsWindows())
-            {
-                CpuMonitor = new WindowsCpuMonitor();
-            }
+            {}
             else if (OperatingSystem.IsLinux())
             {

[Killed] Negate expression
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:51:22
             {
                 CpuMonitor = new WindowsCpuMonitor();
             }
-            else if (OperatingSystem.IsLinux())
+            else if (!(OperatingSystem.IsLinux()))
             {
                 CpuMonitor = new LinuxCpuMonitor();
killedBy: NinePSharp.Tests.Coyote.LuxVaultCoyoteMutationTests.Coyote_GetVaultPath_Directory_Creation_Race

[Timeout] Block removal mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:52:13
                 CpuMonitor = new WindowsCpuMonitor();
             }
             else if (OperatingSystem.IsLinux())
-            {
-                CpuMonitor = new LinuxCpuMonitor();
-            }
+            {}
 
             if (CpuMonitor != null)

[Timeout] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:56:17
                 CpuMonitor = new LinuxCpuMonitor();
             }
 
-            if (CpuMonitor != null)
+            if (CpuMonitor == null)
             {
                 // Start adaptive CPU monitoring - checks every 2 seconds

[Timeout] Block removal mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:57:13
             }
 
             if (CpuMonitor != null)
-            {
-                // Start adaptive CPU monitoring - checks every 2 seconds
-                CpuMonitorTimer = new Timer(_ => AdjustConcurrencyBasedOnCpu(), null,
-                    TimeSpan.FromSeconds(2), TimeSpan.FromSeconds(2));
-            }
+            {}
         }
 

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:66:37
 
         private static void AdjustConcurrencyBasedOnCpu()
         {
-            if (CpuMonitor == null) return;
+            if (CpuMonitor == null) ;
 
             // Rate limit adjustments to once per 5 seconds

[Timeout] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:66:17
 
         private static void AdjustConcurrencyBasedOnCpu()
         {
-            if (CpuMonitor == null) return;
+            if (CpuMonitor != null) return;
 
             // Rate limit adjustments to once per 5 seconds

[Timeout] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:69:17
             if (CpuMonitor == null) return;
 
             // Rate limit adjustments to once per 5 seconds
-            if ((DateTime.UtcNow - _lastAdjustment).TotalSeconds < 5) return;
+            if ((DateTime.UtcNow - _lastAdjustment).TotalSeconds > 5) return;
 
             try

[Timeout] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:69:17
             if (CpuMonitor == null) return;
 
             // Rate limit adjustments to once per 5 seconds
-            if ((DateTime.UtcNow - _lastAdjustment).TotalSeconds < 5) return;
+            if ((DateTime.UtcNow - _lastAdjustment).TotalSeconds <= 5) return;
 
             try

[Timeout] Negate expression
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:77:21
                 int targetLimit = _currentLimit;
 
                 // If system CPU > 80%, reduce our concurrency
-                if (currentCpu > 80f)
+                if (!(currentCpu > 80f))
                 {
                     targetLimit = Math.Max(1, _currentLimit - 1);

[Timeout] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:77:21
                 int targetLimit = _currentLimit;
 
                 // If system CPU > 80%, reduce our concurrency
-                if (currentCpu > 80f)
+                if (currentCpu < 80f)
                 {
                     targetLimit = Math.Max(1, _currentLimit - 1);

[Killed] Arithmetic mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:79:47
                 // If system CPU > 80%, reduce our concurrency
                 if (currentCpu > 80f)
                 {
-                    targetLimit = Math.Max(1, _currentLimit - 1);
+                    targetLimit = Math.Max(1, _currentLimit + 1);
                 }
                 // If system CPU < 60%, we can increase (up to MaxParallelOps)
killedBy: NinePSharp.Tests.LuxVaultStressTests.Stress_Volume_10M_Operations_Slab_Pool_Churn

[Timeout] Linq method mutation (Max() to Min())
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:79:35
                 // If system CPU > 80%, reduce our concurrency
                 if (currentCpu > 80f)
                 {
-                    targetLimit = Math.Max(1, _currentLimit - 1);
+                    targetLimit = Math.Min(1, _currentLimit - 1);
                 }
                 // If system CPU < 60%, we can increase (up to MaxParallelOps)

[Timeout] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:82:46
                     targetLimit = Math.Max(1, _currentLimit - 1);
                 }
                 // If system CPU < 60%, we can increase (up to MaxParallelOps)
-                else if (currentCpu < 60f && _currentLimit < MaxParallelOps)
+                else if (currentCpu < 60f && _currentLimit <= MaxParallelOps)
                 {
                     targetLimit = Math.Min(MaxParallelOps, _currentLimit + 1);

[Timeout] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:82:46
                     targetLimit = Math.Max(1, _currentLimit - 1);
                 }
                 // If system CPU < 60%, we can increase (up to MaxParallelOps)
-                else if (currentCpu < 60f && _currentLimit < MaxParallelOps)
+                else if (currentCpu < 60f && _currentLimit > MaxParallelOps)
                 {
                     targetLimit = Math.Min(MaxParallelOps, _currentLimit + 1);

[Timeout] Linq method mutation (Min() to Max())
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:84:35
                 // If system CPU < 60%, we can increase (up to MaxParallelOps)
                 else if (currentCpu < 60f && _currentLimit < MaxParallelOps)
                 {
-                    targetLimit = Math.Min(MaxParallelOps, _currentLimit + 1);
+                    targetLimit = Math.Max(MaxParallelOps, _currentLimit + 1);
                 }
 

[Timeout] Arithmetic mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:84:60
                 // If system CPU < 60%, we can increase (up to MaxParallelOps)
                 else if (currentCpu < 60f && _currentLimit < MaxParallelOps)
                 {
-                    targetLimit = Math.Min(MaxParallelOps, _currentLimit + 1);
+                    targetLimit = Math.Min(MaxParallelOps, _currentLimit - 1);
                 }
 

[Timeout] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:87:21
                     targetLimit = Math.Min(MaxParallelOps, _currentLimit + 1);
                 }
 
-                if (targetLimit != _currentLimit)
+                if (targetLimit == _currentLimit)
                 {
                     // Adjust semaphore by releasing or waiting

[Timeout] Arithmetic mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:90:33
                 if (targetLimit != _currentLimit)
                 {
                     // Adjust semaphore by releasing or waiting
-                    int delta = targetLimit - _currentLimit;
+                    int delta = targetLimit + _currentLimit;
                     if (delta > 0)
                     {

[Timeout] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:91:25
                 {
                     // Adjust semaphore by releasing or waiting
                     int delta = targetLimit - _currentLimit;
-                    if (delta > 0)
+                    if (delta >= 0)
                     {
                         ConcurrencyGovernor.Release(delta);

[Timeout] Negate expression
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:91:25
                 {
                     // Adjust semaphore by releasing or waiting
                     int delta = targetLimit - _currentLimit;
-                    if (delta > 0)
+                    if (!(delta > 0))
                     {
                         ConcurrencyGovernor.Release(delta);

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:93:25
                     int delta = targetLimit - _currentLimit;
                     if (delta > 0)
                     {
-                        ConcurrencyGovernor.Release(delta);
+                        ;
                     }
                     else if (delta < 0)

[Timeout] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:95:30
                     {
                         ConcurrencyGovernor.Release(delta);
                     }
-                    else if (delta < 0)
+                    else if (delta <= 0)
                     {
                         for (int i = 0; i < Math.Abs(delta); i++)

[Timeout] Negate expression
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:95:30
                     {
                         ConcurrencyGovernor.Release(delta);
                     }
-                    else if (delta < 0)
+                    else if (!(delta < 0))
                     {
                         for (int i = 0; i < Math.Abs(delta); i++)

[Timeout] PostIncrementExpression to PostDecrementExpression mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:97:62
                     }
                     else if (delta < 0)
                     {
-                        for (int i = 0; i < Math.Abs(delta); i++)
+                        for (int i = 0; i < Math.Abs(delta); i--)
                         {
                             ConcurrencyGovernor.Wait(0); 

[Timeout] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:97:41
                     }
                     else if (delta < 0)
                     {
-                        for (int i = 0; i < Math.Abs(delta); i++)
+                        for (int i = 0; i <= Math.Abs(delta); i++)
                         {
                             ConcurrencyGovernor.Wait(0); 

[Timeout] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:99:29
                     {
                         for (int i = 0; i < Math.Abs(delta); i++)
                         {
-                            ConcurrencyGovernor.Wait(0); 
+                            ; 
                         }
                     }

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:120:21
             {
                 try {
                     _counter = new PerformanceCounter("Processor", "% Processor Time", "_Total");
-                    _counter.NextValue();
+                    ;
                 } catch { _counter = null; }
             }

[NoCoverage] Block removal mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:121:25
                 try {
                     _counter = new PerformanceCounter("Processor", "% Processor Time", "_Total");
                     _counter.NextValue();
-                } catch { _counter = null; }
+                } catch {}
             }
             public float GetUsage() => _counter?.NextValue() ?? 0f;

[NoCoverage] Null coalescing mutation (remove left)
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:123:40
                     _counter.NextValue();
                 } catch { _counter = null; }
             }
-            public float GetUsage() => _counter?.NextValue() ?? 0f;
+            public float GetUsage() => 0f;
         }
 

[Timeout] Arithmetic mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:136:29
                     string loadStr = File.ReadAllText("/proc/loadavg").Split(' ')[0];
                     float load = float.Parse(loadStr);
                     // Convert load to a percentage based on core count
-                    return (load / Environment.ProcessorCount) * 100f;
+                    return (load * Environment.ProcessorCount) * 100f;
                 } catch { return 0f; }
             }

[Timeout] Arithmetic mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:136:28
                     string loadStr = File.ReadAllText("/proc/loadavg").Split(' ')[0];
                     float load = float.Parse(loadStr);
                     // Convert load to a percentage based on core count
-                    return (load / Environment.ProcessorCount) * 100f;
+                    return (load / Environment.ProcessorCount) / 100f;
                 } catch { return 0f; }
             }

[NoCoverage] Block removal mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:137:25
                     float load = float.Parse(loadStr);
                     // Convert load to a percentage based on core count
                     return (load / Environment.ProcessorCount) * 100f;
-                } catch { return 0f; }
+                } catch {}
             }
         }

[Killed] Arithmetic mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:142:48
         }
 
         public static readonly SecureMemoryArena[] Arenas = Enumerable.Range(0, MaxParallelOps)
-            .Select(_ => new SecureMemoryArena(1024 * 1024)) // 1MB per shard
+            .Select(_ => new SecureMemoryArena(1024 / 1024)) // 1MB per shard
             .ToArray();
 
killedBy: NinePSharp.Tests.GridRobustnessTests.Arena_Exhaustion_Does_Not_Crash_Server; NinePSharp.Tests.GridRobustnessTests.LuxVault_MAC_Corruption_Fuzz_Property

[Killed] Arithmetic mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:150:25
         /// </summary>
         internal static SecureMemoryArena GetLocalArena()
         {
-            int index = Math.Abs(Thread.CurrentThread.ManagedThreadId) % Arenas.Length;
+            int index = Math.Abs(Thread.CurrentThread.ManagedThreadId) * Arenas.Length;
             return Arenas[index];
         }
killedBy: NinePSharp.Tests.MemorySafetyTests.LuxVault_DecryptToBytes_Zeros_Intermediate_Buffers; NinePSharp.Tests.MemorySafetyTests.LuxVault_Concurrent_Operations_Dont_Leak; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Dispose_Zeros_Internal_Memory

[Timeout] Conditional (false) mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:156:28
 
         private static ConcurrencyGovernorGuard AcquireConcurrencyGovernor()
         {
-            var governor = Volatile.Read(ref _concurrencyGovernorEnabled) == 1 ? ConcurrencyGovernor : null;
+            var governor = (false?ConcurrencyGovernor :null);
             return new ConcurrencyGovernorGuard(governor);
         }

[Timeout] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:156:28
 
         private static ConcurrencyGovernorGuard AcquireConcurrencyGovernor()
         {
-            var governor = Volatile.Read(ref _concurrencyGovernorEnabled) == 1 ? ConcurrencyGovernor : null;
+            var governor = Volatile.Read(ref _concurrencyGovernorEnabled) != 1 ? ConcurrencyGovernor : null;
             return new ConcurrencyGovernorGuard(governor);
         }

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:167:17
             public ConcurrencyGovernorGuard(SemaphoreSlim? governor)
             {
                 _governor = governor;
-                _governor?.Wait();
+                ;
             }
 
killedBy: NinePSharp.Tests.MemorySafetyTests.LuxVault_DecryptToBytes_Zeros_Intermediate_Buffers; NinePSharp.Tests.MemorySafetyTests.LuxVault_Concurrent_Operations_Dont_Leak; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Dispose_Zeros_Internal_Memory

[Timeout] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:172:17
 
             public void Dispose()
             {
-                _governor?.Release();
+                ;
             }
         }

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:184:17
 
         public static void InitializeSessionKey(ReadOnlySpan<byte> sessionKey)
         {
-            if (Volatile.Read(ref _sessionKey) != null) return;
+            if (Volatile.Read(ref _sessionKey) == null) return;
 
             lock (SessionKeyInitLock)
killedBy: NinePSharp.Tests.LuxVaultPropertyTests.Session_Key_Is_Actually_Pinned

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:184:57
 
         public static void InitializeSessionKey(ReadOnlySpan<byte> sessionKey)
         {
-            if (Volatile.Read(ref _sessionKey) != null) return;
+            if (Volatile.Read(ref _sessionKey) != null) ;
 
             lock (SessionKeyInitLock)

[Timeout] Boolean mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:190:83
             {
                 if (_sessionKey != null) return;
 
-                var pinnedKey = GC.AllocateArray<byte>(sessionKey.Length, pinned: true);
+                var pinnedKey = GC.AllocateArray<byte>(sessionKey.Length, pinned: false);
                 sessionKey.CopyTo(pinnedKey);
                 unsafe {

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:191:17
                 if (_sessionKey != null) return;
 
                 var pinnedKey = GC.AllocateArray<byte>(sessionKey.Length, pinned: true);
-                sessionKey.CopyTo(pinnedKey);
+                ;
                 unsafe {
                     fixed (byte* pKey = pinnedKey) {
killedBy: NinePSharp.Tests.Coyote.LuxVaultCoyoteMutationTests.Coyote_InitializeSessionKey_Concurrent_Race_Condition

[Timeout] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:194:25
                 sessionKey.CopyTo(pinnedKey);
                 unsafe {
                     fixed (byte* pKey = pinnedKey) {
-                        MemoryLock.Lock((IntPtr)pKey, (nuint)pinnedKey.Length);
+                        ;
                     }
                 }

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:197:17
                         MemoryLock.Lock((IntPtr)pKey, (nuint)pinnedKey.Length);
                     }
                 }
-                Volatile.Write(ref _sessionKey, pinnedKey);
+                ;
             }
         }
killedBy: NinePSharp.Tests.Coyote.LuxVaultCoyoteMutationTests.Coyote_InitializeSessionKey_Concurrent_Race_Condition

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:203:13
 
         public static string GetVaultPath(string filename)
         {
-            Directory.CreateDirectory(VaultDirectory);
+            ;
             return Path.Combine(VaultDirectory, filename);
         }
killedBy: NinePSharp.Tests.LuxVaultPropertyTests.GetVaultPath_Creates_Directory_If_Not_Exists

[Killed] Negate expression
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:209:17
 
         public static void CleanupVaults()
         {
-            if (Directory.Exists(VaultDirectory))
+            if (!(Directory.Exists(VaultDirectory)))
             {
                 try { Directory.Delete(VaultDirectory, true); } catch { /* Ignore */ }
killedBy: NinePSharp.Tests.ServerVaultLifecycleTests.Shutdown_Cleans_Vault_Directory; NinePSharp.Tests.ServerVaultLifecycleTests.Startup_Cleans_Vault_Directory

[Killed] Boolean mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:211:56
         {
             if (Directory.Exists(VaultDirectory))
             {
-                try { Directory.Delete(VaultDirectory, true); } catch { /* Ignore */ }
+                try { Directory.Delete(VaultDirectory, false); } catch { /* Ignore */ }
             }
             try { Directory.CreateDirectory(VaultDirectory); } catch { /* Ignore */ }
killedBy: NinePSharp.Tests.ServerVaultLifecycleTests.Shutdown_Cleans_Vault_Directory; NinePSharp.Tests.ServerVaultLifecycleTests.Startup_Cleans_Vault_Directory

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:211:23
         {
             if (Directory.Exists(VaultDirectory))
             {
-                try { Directory.Delete(VaultDirectory, true); } catch { /* Ignore */ }
+                try { ; } catch { /* Ignore */ }
             }
             try { Directory.CreateDirectory(VaultDirectory); } catch { /* Ignore */ }
killedBy: NinePSharp.Tests.ServerVaultLifecycleTests.Shutdown_Cleans_Vault_Directory; NinePSharp.Tests.ServerVaultLifecycleTests.Startup_Cleans_Vault_Directory

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:213:19
             {
                 try { Directory.Delete(VaultDirectory, true); } catch { /* Ignore */ }
             }
-            try { Directory.CreateDirectory(VaultDirectory); } catch { /* Ignore */ }
+            try { ; } catch { /* Ignore */ }
         }
 
killedBy: NinePSharp.Tests.ServerVaultLifecycleTests.Shutdown_Cleans_Vault_Directory; NinePSharp.Tests.ServerVaultLifecycleTests.Startup_Cleans_Vault_Directory

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:218:17
 
         public static string GenerateHiddenId(ReadOnlySpan<byte> seed)
         {
-            if (seed.Length != 32) throw new ArgumentException("Seed must be exactly 32 bytes.");
+            if (seed.Length == 32) throw new ArgumentException("Seed must be exactly 32 bytes.");
 
             using var gate = AcquireConcurrencyGovernor();
killedBy: NinePSharp.Tests.VaultRegressionTests.Property_LuxVault_HiddenId_No_Seed_Mutation; NinePSharp.Tests.LuxVaultTests.LuxVault_HiddenId_Derivation_Consistent; NinePSharp.Tests.LuxVaultTests.LuxVault_HiddenId_DifferentSeeds_DifferentOutput

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:218:36
 
         public static string GenerateHiddenId(ReadOnlySpan<byte> seed)
         {
-            if (seed.Length != 32) throw new ArgumentException("Seed must be exactly 32 bytes.");
+            if (seed.Length != 32) ;
 
             using var gate = AcquireConcurrencyGovernor();

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:226:13
             using var hidden = new SecureBuffer(32, arena);
             using var secretKey = new SecureBuffer(32, arena);
             Span<byte> seedCopy = stackalloc byte[32];
-            seed.CopyTo(seedCopy);
+            ;
 
             unsafe
killedBy: NinePSharp.Tests.LuxVaultTests.LuxVault_HiddenId_DifferentSeeds_DifferentOutput; NinePSharp.Tests.LuxVaultSecurityTests.LuxVault_HiddenId_PasswordSensitivity_Property

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:232:21
             {
                 fixed (byte* pSeed = seedCopy, pHidden = hidden.Span, pSecret = secretKey.Span)
                 {
-                    MonocypherNative.crypto_elligator_key_pair(pHidden, pSecret, pSeed);
+                    ;
                 }
             }
killedBy: NinePSharp.Tests.LuxVaultTests.LuxVault_HiddenId_DifferentSeeds_DifferentOutput; NinePSharp.Tests.LuxVaultSecurityTests.LuxVault_HiddenId_PasswordSensitivity_Property; NinePSharp.Tests.LuxVaultSecurityTests.LuxVault_HiddenId_Uniqueness

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:253:25
                     int length = secureString.Length;
                     char* chars = (char*)ptr.ToPointer();
                     int byteCount = Encoding.UTF8.GetByteCount(chars, length);
-                    if (byteCount == 0) return action(ReadOnlySpan<byte>.Empty);
+                    if (byteCount != 0) return action(ReadOnlySpan<byte>.Empty);
                     
                     using (var secureBuffer = new SecureBuffer(byteCount, GetLocalArena()))
killedBy: NinePSharp.Tests.LuxVaultPropertyTests.WithSecureString_Buffer_Size_Calculation_Handles_UTF8_Correctly; NinePSharp.Tests.GridSideEffectTests.LuxVault_Store_SideEffect_Is_Opaque

[Timeout] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:275:17
         private static void MixSessionKey(ReadOnlySpan<byte> input, Span<byte> output)
         {
             var sessionKey = Volatile.Read(ref _sessionKey);
-            if (sessionKey == null)
+            if (sessionKey != null)
             {
                 input.CopyTo(output);

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:277:17
             var sessionKey = Volatile.Read(ref _sessionKey);
             if (sessionKey == null)
             {
-                input.CopyTo(output);
+                ;
                 return;
             }

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:278:17
             if (sessionKey == null)
             {
                 input.CopyTo(output);
-                return;
+                ;
             }
             

[Killed] Arithmetic mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:281:50
                 return;
             }
             
-            using (var buffer = new SecureBuffer(input.Length + sessionKey.Length, GetLocalArena()))
+            using (var buffer = new SecureBuffer(input.Length - sessionKey.Length, GetLocalArena()))
             {
                 input.CopyTo(buffer.Span);
killedBy: NinePSharp.Tests.MemorySafetyTests.LuxVault_DecryptToBytes_Zeros_Intermediate_Buffers; NinePSharp.Tests.MemorySafetyTests.LuxVault_Concurrent_Operations_Dont_Leak; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Dispose_Zeros_Internal_Memory

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:283:17
             
             using (var buffer = new SecureBuffer(input.Length + sessionKey.Length, GetLocalArena()))
             {
-                input.CopyTo(buffer.Span);
+                ;
                 sessionKey.CopyTo(buffer.Span.Slice(input.Length));
                 unsafe {
killedBy: NinePSharp.Tests.LuxVaultTests.LuxVault_RoundTrip_Works

[Timeout] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:284:17
             using (var buffer = new SecureBuffer(input.Length + sessionKey.Length, GetLocalArena()))
             {
                 input.CopyTo(buffer.Span);
-                sessionKey.CopyTo(buffer.Span.Slice(input.Length));
+                ;
                 unsafe {
                     fixed (byte* pMixed = output, pBuffer = buffer.Span) {
