[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:287:25
                 sessionKey.CopyTo(buffer.Span.Slice(input.Length));
                 unsafe {
                     fixed (byte* pMixed = output, pBuffer = buffer.Span) {
-                        MonocypherNative.crypto_blake2b_ptr(pMixed, (nuint)output.Length, pBuffer, (nuint)buffer.Length);
+                        ;
                     }
                 }
killedBy: NinePSharp.Tests.LuxVaultTests.LuxVault_RoundTrip_Works

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:295:17
 
         public static void DeriveSeed(string password, ReadOnlySpan<byte> nonce, Span<byte> output)
         {
-            if (password == null) throw new ArgumentNullException(nameof(password));
+            if (password != null) throw new ArgumentNullException(nameof(password));
             if (nonce.Length < 8) throw new ArgumentException("Nonce must be at least 8 bytes.");
 
killedBy: NinePSharp.Tests.MemorySafetyTests.LuxVault_DecryptToBytes_Zeros_Intermediate_Buffers; NinePSharp.Tests.MemorySafetyTests.LuxVault_Concurrent_Operations_Dont_Leak; NinePSharp.Tests.MemorySafetyTests.LuxVault_Multiple_Decrypt_Operations_Dont_Leak

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:295:35
 
         public static void DeriveSeed(string password, ReadOnlySpan<byte> nonce, Span<byte> output)
         {
-            if (password == null) throw new ArgumentNullException(nameof(password));
+            if (password == null) ;
             if (nonce.Length < 8) throw new ArgumentException("Nonce must be at least 8 bytes.");
 

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:296:17
         public static void DeriveSeed(string password, ReadOnlySpan<byte> nonce, Span<byte> output)
         {
             if (password == null) throw new ArgumentNullException(nameof(password));
-            if (nonce.Length < 8) throw new ArgumentException("Nonce must be at least 8 bytes.");
+            if (nonce.Length > 8) throw new ArgumentException("Nonce must be at least 8 bytes.");
 
             using (var rawSeed = new SecureBuffer(KeySize, GetLocalArena()))
killedBy: NinePSharp.Tests.VaultRegressionTests.Property_LuxVault_Encryption_RoundTrip; NinePSharp.Tests.GridRobustnessTests.LuxVault_MAC_Corruption_Fuzz_Property; NinePSharp.Tests.LuxVaultScalingTests.Linear_Scaling_Benchmark

[Killed] Negate expression
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:296:17
         public static void DeriveSeed(string password, ReadOnlySpan<byte> nonce, Span<byte> output)
         {
             if (password == null) throw new ArgumentNullException(nameof(password));
-            if (nonce.Length < 8) throw new ArgumentException("Nonce must be at least 8 bytes.");
+            if (!(nonce.Length < 8)) throw new ArgumentException("Nonce must be at least 8 bytes.");
 
             using (var rawSeed = new SecureBuffer(KeySize, GetLocalArena()))
killedBy: NinePSharp.Tests.MemorySafetyTests.LuxVault_DecryptToBytes_Zeros_Intermediate_Buffers; NinePSharp.Tests.MemorySafetyTests.LuxVault_Concurrent_Operations_Dont_Leak; NinePSharp.Tests.MemorySafetyTests.LuxVault_Multiple_Decrypt_Operations_Dont_Leak

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:300:17
 
             using (var rawSeed = new SecureBuffer(KeySize, GetLocalArena()))
             {
-                Rfc2898DeriveBytes.Pbkdf2(password, nonce, rawSeed.Span, Iterations, HashAlgorithmName.SHA256);
+                ;
                 MixSessionKey(rawSeed.Span, output);
             }
killedBy: NinePSharp.Tests.LuxVaultScalingTests.Linear_Scaling_Benchmark; NinePSharp.Tests.LuxVaultTests.LuxVault_RoundTrip_Works; NinePSharp.Tests.LuxVaultPropertyTests.Tampering_Any_Byte_Causes_Decryption_Failure

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:301:17
             using (var rawSeed = new SecureBuffer(KeySize, GetLocalArena()))
             {
                 Rfc2898DeriveBytes.Pbkdf2(password, nonce, rawSeed.Span, Iterations, HashAlgorithmName.SHA256);
-                MixSessionKey(rawSeed.Span, output);
+                ;
             }
         }
killedBy: NinePSharp.Tests.LuxVaultTests.LuxVault_RoundTrip_Works; NinePSharp.Tests.LuxVaultPropertyTests.Tampering_Any_Byte_Causes_Decryption_Failure; NinePSharp.Tests.LuxVaultPropertyTests.Salt_Tampering_Causes_Failure

[Killed] Negate expression
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:307:17
 
         public static unsafe void DeriveSeed(SecureString password, ReadOnlySpan<byte> nonce, Span<byte> output)
         {
-            if (nonce.Length < 8) throw new ArgumentException("Nonce must be at least 8 bytes.");
+            if (!(nonce.Length < 8)) throw new ArgumentException("Nonce must be at least 8 bytes.");
             
             byte[] localNonce = nonce.ToArray();
killedBy: NinePSharp.Tests.GridSideEffectTests.LuxVault_Store_SideEffect_Is_Opaque

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:307:17
 
         public static unsafe void DeriveSeed(SecureString password, ReadOnlySpan<byte> nonce, Span<byte> output)
         {
-            if (nonce.Length < 8) throw new ArgumentException("Nonce must be at least 8 bytes.");
+            if (nonce.Length > 8) throw new ArgumentException("Nonce must be at least 8 bytes.");
             
             byte[] localNonce = nonce.ToArray();
killedBy: NinePSharp.Tests.GridSideEffectTests.LuxVault_Store_SideEffect_Is_Opaque

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:313:17
             fixed (byte* pOutput = output)
             {
                 byte* pOutputLocal = pOutput;
-                WithSecureString(password, bytes => {
-                    using (var rawSeed = new SecureBuffer(KeySize, GetLocalArena()))
-                    {
-                        Rfc2898DeriveBytes.Pbkdf2(bytes, localNonce, rawSeed.Span, Iterations, HashAlgorithmName.SHA256);
-                        MixSessionKey(rawSeed.Span, new Span<byte>(pOutputLocal, KeySize));
-                        return true;
-                    }
-                });
+                ;
             }
         }
killedBy: NinePSharp.Tests.GridSideEffectTests.LuxVault_Store_SideEffect_Is_Opaque

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:316:25
                 WithSecureString(password, bytes => {
                     using (var rawSeed = new SecureBuffer(KeySize, GetLocalArena()))
                     {
-                        Rfc2898DeriveBytes.Pbkdf2(bytes, localNonce, rawSeed.Span, Iterations, HashAlgorithmName.SHA256);
+                        ;
                         MixSessionKey(rawSeed.Span, new Span<byte>(pOutputLocal, KeySize));
                         return true;
killedBy: NinePSharp.Tests.LuxVaultSecurityTests.LuxVault_DeriveSeed_SecureString_Consistency_Property; NinePSharp.Tests.GridSideEffectTests.LuxVault_Store_SideEffect_Is_Opaque

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:317:25
                     using (var rawSeed = new SecureBuffer(KeySize, GetLocalArena()))
                     {
                         Rfc2898DeriveBytes.Pbkdf2(bytes, localNonce, rawSeed.Span, Iterations, HashAlgorithmName.SHA256);
-                        MixSessionKey(rawSeed.Span, new Span<byte>(pOutputLocal, KeySize));
+                        ;
                         return true;
                     }
killedBy: NinePSharp.Tests.LuxVaultSecurityTests.LuxVault_DeriveSeed_SecureString_Consistency_Property; NinePSharp.Tests.LuxVaultSecurityTests.LuxVault_Encrypt_SecureString_Consistency_Property; NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock

[Timeout] Boolean mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:318:32
                     {
                         Rfc2898DeriveBytes.Pbkdf2(bytes, localNonce, rawSeed.Span, Iterations, HashAlgorithmName.SHA256);
                         MixSessionKey(rawSeed.Span, new Span<byte>(pOutputLocal, KeySize));
-                        return true;
+                        return false;
                     }
                 });

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:330:17
 
             using (var rawSeed = new SecureBuffer(KeySize, GetLocalArena()))
             {
-                Rfc2898DeriveBytes.Pbkdf2(passwordBytes, nonce, rawSeed.Span, Iterations, HashAlgorithmName.SHA256);
+                ;
                 MixSessionKey(rawSeed.Span, output);
             }
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:331:17
             using (var rawSeed = new SecureBuffer(KeySize, GetLocalArena()))
             {
                 Rfc2898DeriveBytes.Pbkdf2(passwordBytes, nonce, rawSeed.Span, Iterations, HashAlgorithmName.SHA256);
-                MixSessionKey(rawSeed.Span, output);
+                ;
             }
         }
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Timeout] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:341:13
             using var gate = AcquireConcurrencyGovernor();
 
             Span<byte> salt = stackalloc byte[SaltSize];
-            RandomNumberGenerator.Fill(salt);
+            ;
             using (var key = new SecureBuffer(KeySize, GetLocalArena()))
             {

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:344:17
             RandomNumberGenerator.Fill(salt);
             using (var key = new SecureBuffer(KeySize, GetLocalArena()))
             {
-                DeriveSeed(password, salt, key.Span);
+                ;
                 return EncryptInternal(plaintext, key.Span, salt);
             }
killedBy: NinePSharp.Tests.MemorySafetyTests.LuxVault_DecryptToBytes_Zeros_Intermediate_Buffers; NinePSharp.Tests.MemorySafetyTests.LuxVault_Concurrent_Operations_Dont_Leak; NinePSharp.Tests.MemorySafetyTests.LuxVault_Multiple_Decrypt_Operations_Dont_Leak

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:371:17
             RandomNumberGenerator.Fill(salt);
             using (var key = new SecureBuffer(KeySize, GetLocalArena()))
             {
-                DeriveSeed(keyMaterial, salt, key.Span);
+                ;
                 return EncryptInternal(plaintext, key.Span, salt);
             }
killedBy: NinePSharp.Tests.ProtectedSecretTests.ProtectedSecret_RoundTrip_Works; NinePSharp.Tests.ProtectedSecretTests.ProtectedSecret_SecureString_RoundTrip_Works; NinePSharp.Tests.ProtectedSecretTests.ProtectedSecret_ReadOnlySpan_Constructor_Works

[Killed] Arithmetic mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:378:44
 
         private static byte[] EncryptInternal(ReadOnlySpan<byte> plaintext, ReadOnlySpan<byte> key, ReadOnlySpan<byte> salt)
         {
-            byte[] finalPayload = new byte[SaltSize + NonceSize + MacSize + plaintext.Length];
+            byte[] finalPayload = new byte[SaltSize - NonceSize + MacSize + plaintext.Length];
             salt.CopyTo(finalPayload.AsSpan(0, SaltSize));
             
killedBy: NinePSharp.Tests.MemorySafetyTests.LuxVault_DecryptToBytes_Zeros_Intermediate_Buffers; NinePSharp.Tests.MemorySafetyTests.LuxVault_Concurrent_Operations_Dont_Leak; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Dispose_Zeros_Internal_Memory

[Killed] Arithmetic mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:378:44
 
         private static byte[] EncryptInternal(ReadOnlySpan<byte> plaintext, ReadOnlySpan<byte> key, ReadOnlySpan<byte> salt)
         {
-            byte[] finalPayload = new byte[SaltSize + NonceSize + MacSize + plaintext.Length];
+            byte[] finalPayload = new byte[SaltSize + NonceSize + MacSize - plaintext.Length];
             salt.CopyTo(finalPayload.AsSpan(0, SaltSize));
             
killedBy: NinePSharp.Tests.MemorySafetyTests.LuxVault_DecryptToBytes_Zeros_Intermediate_Buffers; NinePSharp.Tests.MemorySafetyTests.LuxVault_Concurrent_Operations_Dont_Leak; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Dispose_Zeros_Internal_Memory

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:379:13
         private static byte[] EncryptInternal(ReadOnlySpan<byte> plaintext, ReadOnlySpan<byte> key, ReadOnlySpan<byte> salt)
         {
             byte[] finalPayload = new byte[SaltSize + NonceSize + MacSize + plaintext.Length];
-            salt.CopyTo(finalPayload.AsSpan(0, SaltSize));
+            ;
             
             using var nonce = new SecureBuffer(NonceSize, GetLocalArena());
killedBy: NinePSharp.Tests.MemorySafetyTests.LuxVault_DecryptToBytes_Zeros_Intermediate_Buffers; NinePSharp.Tests.MemorySafetyTests.LuxVault_Concurrent_Operations_Dont_Leak; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Dispose_Zeros_Internal_Memory

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:382:13
             salt.CopyTo(finalPayload.AsSpan(0, SaltSize));
             
             using var nonce = new SecureBuffer(NonceSize, GetLocalArena());
-            RandomNumberGenerator.Fill(nonce.Span);
+            ;
             nonce.Span.CopyTo(finalPayload.AsSpan(SaltSize, NonceSize));
             
killedBy: NinePSharp.Tests.LuxVaultPropertyTests.Nonce_Uniqueness_Prevents_Replay_Attacks

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:383:13
             
             using var nonce = new SecureBuffer(NonceSize, GetLocalArena());
             RandomNumberGenerator.Fill(nonce.Span);
-            nonce.Span.CopyTo(finalPayload.AsSpan(SaltSize, NonceSize));
+            ;
             
             using var mac = new SecureBuffer(MacSize, GetLocalArena());
killedBy: NinePSharp.Tests.MemorySafetyTests.LuxVault_DecryptToBytes_Zeros_Intermediate_Buffers; NinePSharp.Tests.MemorySafetyTests.LuxVault_Concurrent_Operations_Dont_Leak; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Dispose_Zeros_Internal_Memory

[Killed] Arithmetic mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:390:37
             unsafe {
                 fixed (byte* pPayload = finalPayload, pMac = mac.Span, pKey = key, pNonce = nonce.Span, pPlain = plaintext) 
                 {
-                    byte* pCipher = pPayload + SaltSize + NonceSize + MacSize;
+                    byte* pCipher = pPayload + SaltSize - NonceSize + MacSize;
                     MonocypherNative.crypto_aead_lock(pCipher, pMac, pKey, pNonce, null, 0, pPlain, (nuint)plaintext.Length);
                 }
killedBy: NinePSharp.Tests.MemorySafetyTests.LuxVault_DecryptToBytes_Zeros_Intermediate_Buffers; NinePSharp.Tests.MemorySafetyTests.LuxVault_Concurrent_Operations_Dont_Leak; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Dispose_Zeros_Internal_Memory

[Killed] Arithmetic mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:390:37
             unsafe {
                 fixed (byte* pPayload = finalPayload, pMac = mac.Span, pKey = key, pNonce = nonce.Span, pPlain = plaintext) 
                 {
-                    byte* pCipher = pPayload + SaltSize + NonceSize + MacSize;
+                    byte* pCipher = pPayload + SaltSize + NonceSize - MacSize;
                     MonocypherNative.crypto_aead_lock(pCipher, pMac, pKey, pNonce, null, 0, pPlain, (nuint)plaintext.Length);
                 }
killedBy: NinePSharp.Tests.MemorySafetyTests.LuxVault_DecryptToBytes_Zeros_Intermediate_Buffers; NinePSharp.Tests.MemorySafetyTests.LuxVault_Concurrent_Operations_Dont_Leak; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Dispose_Zeros_Internal_Memory

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:391:21
                 fixed (byte* pPayload = finalPayload, pMac = mac.Span, pKey = key, pNonce = nonce.Span, pPlain = plaintext) 
                 {
                     byte* pCipher = pPayload + SaltSize + NonceSize + MacSize;
-                    MonocypherNative.crypto_aead_lock(pCipher, pMac, pKey, pNonce, null, 0, pPlain, (nuint)plaintext.Length);
+                    ;
                 }
             }
killedBy: NinePSharp.Tests.MemorySafetyTests.LuxVault_DecryptToBytes_Zeros_Intermediate_Buffers; NinePSharp.Tests.MemorySafetyTests.LuxVault_Concurrent_Operations_Dont_Leak; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Dispose_Zeros_Internal_Memory

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:395:13
                 }
             }
 
-            mac.Span.CopyTo(finalPayload.AsSpan(SaltSize + NonceSize, MacSize));
+            ;
             return finalPayload;
         }
killedBy: NinePSharp.Tests.MemorySafetyTests.LuxVault_DecryptToBytes_Zeros_Intermediate_Buffers; NinePSharp.Tests.MemorySafetyTests.LuxVault_Concurrent_Operations_Dont_Leak; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Dispose_Zeros_Internal_Memory

[Killed] Arithmetic mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:395:49
                 }
             }
 
-            mac.Span.CopyTo(finalPayload.AsSpan(SaltSize + NonceSize, MacSize));
+            mac.Span.CopyTo(finalPayload.AsSpan(SaltSize - NonceSize, MacSize));
             return finalPayload;
         }
killedBy: NinePSharp.Tests.MemorySafetyTests.LuxVault_DecryptToBytes_Zeros_Intermediate_Buffers; NinePSharp.Tests.MemorySafetyTests.LuxVault_Concurrent_Operations_Dont_Leak; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Dispose_Zeros_Internal_Memory

[Killed] Negate expression
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:401:17
 
         public static SecureSecret? DecryptToBytes(byte[] payload, string password)
         {
-            if (payload == null || payload.Length < SaltSize + NonceSize + MacSize) return null;
+            if (!(payload == null || payload.Length < SaltSize + NonceSize + MacSize)) return null;
             using var gate = AcquireConcurrencyGovernor();
 
killedBy: NinePSharp.Tests.VaultRegressionTests.Property_LuxVault_Encryption_RoundTrip; NinePSharp.Tests.LuxVaultScalingTests.Linear_Scaling_Benchmark; NinePSharp.Tests.MemorySafetyTests.LuxVault_DecryptToBytes_Zeros_Intermediate_Buffers

[Killed] Arithmetic mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:401:53
 
         public static SecureSecret? DecryptToBytes(byte[] payload, string password)
         {
-            if (payload == null || payload.Length < SaltSize + NonceSize + MacSize) return null;
+            if (payload == null || payload.Length < SaltSize + NonceSize - MacSize) return null;
             using var gate = AcquireConcurrencyGovernor();
 
killedBy: NinePSharp.Tests.LuxVaultPropertyTests.DecryptToBytes_Exact_Boundary_Validation_String_Password; NinePSharp.Tests.LuxVaultPropertyTests.Truncated_Payloads_Are_Rejected; NinePSharp.Tests.LuxVaultPropertyTests.Malformed_Payloads_Never_Crash

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:406:17
 
             using (var key = new SecureBuffer(KeySize, GetLocalArena()))
             {
-                DeriveSeed(password, payload.AsSpan(0, SaltSize), key.Span);
+                ;
                 return DecryptInternal(payload, key.Span);
             }
killedBy: NinePSharp.Tests.VaultRegressionTests.Property_LuxVault_Encryption_RoundTrip; NinePSharp.Tests.LuxVaultScalingTests.Linear_Scaling_Benchmark; NinePSharp.Tests.MemorySafetyTests.LuxVault_DecryptToBytes_Zeros_Intermediate_Buffers

[Killed] Arithmetic mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:413:53
 
         public static SecureSecret? DecryptToBytes(byte[] payload, SecureString password)
         {
-            if (payload == null || payload.Length < SaltSize + NonceSize + MacSize) return null;
+            if (payload == null || payload.Length < SaltSize - NonceSize + MacSize) return null;
             using var gate = AcquireConcurrencyGovernor();
 
killedBy: NinePSharp.Tests.LuxVaultPropertyTests.DecryptToBytes_Exact_Boundary_Validation_SecureString_Password

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:425:17
 
         public static SecureSecret? DecryptToBytes(byte[] payload, ReadOnlySpan<byte> keyMaterial)
         {
-            if (payload == null || payload.Length < SaltSize + NonceSize + MacSize) return null;
+            if (payload != null || payload.Length < SaltSize + NonceSize + MacSize) return null;
             using var gate = AcquireConcurrencyGovernor();
 
killedBy: NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Dispose_Zeros_Internal_Memory; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Exception_During_Use_Still_Zeros_Memory; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Zeros_Memory_After_Use

[Killed] Logical mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:425:17
 
         public static SecureSecret? DecryptToBytes(byte[] payload, ReadOnlySpan<byte> keyMaterial)
         {
-            if (payload == null || payload.Length < SaltSize + NonceSize + MacSize) return null;
+            if (payload == null && payload.Length < SaltSize + NonceSize + MacSize) return null;
             using var gate = AcquireConcurrencyGovernor();
 
killedBy: NinePSharp.Tests.LuxVaultPropertyTests.DecryptToBytes_Exact_Boundary_Validation_Bytes_KeyMaterial

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:430:17
 
             using (var key = new SecureBuffer(KeySize, GetLocalArena()))
             {
-                DeriveSeed(keyMaterial, payload.AsSpan(0, SaltSize), key.Span);
+                ;
                 return DecryptInternal(payload, key.Span);
             }
killedBy: NinePSharp.Tests.VaultRegressionTests.ProtectedSecret_Use_Wipes_Memory_After_Call; NinePSharp.Tests.VaultRegressionTests.ProtectedSecret_Constructor_Wipes_Input_Buffer; NinePSharp.Tests.MemorySafetyTests.ProtectedSecret_Dispose_Zeros_Internal_Memory

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:437:36
 
         public static SecureSecret? DecryptToBytesWithPasswordBytes(byte[] payload, ReadOnlySpan<byte> passwordBytes)
         {
-            if (payload == null || payload.Length < SaltSize + NonceSize + MacSize) return null;
+            if (payload == null || payload.Length > SaltSize + NonceSize + MacSize) return null;
             using var gate = AcquireConcurrencyGovernor();
 
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:442:17
 
             using (var key = new SecureBuffer(KeySize, GetLocalArena()))
             {
-                DeriveSeed(passwordBytes, payload.AsSpan(0, SaltSize), key.Span);
+                ;
                 return DecryptInternal(payload, key.Span);
             }
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:451:13
         {
             var encrypted = Encrypt(plaintext, password);
             using var seed = new SecureBuffer(KeySize, GetLocalArena());
-            DeriveSeed(password, Encoding.UTF8.GetBytes(name), seed.Span);
+            ;
             var hiddenId = GenerateHiddenId(seed.Span);
             var path = GetVaultPath($"secret_{hiddenId}.vlt");
killedBy: NinePSharp.Tests.LuxVaultPropertyTests.Lifecycle_Store_Load_Delete_Sequence; NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:454:13
             DeriveSeed(password, Encoding.UTF8.GetBytes(name), seed.Span);
             var hiddenId = GenerateHiddenId(seed.Span);
             var path = GetVaultPath($"secret_{hiddenId}.vlt");
-            File.WriteAllBytes(path, encrypted);
+            ;
         }
 
killedBy: NinePSharp.Tests.LuxVaultPropertyTests.Lifecycle_Store_Load_Delete_Sequence; NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:465:21
             {
                 var hiddenId = GenerateHiddenId(seed.Span);
                 var path = GetVaultPath($"secret_{hiddenId}.vlt");
-                if (!File.Exists(path)) return null;
+                if (File.Exists(path)) return null;
 
                 var encrypted = File.ReadAllBytes(path);
killedBy: NinePSharp.Tests.LuxVaultPropertyTests.Lifecycle_Store_Load_Delete_Sequence; NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:479:13
         {
             byte[] nameBytes = Encoding.UTF8.GetBytes(name);
             using var seed = new SecureBuffer(KeySize, GetLocalArena());
-            DeriveSeed(passwordBytes, nameBytes, seed.Span);
+            ;
             try
             {
killedBy: NinePSharp.Tests.SecretBackendRegressionTests.Read_Uses_PhysicalVault_Stream_And_Sees_Updated_Secret_After_Unlock; NinePSharp.Tests.SecretBackendRegressionTests.Unlock_State_Persists_Across_New_FileSystem_Instances

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:491:17
             }
             finally
             {
-                Array.Clear(nameBytes);
+                ;
             }
         }

[Killed] Conditional (false) mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:539:20
         public static string? Decrypt(byte[] payload, string password)
         {
             using var secret = DecryptToBytes(payload, password);
-            return secret == null ? null : Encoding.UTF8.GetString(secret.Span);
+            return (false?null :Encoding.UTF8.GetString(secret.Span));
         }
 
killedBy: NinePSharp.Tests.LuxVaultSecurityTests.LuxVault_PayloadIntegrity_Exhaustive

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:539:20
         public static string? Decrypt(byte[] payload, string password)
         {
             using var secret = DecryptToBytes(payload, password);
-            return secret == null ? null : Encoding.UTF8.GetString(secret.Span);
+            return secret != null ? null : Encoding.UTF8.GetString(secret.Span);
         }
 
killedBy: NinePSharp.Tests.LuxVaultSecurityTests.LuxVault_EdgeCases; NinePSharp.Tests.LuxVaultSecurityTests.LuxVault_PayloadIntegrity_Exhaustive; NinePSharp.Tests.LuxVaultSecurityTests.LuxVault_RoundTrip_Property

[NoCoverage] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:553:20
         public static string? Decrypt(byte[] payload, ReadOnlySpan<byte> keyMaterial)
         {
             using var secret = DecryptToBytes(payload, keyMaterial);
-            return secret == null ? null : Encoding.UTF8.GetString(secret.Span);
+            return secret != null ? null : Encoding.UTF8.GetString(secret.Span);
         }
 

[NoCoverage] Conditional (false) mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:553:20
         public static string? Decrypt(byte[] payload, ReadOnlySpan<byte> keyMaterial)
         {
             using var secret = DecryptToBytes(payload, keyMaterial);
-            return secret == null ? null : Encoding.UTF8.GetString(secret.Span);
+            return (false?null :Encoding.UTF8.GetString(secret.Span));
         }
 

[Killed] Block removal mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:557:9
         }
 
         public static string ProtectConfig(string plainText, ReadOnlySpan<byte> masterKey)
-        {
-            var ciphertext = Encrypt(Encoding.UTF8.GetBytes(plainText), masterKey);
-            return "secret://" + Convert.ToBase64String(ciphertext);
-        }
+        {}
 
         public static string? UnprotectConfig(string secretUri, ReadOnlySpan<byte> masterKey)
killedBy: NinePSharp.Tests.ConfigSecretResolverTests.ConfigSecretResolver_Resolves_Recursive_Secrets; NinePSharp.Tests.LuxVaultTests.LuxVault_ConfigProtection_Works

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:564:17
 
         public static string? UnprotectConfig(string secretUri, ReadOnlySpan<byte> masterKey)
         {
-            if (!secretUri.StartsWith("secret://")) return secretUri;
+            if (secretUri.StartsWith("secret://")) return secretUri;
             var base64 = secretUri.Substring("secret://".Length);
             var ciphertext = Convert.FromBase64String(base64);
killedBy: NinePSharp.Tests.LuxVaultTests.LuxVault_ConfigProtection_Works
