[Killed] String Method Mutation (Replace StartsWith() with EndsWith())
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:564:18
 
         public static string? UnprotectConfig(string secretUri, ReadOnlySpan<byte> masterKey)
         {
-            if (!secretUri.StartsWith("secret://")) return secretUri;
+            if (!secretUri.EndsWith("secret://")) return secretUri;
             var base64 = secretUri.Substring("secret://".Length);
             var ciphertext = Convert.FromBase64String(base64);
killedBy: NinePSharp.Tests.LuxVaultTests.LuxVault_ConfigProtection_Works

[Killed] Conditional (true) mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:568:20
             var base64 = secretUri.Substring("secret://".Length);
             var ciphertext = Convert.FromBase64String(base64);
             using var secret = DecryptToBytes(ciphertext, masterKey);
-            return secret == null ? null : Encoding.UTF8.GetString(secret.Span);
+            return (true?null :Encoding.UTF8.GetString(secret.Span));
         }
     }
killedBy: NinePSharp.Tests.LuxVaultTests.LuxVault_ConfigProtection_Works

[Killed] Equality mutation
NinePSharp/NinePSharp.Server/utils/LuxVault.cs:568:20
             var base64 = secretUri.Substring("secret://".Length);
             var ciphertext = Convert.FromBase64String(base64);
             using var secret = DecryptToBytes(ciphertext, masterKey);
-            return secret == null ? null : Encoding.UTF8.GetString(secret.Span);
+            return secret != null ? null : Encoding.UTF8.GetString(secret.Span);
         }
     }
killedBy: NinePSharp.Tests.ConfigSecretResolverTests.ConfigSecretResolver_Resolves_Recursive_Secrets; NinePSharp.Tests.LuxVaultTests.LuxVault_ConfigProtection_Works
