[Survived] Negate expression
NinePSharp/NinePSharp.Server/utils/ProcessHardening.cs:13:13
     /// </summary>
     public static void Apply()
     {
-        if (RuntimeInformation.IsOSPlatform(OSPlatform.Linux))
+        if (!(RuntimeInformation.IsOSPlatform(OSPlatform.Linux)))
         {
             // Disable core dumps and ptrace attaching for non-root users

[Survived] Equality mutation
NinePSharp/NinePSharp.Server/utils/ProcessHardening.cs:17:17
         {
             // Disable core dumps and ptrace attaching for non-root users
             int result = NativeMethods.prctl(NativeMethods.PR_SET_DUMPABLE, 0, 0, 0, 0);
-            if (result != 0)
+            if (result == 0)
             {
                 Console.WriteLine("[WARNING] Failed to set PR_SET_DUMPABLE. Process may be dumpable.");

[NoCoverage] Statement mutation
NinePSharp/NinePSharp.Server/utils/ProcessHardening.cs:19:17
             int result = NativeMethods.prctl(NativeMethods.PR_SET_DUMPABLE, 0, 0, 0, 0);
             if (result != 0)
             {
-                Console.WriteLine("[WARNING] Failed to set PR_SET_DUMPABLE. Process may be dumpable.");
+                ;
             }
             else

[Survived] Statement mutation
NinePSharp/NinePSharp.Server/utils/ProcessHardening.cs:23:17
             }
             else
             {
-                Console.WriteLine("[INFO] Anti-Dumping protection enabled (PR_SET_DUMPABLE=0).");
+                ;
             }
         }
