[Killed] Statement mutation
NinePSharp/NinePSharp.Server/vault/VaultService.cs:24:13
         public byte[] ToBytes()
         {
             var ms = new MemoryStream();
-            ms.Write(Salt);
+            ;
             ms.Write(Nonce);
             ms.Write(Tag);
killedBy: NinePSharp.Tests.Utils.VaultServiceTests.Base64_Serialization_Works

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/vault/VaultService.cs:25:13
         {
             var ms = new MemoryStream();
             ms.Write(Salt);
-            ms.Write(Nonce);
+            ;
             ms.Write(Tag);
             ms.Write(Ciphertext);
killedBy: NinePSharp.Tests.Utils.VaultServiceTests.Base64_Serialization_Works

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/vault/VaultService.cs:26:13
             var ms = new MemoryStream();
             ms.Write(Salt);
             ms.Write(Nonce);
-            ms.Write(Tag);
+            ;
             ms.Write(Ciphertext);
             return ms.ToArray();
killedBy: NinePSharp.Tests.Utils.VaultServiceTests.Base64_Serialization_Works

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/vault/VaultService.cs:27:13
             ms.Write(Salt);
             ms.Write(Nonce);
             ms.Write(Tag);
-            ms.Write(Ciphertext);
+            ;
             return ms.ToArray();
         }
killedBy: NinePSharp.Tests.Utils.VaultServiceTests.Base64_Serialization_Works

[Killed] Object initializer mutation
NinePSharp/NinePSharp.Server/vault/VaultService.cs:33:20
 
         public static EncryptedPayload FromBytes(byte[] data)
         {
-            return new EncryptedPayload
-            {
-                Salt = data[..16],
-                Nonce = data[16..28],
-                Tag = data[28..44],
-                Ciphertext = data[44..]
-            };
+            return new EncryptedPayload
+{};
         }
     }
killedBy: NinePSharp.Tests.Utils.VaultServiceTests.Base64_Serialization_Works

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/vault/VaultService.cs:54:9
         var tag = new byte[16];
 
         using var aes = new AesGcm(key, 16);
-        aes.Encrypt(nonce, plaintextBytes, ciphertext, tag);
+        ;
 
         return new EncryptedPayload
killedBy: NinePSharp.Tests.Utils.VaultServiceTests.Base64_Serialization_Works; NinePSharp.Tests.Utils.VaultServiceTests.EncryptDecrypt_RoundTrip_Works

[Killed] Statement mutation
NinePSharp/NinePSharp.Server/vault/VaultService.cs:71:9
         var plaintextBytes = new byte[payload.Ciphertext.Length];
 
         using var aes = new AesGcm(key, 16);
-        aes.Decrypt(payload.Nonce, payload.Ciphertext, payload.Tag, plaintextBytes);
+        ;
 
         return Encoding.UTF8.GetString(plaintextBytes);
killedBy: NinePSharp.Tests.Utils.VaultServiceTests.Base64_Serialization_Works; NinePSharp.Tests.Utils.VaultServiceTests.EncryptDecrypt_RoundTrip_Works; NinePSharp.Tests.Utils.VaultServiceTests.Decrypt_WithWrongPassword_Throws

[Killed] Block removal mutation
NinePSharp/NinePSharp.Server/vault/VaultService.cs:77:5
     }
 
     private static byte[] DeriveKey(string password, byte[] salt)
-    {
-        return Rfc2898DeriveBytes.Pbkdf2(password, salt, Iterations, HashAlgorithmName.SHA256, KeySize);
-    }
+    {}
 }
 
killedBy: NinePSharp.Tests.Utils.VaultServiceTests.Base64_Serialization_Works; NinePSharp.Tests.Utils.VaultServiceTests.EncryptDecrypt_RoundTrip_Works; NinePSharp.Tests.Utils.VaultServiceTests.Decrypt_WithWrongPassword_Throws
